{"doc_id": "arxiv:2511.06427", "source": "arxiv", "lang": "en", "pdf_path": "data/raw/arxiv/pdf/2511.06427.pdf", "meta": {"doc_id": "arxiv:2511.06427", "source": "arxiv", "arxiv_id": "2511.06427", "title": "Dutch Metaphor Extraction from Cancer Patients' Interviews and Forum Data using LLMs and Human in the Loop", "authors": ["Lifeng Han", "David Lindevelt", "Sander Puts", "Erik van Mulligen", "Suzan Verberne"], "published": "2025-11-09T15:49:47Z", "updated": "2025-11-09T15:49:47Z", "summary": "Metaphors and metaphorical language (MLs) play an important role in healthcare communication between clinicians, patients, and patients' family members. In this work, we focus on Dutch language data from cancer patients. We extract metaphors used by patients using two data sources: (1) cancer patient storytelling interview data and (2) online forum data, including patients' posts, comments, and questions to professionals. We investigate how current state-of-the-art large language models (LLMs) perform on this task by exploring different prompting strategies such as chain of thought reasoning, few-shot learning, and self-prompting. With a human-in-the-loop setup, we verify the extracted metaphors and compile the outputs into a corpus named HealthQuote.NL. We believe the extracted metaphors can support better patient care, for example shared decision making, improved communication between patients and clinicians, and enhanced patient health literacy. They can also inform the design of personalized care pathways. We share prompts and related resources at https://github.com/aaronlifenghan/HealthQuote.NL", "query": "(cat:cs.CL OR cat:cs.LG) AND (all:\"large language model\" OR all:LLM) AND (all:medical OR all:clinical OR all:healthcare)", "url_abs": "http://arxiv.org/abs/2511.06427v1", "url_pdf": "https://arxiv.org/pdf/2511.06427.pdf", "meta_path": "data/raw/arxiv/meta/2511.06427.json", "sha256": "9db905392616ec3911fb457b66f042230c749802c6399f84b8ab97c082eed542", "status": "ok", "fetched_at": "2026-02-18T02:28:04.661379+00:00"}, "pages": [{"page": 1, "text": "Dutch Metaphor Extraction from Cancer Patients’ Interviews and\nForum Data using LLMs and Human in the Loop\nLifeng Han1,2, David Lindevelt2, Sander Puts3, Erik van Mulligen4, Suzan Verberne2\non behalf of 4D PICTURE\n1Biomedical Data Sciences, Leiden University Medical Center, NL\n2Leiden Institute of Advanced Computer Science (LIACS), Leiden University, NL\n3Department of Radiation Oncology (MAASTRO), GROW Research Institute for Oncology and Reproduction,\nMaastricht University Medical Centre+, Maastricht, NL\n4Department of Medical Informatics, Erasmus University Medical Center Rotterdam, NL\n{l.han, s.verberne}@liacs.leidenuniv.nl\nAbstract\nMetaphors and Metaphorical Languages (MLs) play an important role in healthcare for the information communication\nbetween clinicians, patients, and patients’ family members. In this work, we focus on the Dutch language and cancer\npatients’ data. We extract the metaphors used by patients using two data resources: 1) cancer patient storytelling\ninterview data, 2) online forum, data including cancer patients’ posts, comments, and questions to professionals. We\ninvestigate how current state of the art LLMs and perform on this task by exploring different prompting strategies\nsuch as Chain of Thought, few-shot learning, and self-prompting. With human in the loop, we verify the extracted\nmetaphors and collect the output as a corpus, named “HealthQuote.NL”. We believe the extracted metaphors can be\nuseful for supporting better patient care, e.g. shared decision making, helping communication between patients and\nclinicians, patient health literacy, etc. It can also be integrated into the design of a care path. We share our prompts\nand related resources at https://github.com/aaronlifenghan/HealthQuote.NL.\nKeywords: Metaphor, Healthcare, Cancer Patients, Dutch language, LLMs\n1.\nIntroduction\nAccording to the Contemporary theory of metaphor,\na metaphor is “a cross-domain mapping in the\nconceptual system” (Lakoff, 1993). Metaphor can\nbe expressed in different linguistic units, such as\nwords, phrases, or sentence levels. People use\nmetaphors in daily life with or without realising them.\nIn the healthcare domain, metaphors can play\na helpful role in the communication between care-\ngivers and cancer patients (Semino et al., 2017b;\nHarrington, 2012; Liu et al., 2024): patients can be\nhelped by comparing their cancer treatment pro-\ncess to e.g. journeys or battles. In the UK, the\nMetaphor Menu has been a successful project, pub-\nlishing a pamphlet of potentially helpful metaphors\nfor patients living with cancer.1\nIn this paper, we take the first steps in collecting\na set of Dutch-language metaphors related to living\nwith cancer. We extract these metaphors from pa-\ntient utterances, both spoken (transcribed) and writ-\nten. To this end, we analyse two distinct corpora of\nDutch patient narratives: interviews and blog posts\n(kanker.nl). We experiment with a suite of small,\nlocal LLMs and a range of prompting techniques to\nextract metaphors from texts. After analysing the\noutput with simple instruction prompts, we identify\n7 challenges for this task, including hallucination of\n1https://wp.lancs.ac.uk/melc/\nthe-metaphor-menu/\nmetaphors, figurative language or idioms mistaken\nas metaphors, and abstraction instead of extrac-\ntion of the originally mentioned metaphors. With\nmore advanced prompting techniques, including\nchain-of-thought and iterative self-prompting, we\nwere able to address these challenges to some\nextent and extract useful metaphors from the two\ndatasets.\nIn summary, our contributions are: (1) We have\ndeveloped an advanced prompting strategy for\nsmall LLMs to extract and analyse metaphors from\npatient narratives successfully; (2) Using this strat-\negy, we collect a set of 65 Dutch metaphors related\nto living with cancer from patient interview tran-\nscription data; (3) We used alternative prompts for\npatient forum data and extracted another 65 dis-\ntinctive metaphors from the written text data. Fur-\nthermore, we mapped some of the metaphors from\nforum data to the original English Metaphor Menu.\nThis collection can be the starting point for a Dutch\nmetaphor menu to help patients and caregivers\ncommunicate about their illness, treatment, and\nwellbeing.2\n2Regarding data sharing of HealthQuote.NL, to pro-\ntect patients’ privacy, we generate paraphrased and syn-\nthetic examples using the metaphors we extracted from\nonline forum text.\narXiv:2511.06427v1  [cs.CL]  9 Nov 2025\n"}, {"page": 2, "text": "2.\nRelated Work\nIn this section, we introduce works from three\nperspectives:\nmetaphor identification in Dutch,\nmetaphor cancer, and metaphors in Dutch health-\ncare.\n2.1.\nMetaphor Identification in Dutch\nRegarding metaphor identification and extraction\nmethods in Dutch, to the best of our knowledge,\nlittle work has been done.\nOne PhD thesis by\nPasma (2011) focused on metaphor and register\nvariation in Dutch news discourse. They extended\nthe metaphor identification procedure (MIP) from\nGroup (2007) by adapting it to some new situa-\ntion when “cross-domain mapping” appears for cer-\ntain words, including “direct metaphor”, “implicit\nmetaphor”, and “metaphor flag”. This adaptation\nhas been applied to the Dutch discourse corpus\non news texts. The MIP principle is a symbolic text\nexamination on a word-by-word basis. Later on,\nthere have been a few works published as book\nchapters (non-open-access books) by the same\nresearch group, following the PhD thesis project,\nincluding (Pasma, 2012, 2019).\nAnother loosely related work is from De Knop\nand Perrez (2014), which studies the conceptual\nmetaphors of Dutch and German for efficient teach-\ning and, alternatively, aims at verifying them.\nOur work will be the first exploring and investi-\ngating LLMs for Dutch metaphor identification and\nextraction.\n2.2.\nMetaphors in Cancer\nVarious researchers have conducted metaphor\nstudies within the cancer domain.\nReview arti-\ncles in this topic include Harrington (2012); Liu\net al. (2024). Semino et al. (2017a) carried out\ncomparative studies on metaphors used by cancer\npatients vs health professionals at online forums\nin the UK between 2007 and 2013. It included\n56 patients and 307 health professionals.\nThe\nstudy showed that “violence” and “journey” related\nmetaphors are not necessarily negative or positive\nby default. It depends on how they are used. The\n“violence” metaphors were further studied and dis-\ncussed in their following work on communicating\nnuanced results in Language Consultancy (Demjén\nand Semino, 2020). Similar work was conducted\nby Declercq et al. (2023) on metaphors use of ma-\nchines, journeys, and prisons for chronic pain pa-\ntients in consultations to describe pain, illness, and\nmedicines.\nThere are courses designed, e.g. “Cancer as\nMetaphor” by Penson et al. (2004) for explaining\nthe strengths and weaknesses of using metaphor\nin patient-caregiver relationships. The instructions\ncovered different roles, including facilitator, oncolo-\ngist, psychiatrist, and psychologist.\nFocusing on the staging, researchers studied\n“imprisonment”, “burden”, “battle”, and “journey”\nmetaphors on patients living with advanced cancer\nusing blog posts (Hommerberg et al., 2020), and a\nfocus group design with eighteen people on cancer\nsurvivor (Appleton and Flynn, 2014).\nFrom a gender perspective, Gibbs Jr and Franks\n(2002) studied the relation between language use\nand thoughts from 6 females who live with cancer.\nFrom cancer types, Pfeifer et al. (2024) conducted\na study on how metaphors can help the communi-\ncation of information exchange from breast cancer\npatients about depressive symptoms.\nThere are also focused studies on language or\nregion-specific, e.g. Spanish (online forum) (Ma-\ngaña and Matlock, 2018), the UK (corpus-based)\n(Semino et al., 2017b), American and Nigerian (self-\nhelp books) on “military, journey, personification,\nand sports” (Nwankwo, 2024).\nMost work has focused on one source of data,\ne.g. either online data, interviews, or books. How-\never, we aim to explore the difference between ver-\nbal and online-written data. Similar to (Semino\net al., 2017b), in the interview data we have, there\nare 3 roles (patient, significant other, and inter-\nviewer), but in Dutch (the Netherlands) instead of\nEnglish (UK).\n2.3.\nMetaphors in Dutch Healthcare\nTo our best knowledge, there is no prior work on\nDutch-language metaphors in the cancer domain.\nHowever, there is some work on metaphor-related\nresearch in other Dutch healthcare domains that\nwe list here.\nTo better understand the stigma toward dementia\npatients, Creten et al. (2022) conducted sentiment\nanalysis of Dutch language using tweets from 2019\nto 2020 into seven dimensions, including joke and\nmetaphor, in addition to others such as informa-\ntion, organization, personal experience, politics,\nand ridicule. The authors identified 10% of the\ntweets were metaphorical during manual coding.\nTo study the needs of hypertensive patients\nexpressing themselves using metaphors, analo-\ngies, and symbols, such as the causes and con-\nsequences of the illness, Schuster et al. (2011)\nused 55 patients of three ethnic groups in the\nNetherlands, including Creole, Dutch, and Hindus-\ntani descent, for in-depth interviews.\nThe find-\ning shows that patients use machine and enemy-\nrelated metaphors to explain the origins and con-\nsequences of hypertension, with its characteristics\nof silence, invisibility, and uncontrollability.\nIn another study by Hillen et al. (2025), the au-\nthors investigated the usage of metaphoric lan-\nguage by clinicians for family members of ICU pa-\n"}, {"page": 3, "text": "tients. They sampled 36 neonatal, pediatric, and\nadult patients, together with 104 of their family mem-\nbers. Using the transcribed and anonymised audio\nrecording of conversations, the findings show that\nmetaphors were used frequently and predominantly\nby clinicians to share clinical information and the\nawareness of using metaphors by clinicians can\nimprove effective information exchange. However,\nthe authors also discussed that both harms and\nbenefits arise from clinicians using metaphors, e.g.\nshared decision making (SDM) might be hindered\nif clinicians actively and consciously use metaphor\nto steer the families into a direction they consider\nas the best for patients.\nIn contrast to this, in our work, we aim to iden-\ntify and extract metaphors used by patients and\ntheir family members (significant others), for better\nsupport of patient care.\n3.\nMethods Design and Development\nTo identify metaphors used in texts in patient\nrecords, we explore different kinds of techniques\non prompting LLMs, including Persona (Lutz et al.,\n2025), chain of thought (CoT) (Saparov and He,\n2023), iterative self-prompting (ISP, aka LLM-\nassisted prompting) (Romero et al., 2025; Ren et al.,\n2025), and knowledge-inserted prompting (Dong\net al., 2024). To analyse if the structure, size of\nLLMs, and their pre-trained domain knowledge mat-\nter, we use LLMs from different sizes and structures,\nas well as domain-specific ones, including models\npre-trained on medical knowledge.\nAs shown in Figure 1, the initial prompt we used is\nthe “Instruction Prompt (I.inP)” using Persona, role\nof “system” and “user”, without CoTs. Messages\nwe used for prompting are:\n• \"role\": \"system\", \"content\": \"You are an assis-\ntant that processes and analyses documents.\"\n• \"role\": \"user\", \"content\": \"Here is the doc-\nument: <document-content> Please tell me\nmetaphors that people used in the conversa-\ntion in this document and list them in bullet\npoints. Can you offer the English translation\nversion too? Can you also offer the full sen-\ntences in which the metaphors were used?\"\nThen, in the refined prompts (RPs), we added\nCoT and ISP by asking LLMs to generate prompts\nfor such a task. After a few iterations of refine-\nment, the LLM-assisted long and structured prompt\nmessage for this task includes the following key\ncomponents3:\n3We share the detailed prompts at a public GitHub\npage\nhttps://github.com/aaronlifenghan/\nHealthQuote.NL\n• Persona: an expert linguist\n• Strict Extraction Protocol\n– Document Scanning\n– Metaphor Identification, CoTs with exam-\nples\n– Verification Requirements, different levels\n– Data Extraction Format\n– Structured Output (Population)\n• Quality Control Rules\n• Final Instructions\nAmong the Refined Prompts (RP v1 and v2),\nthe difference is that for v1, we only gave three\nsimple and short metaphorical sentences for few-\nshot prompting:\n• \"This treatment is a journey\" (medical process\n→travel)\n• \"Fighting cancer\" (disease →war)\n• \"The tumor is growing like a weed\" (cancer →\nplant)\nFor v2, we inserted the entire English Metaphor\nMenu list (17 from the public website (Metaphor\nMenu, Lancaster University, 2025)) with our cat-\negorisation.\nThe different settings for RP-v1\nand RP-v2 are to investigate 1) if the English\nMetaphor Menu can guide the LLMs to extract bet-\nter metaphors; 2) if the English Metaphor Menu will\nintroduce bias to LLMs to extract only metaphors\nlike the English metaphors.\nFor automatic verification (auto.verify), we imple-\nmented an external checklist tool for LLMs: if they\nare able to find the exact text in the document that\nexpresses the metaphor, identify the exact section,\nidentify the speaker’s role (when there are multiple\nroles), and identify the metaphor (not literal medical\nterms).\nFor extracted metaphors, we ask LLMs to group\nthem into 1) types: word, phrase, sentence, and\nextended, 2) source domain: violence, journey, na-\nture (garden), games, music, fairground, unwanted\nguests, religion, control, building, machine, and\nother, and 3) function in context: explanation, cop-\ning, empowerment, relationship, prognosis, treat-\nment, emotion, and humour.\nFor security and privacy reasons on process-\ning patients’ data, even though they are already\nanonymised, we prioritise to use local LLMs through\nthe ollama platform4 over commercial models. The\nopen-source models we used include both medical\nand general domains.\n4https://ollama.com/library\n"}, {"page": 4, "text": "Refined Prompts\nv2 (CoT+ \nen.meta.menu)\nv1(CoT)\nLLMs\ndocuments\nresponses\nauto.verify\nfalse\ntrue\nhuman-verify\nsuggested \nmetaphors\nconfiguration\nChunking\nLLMs type\n…\nkanker.nl\npatientST\nrecursive\nInstruction Prompt\nsizes, structures, domains\nFigure 1: HealthQuote.NL: Extraction Framework using LLMs and Human in the Loop.\n4.\nExperiments\n4.1.\nData\nFor Patient Story Telling (patientST) Interview\ndata, we used the transcriptions of 13 documents\nfrom 13 interviews in an oncology setting obtained\nfrom (Griffioen et al., 2021). There are three roles\nfor each interview: cancer patient, a family mem-\nber or friend of the patient (significant other), and\ninterviewer (researcher). They are specified as\nP (Patiënt), N (Naaste), and O (Onderzoeker) in\nthe free text. The largest document has 13,777\nwords and 32 pages, while the smallest document\nhas 5,596 words and 16 pages. See Figure 2 for\nstatistics per document.\nFor cancer patient forum data, we have a col-\nlection in Dutch of 15,653 blogs, 17,290 comments,\n2,246 group discussions, 5,777 “ask a professional”\nitems in which experts answer questions from pa-\ntients, and 10,134 reactions on “ask a professional”\nfrom three cancer types: breast cancer (3,524),\nprostate cancer (2,613), and melanoma (614). The\npatient content includes treatment phases, treat-\nments, and long-term consequences.\nWe have approval to use both the two sets of\ndata for research. We can not disclose the original\nforum text. Considering this, instead of displaying\nthe original text, we will give paraphrases or syn-\nthetic example texts generated from the extracted\nmetaphors.\nFigure 2: Interview Data Statistics.\n4.2.\nModel Parameter Settings\nThe models, parameters, and their values we ex-\nplored (model configuration) are:\n• Prompts: Instruction Prompt (IP), RP-v1, RP-\nv2\n• Text split: max-token=4000, overlap-token:\n40, char-per-token: 4\n• Models:\nqwen3:8b,\ngemma3:12b,\ngemma3:27b,\nllama3.1:8b,\nmistral:7b,\ndeepseek-r1:8b, meditron:7b, medllama2:7b\n• Options: context size window=32768, temper-\nature=0.8, top-k=40, top-p=0.9\nAmong these parameters, higher temperature\nallows LLMs to generate more diverse or creative\noutputs, but also increase the chance of nonsen-\nsical, irrelevant, or factually incorrect outputs. The\n"}, {"page": 5, "text": "rationale we set up the temperature higher (0.8)\nis that we expect the LLMs to suggest alternative\nmetaphors for some situations whenever there is a\nchance for better communication, when there are\nno actual metaphors used in some text.\n4.3.\nOutput with initial instruction prompt\nWe first list some challenges with example outputs\nusing llama3.1:8b and only initial Instruction Prompt\n(I.InP) without CoT on interview data:\n1) Some abstractive or paraphrased sum-\nmarised metaphors, instead of extractive: e.g. a)\nfrom Doc-6: \"Een strijd voeren voor je lijf\" (Fighting\na battle for your body) from Full sentence: \"Dat doe\nje ook deels voor je familie. Want die vinden, ja die\nwillen graag dat je blijft en dan zegt het lijf vanzelf\n’ja ik ga knokken’.\" (You do it also partly for your\nfamily. Because they want to stay and then your\nbody says itself \"yes I’ll fight\"); and another one b)\nfrom Doc-12: \"Het is alsof je in de nacht ziet en je\nweet niet wat er aan de hand is\" (It’s like seeing\nthings in the dark and not knowing what’s going on)\nfrom Full sentence: \"Maar het was alsof ik in de\nnacht stond en niets zag. Ik wist niet wat er aan de\nhand was.\" (\"But it was like standing in the night\nand seeing nothing. I didn’t know what was going\non.\")\n2) Fail to translate simple sentences: e.g. from\nDoc-8: De zonsondergang van zijn leven\" (“no di-\nrect English translation” from LLM, shall be “the\nsunset of his life”) but it gave an explanation of the\nmetaphor: “using sunset as a metaphor for the end\nof one’s life”.\n3) Suggesting metaphors output plain text: e.g.\nfrom Doc-9: For the original text in Dutch: \"Het is\nheel belangrijk dat patiënten heel positief blijven\nen de familie ook - niet alleen familie, vrienden-\nmeepraten en vooral niet bang zijn\" (translation in\nEnglish: \"It’s very important for patients to stay pos-\nitive and for the family too - not just family, friends\n- to discuss things and especially not be afraid\"),\nLLM suggests the following metaphor: “Comparing\nthe patient’s journey to a ship navigating through\nstormy waters. The speaker emphasises the im-\nportance of staying positive and discussing things\nopenly.”, which can be useful in communication to\nsupport patients illustratively.\n4) Figurative language rather than strict\nmetaphors: e.g. in Doc-9: the original Dutch text \"Ik\ndenk dat we allemaal een beetje te vroeg geboren\nzijn\" (translation in English: \"I think we’re all a bit\ntoo early born\"). It was interpreted as metaphor by\nLLM “Comparing human beings to products that\nare not yet ready for use. The speaker humorously\nsuggests that they and their family members are\nstill learning how to navigate the healthcare system.”\nHowever, this is more as a figurative language ex-\npression, instead of metaphor mapping A to B.\n5) Over-Interpreting metaphors: e.g.\nfrom\nDoc-10, a metaphor \"een klein schip in de storm\"\n(English Translation: \"A small ship in a storm\") is\nsuggested from “het wachten” (\"the waiting\"), al-\nthough the context did not say much about this\nmetaphor. Instead, the researcher was asking the\npatient about the concern of process, as quoted be-\nlow. “O: Heel goed, dank u. Wat in het hele traject\nvond u eng of vervelend? P: Het wachten. O: Wat\nwaren met name de momenten van het wachten?\n” (translation: “O: Very good, thank you. What did\nyou find scary or annoying about the whole pro-\ncess? P: The waiting. O: What were the specific\nmoments of waiting?”)\nDespite these issues, we were able to extract\nand collect 28 metaphors from the 13 interviews\nafter human verification using the initial instruction\nprompt. They reflect some of the source domains\nwe defined later for the refined prompts, including\njourney, religion, control, machine, nature, and vio-\nlence. From a functional perspective, they can help\ncommunicate: feeling, hospital, process, dealing,\nlife. These also reflect our function design in RPs\n(Section 3).\nWe also explored I.inP with verification tool\n(I.inP.VT) control and the original English Metaphor\nMenu webpage link (I.inP.V.L). Overall, 7 were re-\nidentified by the model, however, there are also 3\nvariations and 13 new ones generated, together\nwith the original 28 resulting in 41 in total from\nthe initial instruction prompts. For examples of\nvariations, e.g. from Doc-1, the full sentence \"P: Ja,\ndie morfine maakt dat je, die die heeft me ook wel\nangstig gemaakt.\" (\"P: Yes, that morphine makes\nyou, that made me anxious too.\"), I.inP generated\n“Morfine brengt angstgevoelens naar boven\" (Mor-\nphine brings anxiety feelings to the surface), while\nthe I.inP.VT generated more indirect and figurative\nexpression “Er zit een morfine achter je\" (There’s\nmorphine behind you). The metaphor is that the\nmorphine is a physical presence that’s affecting\ntheir behaviour.\nIn the outputs using the verification tool and the\nEnglish Metaphor Menu website page link, we have\nnew findings that we list here following the afore-\nmentioned list.\n6) The LLM extracted idioms instead of\nmetaphors. For instance, from Doc-1 \"Een baby-\nhoeveelheid\" (A baby-amount) is extracted to ex-\npress the dietary change from the patients, from the\nfull sentence: \"Het is maar een baby-hoeveelheid.\nNog niet eens de helft van hij vroeger at.\" (\"It’s only\na baby’s amount. Not even half of what he used to\neat.)\n7) The LLM hallucinated metaphors, e.g. from\nDoc-5, LLM generates a metaphor \"De dokter is\neen dominee\" (The doctor is a preacher), from the\noriginal sentence: \"Die arts-assistent was echt 0\n"}, {"page": 6, "text": "komma 0.\" (English translation: \"That doctor’s as-\nsistant was 0 point 0.\"). LLM explains “The speaker\ncompares the doctor to a preacher, implying they\nwere ineffective and unhelpful.” Firstly, it switched\nthe role from “doctor’s assistant” to “the doctor”.\nSecondly, “preacher” was not used in the context.\nThe difference between Point 5 and Point 7 is that,\nOver-interpreting metaphors is more than sugges-\ntive metaphors but still try to interpret the situa-\ntion; however, Hallucinated metaphors even mis-\ninterpreted the roles in the context, e.g. “doctor” to\nthe “assistant”.\n4.4.\nOutput with Refined Prompts\nWe applied Refined Prompts (RPs) with CoTs (v1\nand v2) and English metaphor menu as inserted\nknowledge (full text, instead of webpage link), in-\ncontext learning for v2. We applied these two RPs\non the interview data, and the collected metaphors\nare categorised into types (word, phrase, sen-\ntence), source domains, and functions.\nWith\nRPs\nand\ninserted\nknowledge,\n24\nmetaphors are collected after human verifi-\ncation from collective LLMs, Table 1. The output\nmetaphors from RPs are more closely related to\nthe original context and have less hallucination.\nThus, in total, the initial instruction prompts and\nPRs have collected 65 (41+24) metaphors from\ninterview data.\nHowever, it is still not possible to totally avoid\nit. For instance, from Doc-3, LLMs (mistral:7b)\nattempt to create a metaphor out of the original\nphrase \"Volle melk, volle yoghurt..\" (\"Full milk, full\nyoghurt...\"). It describes \"The patient compares\ntheir current state to a full milk or yogurt container,\npossibly emphasising the feeling of being over-\nwhelmed.\", with \"reasoning\": \"This is metaphorical\nbecause the context suggests an emotional burden\nthat goes beyond physical nourishment.\" However,\nthe original context has only talked about food.\n4.5.\nApplication to blog data\nAs a pilot study, applying our automatic metaphor\nextraction method with Gemma to the first 100 blog\nposts on Kanker.nl produced a diverse set of figu-\nrative expressions related to the lived experience\nof cancer. The raw output contained both novel\nmetaphors and frequent idiomatic expressions\nthat are part of everyday Dutch. Examples of these\nconventionalised or dead metaphors include “te\nhoren krijgen” (“to be told”), “meten is weten” (“to\nmeasure is to know”), “ik baal als een stekker” (“I’m\nas annoyed as a plug”), and “laten we hopen dat\nalles met een sisser afloopt” (“let’s hope it all blows\nover quietly”). While these idioms are emotionally\nexpressive, they are generic and not specific to the\ncancer experience.\nIn total, out of the 100 posts, the model\n(gemma3:27b, olllama) identified 39 posts that con-\ntained at least one metaphorical expression, yield-\ning 65 distinct metaphor instances. Of these, ap-\nproximately ten were identified as particularly vivid\nand conceptually rich, reaching a level that could\nbe considered for inclusion in a future metaphor\nmenu–a curated set of expressive metaphors for\ntherapeutic or communication purposes. These\nmost salient examples demonstrate how patients\nand relatives employ creative language to express\nemotion, reframe vulnerability, and negotiate mean-\ning in relation to illness.\nDuring the manual post-filtering phase, the anal-\nysis focused on novel metaphors: linguistically\ncreative and context-specific expressions that re-\nveal how patients conceptualise illness, identity,\nand recovery. The selected metaphors, grouped\nbelow by their metaphorical vehicle, illustrate how\nindividuals on Kanker.nl use figurative language to\narticulate emotion, reclaim agency, and construct\nmeaning in the face of illness.5\nThe Party\nHere, cancer is personified as an unin-\nvited celebrant. The party metaphor conveys irony\nand defiance, transforming fear into dark humor.\nThis creative reversal allows the writer to express\nanger and regain narrative control by reframing\nthe illness as something absurd rather than purely\ntragic.\n“I was told not to use worrying titles any-\nmore, so this time I’ve decided to make it a\ncelebration instead – my cancer is having\na party of its own.””\nThe Car\nThe damaged car serves as a vivid\nmetaphor for physical and emotional wear. It con-\nveys the experience of being battered but not be-\nyond repair, blending vulnerability with resilience.\nThe detailed imagery grounds the illness experi-\nence in tangible, everyday language that conveys\nfatigue and determination simultaneously.\n“I feel like an old wreck of a car, the kind\nthat can’t be patched up with filler anymore\n– it needs entirely new bodywork, like the\nrusty 2CV sitting in someone’s garden.”\nThe Lighthouse\nThe lighthouse represents guid-\nance, stability, and safety. It evokes the dependable\npresence of loved ones who provide light and orien-\ntation amid uncertainty. This metaphor articulates\nthe relational and emotional support structures cru-\ncial for coping with illness.\n5Note that we do not release patient’s literal words\nhere but rephrased them to protect patient privacy.\n"}, {"page": 7, "text": "Overall\nQwen\nMistral\nMedLlama\nDeepSeek\nLlama3.1:8B\nGemma3:12B\nGemma3:27B\n24\n5\n8\n1\n0\n5\n1\n4\nTable 1: Metaphor counts from collective LLMs using RPs on interview data.\n“A lighthouse – someone solid and con-\nstant, always there to guide you through\nthe dark.”\nThe Storm\nThe storm metaphor externalizes\npsychological turmoil and intrusive thoughts. By\nlikening mental distress to turbulent weather, the\nspeaker gives form to anxiety and confusion, mak-\ning inner chaos visible and easier to communicate.\n“It feels as if a wild storm is roaring through\nmy head.”\nThe Train\nThe train functions as a metaphor for\nrelentless motion and loss of control. These images\ncapture the unstoppable pace of medical treatment\nand the sense that life continues regardless of one’s\nreadiness, balancing fatigue with perseverance.\n“Just when you think you’ve stepped off\none speeding train, you realize you’re al-\nready on the next one.””\n“Life keeps pounding along like a fast-\nmoving train – whether I’m ready to get on\nor not.”\nThe Painting\nReferring to the red surgical mark-\nings before an operation, the painting metaphor\nreinterprets the medicalized body as a canvas. It\nreframes vulnerability as something that can hold\nmeaning and even beauty, allowing patients to re-\nclaim agency over their altered bodies.\n“My stomach looks like a work of art now,\ncovered with careful red lines and circles\ndrawn before surgery.”\nThe Final Chord\nThe musical metaphor of the\nfinal chord transforms death into a form of com-\npletion rather than cessation.\nIt provides emo-\ntional and narrative closure, allowing grief to be\nexpressed through harmony and resolution.\n“This feels like the final note in the song\nof our journey together – the moment of\nclosure that sends everything gently into\nsilence.”\nThese selected metaphors show how writers on\nKanker.nl employ creative figurative language to\nconvey themes of control, damage, support, turbu-\nlence, transformation, and closure. The combina-\ntion of automatic extraction and qualitative interpre-\ntation reveals how metaphor functions as a key tool\nfor emotional expression and meaning-making in\nonline narratives of illness.\n4.6.\nGPT on forum data\nTo compare with the open-source LLMs, we also\nused GPT models from OpenAI on the forum data\nfor the metaphor extraction task and prompted\nGPT5 to map the extracted metaphors to the En-\nglish Metaphor Menu and provide a confidence\nscore. We list some of our extracted metaphors\nusing GPT5 (paraphrased) in this section, which\nalign with the original English metaphor menu, as\nin Figures 3 and 4.\n5.\nDiscussion\nFirstly, without the CoTs and verification tools we\nimplemented, the initial instruction prompts pro-\nduced abstractive and suggestive metaphors, para-\nphrased from what was said in the interview data,\ninstead of word-for-word extractions. With the re-\nfined prompts and the inserted English metaphor\nmenu knowledge, the LLM-generated metaphors\nare more closely reflecting the transcription con-\ntent, but also less diverse or creative than the initial\nprompting outputs.\nRegarding the corpus HealthQuote.NL we gen-\nerated, it can be useful for multiple purposes, as\na whole or a subset of columns.\nFor instance,\nusers can focus on the Dutch metaphors column\nfor Dutch-focused patient care support. The Dutch-\nEnglish bilingual metaphors can be used for non-\nDutch native speakers but who speak English in\nthe care setting. The categorisation, description,\nand reasoning of metaphors can be used to con-\nduct a metaphor study itself and the relations within.\nThe prompts we used and the corresponding var-\nied outputs from LLMs can be explored by AI and\nNLP practitioners who are interested in exploring\nprompt engineering for better analysis of non-literal\nlanguage use.\nFor the phrase-level and word-level metaphors,\nwe always add the context sentence as examples\nto the dataset for understanding and usage. For\ninstance, at word level, the pair of original quote\n\"balletje\" and translation “ball”, is accompanied\nwith the context “O: dan gaat het balletje heel snel\nrollen.” (O: Then the ball starts rolling very quickly..)\nWe also give the description “In this case “balletje”\nmeans ball, like a golf ball or football. Here it means\nthat cancer treatment is like a fast rolling ball, so\nthat’s the metaphor”.\n"}, {"page": 8, "text": " \nBlog text (paraphrased) \nMetaphor  \n(in Dutch) \nmap \nConfidence \nScore \nExplanation \nDaar zit je dan… in de wachtkamer bij \ndokter De Leeuw. Goede naam, denk ik \nnog, hopelijk vecht ze ook als een leeuw. \nMijn man zit zenuwachtig zijn handen \nsamen te knijpen. O, wat had ik hem dit \ngraag bespaard. ... \nDe dokter vertelt waar ik een groot litteken \nzal krijgen. Ik maak een stom grapje: ik ben \ntoch al gelukkig getrouwd. … \nMijn gedachten dwalen af. Lymfeklieren, \noveral in je lichaam… Ineens raakt het me \nvolledig, heel kort maar glashelder. De \nbrok in mijn keel voel ik, maar ik druk de \ntranen weg. Nee, dat sta ik mezelf niet toe. \nDe kinderen… denk aan de kinderen. We \ngaan gewoon voor goede uitslagen. Ik zal \nvechten als een leeuw. \nAls je wilt, kan ik er ook een meer literaire, \nbijna poëtische versie van maken, die de \nspanning en emoties nóg sterker \nbenadrukt, zonder dat het te zwaar wordt. \nWil je dat?   \nHopelijk vecht ze \nals een leeuw. \n7 \n0.95 \nExplicit simile of fighting like a lion \n— directly expresses a \ncombat/fight frame, matching item \n7 (I don’t intend to give up; I want \nto fight). \neen groot litteken \n13 \n0.72 \nA scar functions as a lasting \ntrace/after-effect of \nillness/treatment; thematically \nclosest to item 13 (cancer as an \nunwelcome lodger that leaves a \nmess / lasting memory/residue). \nIneens raakt het \nme volledig, heel \nkort maar \nglashelder. \n2 \n0.85 \nThis describes sudden clarity and \nheightened perception; maps best \nto item 2 (the illness makes you \nlook up and take notice of the \nscenery / increased \nappreciation/awareness) \nIk zal vechten als \neen leeuw. \n \n \n7 \n0.99 \nStraightforward, first-person battle \nmetaphor — very strong direct fit \nwith item 7 (determined combat). \nNa een week wachten mochten we \neindelijk de uitslag van het biopt van een \nvlekje in mijn mond horen. Volgens Dokter \nGoogle zou het zomaar een onschuldige \n“amalgaamtattoo” kunnen zijn, maar \nstiekem bleef in mijn achterhoofd het idee \nrondspoken dat het ook een melanoom kon \nzijn.  .... Dankzij hem konden we snel weer \nnaar huis. Nu op naar woensdag: het \nintakegesprek over de immunotherapie, \nwaarvan de eerste behandeling donderdag \nal op het programma staat. \nVolgens Dokter \nGoogle kon het \neen onschuldige \n'amalgaamtattoo' \nzijn, … melanoom \nkon zijn. \n1 \n0.65 \nThe 'haunting in the back of my \nmind' gives a feeling of fear and \nuncertainty that is temporary, \nwhich fits item 1 (scary fairground \nride) \nkonden we snel \nweer naar huis \n \n5 \n0.25 \nReturning home after reassurance \nsuggests social/support element; \nloosely aligns with item 5 (the \nrocks in our path are easier with \nothers who help you). Low \nconfidence because the phrase is \nlargely literal (going home) and \nnot a clear metaphor of shared \nburden. \nOp naar \nwoensdag, het \nintakegesprek over \nde \nimmunotherapie... \n3 \n0.30 \nPhrase implying forward motion \ntoward a next step; loosely maps \nto a journey metaphor. Best (but \nweak) fit is item 3 (journeys vary \nin length; what matters is how we \nwalk the journey) because it \nsignals continuing along a \nprocess. Low confidence because \nthe expression is mostly \ntemporal/planning rather than an \nexplicit journey metaphor. \n \nFigure 3: Metaphor identification using GPT5 on forum data (paraphrased) with model confidence scores:\npart-1 (‘map’ column refers to the value in original English Metaphor menu)\nWe have collected metaphors that patients can\nuse not only in the cancer treatment process but\nalso for hospitals, clinicians, and families, which\ncan be very useful in a diverse way.\nFrom the interview transcriptions, there are many\nbroken and incomplete sentences, e.g. from Doc-0,\nOriginal sentence: “En, maar met [naam arts] nu,\ndat gaat een stuk beter en we hebben sinds dat\nwij, dat hij in [plaatsnaam] is gaan kuren, heb je\nzo’n oncologieverpleegkundige en daar kan je wel\nje vragen aan kwijt en zij... (But now with [name of\ndoctor], it goes a lot better and since we’ve been at\n[place name] to cure, you have an oncology nurse\nthere where you can put your questions and she...)”.\nThe metaphors we collected using two data sets\nare also different in the domain words that people\nused to map to (the vehicle).\nFrom our experimental outputs, different LLMs\ncan extract and suggest different metaphors from\nthe same data we used even though the overlaps\nhappen sometimes. So, it is useful to have a col-\nlective of LLMs to carry out such a task from our\nfindings.\n6.\nConclusions and Future Work\nIn this work, we explored different kinds of prompt-\ning techniques for Dutch metaphor identification\nand extraction in cancer domain using two data\nsets including interview data transcription (oral lan-\nguage) and forum data (written language). We\ncollected 130 metaphors (65 each) from two data\n"}, {"page": 9, "text": " \nBlog text (paraphrased) \nMetaphor  \n(in Dutch) \nmap \nConf. \nScore \nExplanation \n... Ik ben de afgelopen weken druk \ngeweest met alles rondom mijn \nreconstructie, gesprekken met mijn \npsycholoog, rebalancing en andere dingen \nom alles een plek te geven, en ook om mijn \nwerkuren langzaam weer op te bouwen. \nVoor mijn gevoel heb ik behoorlijk wat \nstappen gezet, en 70% van de tijd gaat het \neigenlijk best goed. ... Dat blijft nog steeds \nhet meest onwerkelijke van alles: zo heb je \ner twee, en ineens nog maar één. \n... \nToen ik gisteren naar de fysio reed en \nlangs het ziekenhuis kwam, kreeg ik ineens \nflashbacks van de rit naar het ziekenhuis \nvoor de amputatie, inclusief de angst en \nhet verdriet die ik toen voelde, en de \nterugweg na de operatie, toen mijn plezier \nin het leven ineens leek te verdwijnen \ntegelijk met mijn borst. Het rauwe verdriet \nkwam ineens terug. ... \nHet helpt ook niet dat ik vaak droom dat ik \nop de operatietafel lig, wachtend op de \nchirurg, of dat ik me probeer te verstoppen. \nSinds de amputatie droom ik regelmatig \nover geopereerd worden. Het zijn geen \nfijne dromen. \nSoms vind ik het gewoon zo’n raar idee. \nMijn borst heeft me vanaf mijn puberteit \nvergezeld, een groot deel van mijn leven, \nen binnen een uur haalt een chirurg hem \nweg. ... \nHet onwerkelijke gevoel blijft ook. Soms \nlijkt het alsof mijn brein achterloopt, alsof \nhet denkt: ... Ik was er immers bij, maar \nsoms voelt het alsof het niet echt mij is \noverkomen, of alsof ik het niet volledig kan \nbevatten. Ik zie een lege plek, en fysiek \nweet ik dat ik een operatie heb gehad, \nmaar het voelt soms alsof ik nog in een \ndroom of nachtmerrie zit waaruit ik moet \nontwaken. \n... De plastisch chirurg legde uit dat dit \nnormaal is: het brein communiceert met \nalle lichaamsdelen en ontvangt signalen \nterug, maar niet van de delen die weg zijn, \nwaardoor het brein concludeert dat er iets \nniet klopt. .... Toch kijk ik uit naar het \nmoment dat het emotionele “balletje” wat \nminder hard stuitert. \nom alles een plek \nte geven \n3 \n0.65 \nPutting things in place = processing and \nmoving along; maps reasonably to type 3 (the \njourney and how we walk it — making steps \nand arranging things emotionally). \nwat stappen gezet \n3 \n0.95 \n'Steps' is a clear journey/process metaphor — \nstrong match to type 3. \nzo heb je er twee, \nen ineens nog \nmaar één \n1 \n0.75 \nThe suddenness/disorientation evokes abrupt \njolting change—loosely like type 1 (scary \nride/abrupt experience). \nmijn plezier in het \nleven ineens leek \nte verdwijnen \ntegelijk met mijn \nborst \n9 \n0.45 \nEquating loss of pleasure with loss of the \nbreast suggests ongoing \nrelationship/ebb-and-flow of experience; type 9 \n(cancer as relationship with shifting control) is \na loose interpretive fit. \ndroom dat ik op \nde operatietafel \nlig  \n14 \n0.50 \nDreams and hiding suggest alienation from the \nbody and invasive experience; relates to type \n14 (initial alien-invasion/feeling not connected \nto changed body) \nmijn borst heeft \nme ... vergezeld \n13 \n0.75 \nBreast as a companion/personified presence \nresonates with type 13 (cancer/part as an \nunwelcome/lingering lodger/stranger) — \nemphasizes loss and relationship to the \nbody-part. \nbinnen een uur \nhaalt een chirurg \nhem weg  \n13 \n0.80 \n \n \nReduction of a breast to 'a piece of tissue' / \ndiscarded object implies dispossession and \nstranger/other framing — aligns with type 13 \n(unwanted lodger/alien presence and loss). \nalsof mijn brein \nachterloopt \n14 \n0.80 \nThe 'brain lagging' image captures \ndisconnection between mind and changed \nbody — a strong match to type 14 (feeling \nalienated/not connected to bodily change). \nik zie een lege \nplek \n6 \n0.60 \nAn ongoing felt absence (empty place) causing \ndiscomfort resonates with type 6 (persistent \nirritant/limitation after cancer — stone in the \nshoe metaphor for ongoing ache/discomfort). \nhet brein \ncommuniceert ... \nmaar niet van de \ndelen die weg \nzijn, waardoor het \nbrein concludeert \ndat er iets niet \nklopt \n14 \n0.70 \nThis physiological personification (brain-body \ndialogue) highlights disconnection and 'not \nright' sensation — thematically fits type 14 \n(initial alienation / not integrated). \ndat emotionele \n'balletje' wat \nminder hard \nstuitert \n1 \n0.92 \nSame bouncing-ball image; explicitly about \ncalming emotional oscillation — strong match \nto type 1. \n \nFigure 4: Metaphor identification using GPT5 on forum data (paraphrased) with model confidence scores:\npart-2 (‘map’ column refers to the value in original English Metaphor menu)\nsets after human verification and mapped some\nof the metaphors to the original English Metaphor\nMenu.\nTranslation of metaphors between lan-\nguages doesn’t work.\nHowever, the collected\nmetaphors cover all the categories that the orig-\ninal English metaphor menu has, with extended\nnew types, and are further grouped into word,\nphrase, and sentence levels. This collection of\nDutch metaphors can be applied to support cancer\npatient care by integrating them into the care-path.\nFor the current study, we only used 100 posts of\nthe forum data we have. For future work, we will\nexplore more data from the blog post for extended\nexperiments. We will look into some of the MWEs\nidentified by LLMs, since they always overlap with\nidioms and metaphors ((Han et al., 2025)). We also\nplan to explore the interpretability and explainability\nLLMs.\n7.\nEthical Statement\nFor both storytelling data (interviews) and kanker.nl\ndata, we have gained ethical approvals within the re-\nsearch project to use. For the forum data, we used\nthe secure version of OpenAI GPT5 established by\nthe agreement between the University and OpenAI\n"}, {"page": 10, "text": "on anonymised and paraphrased data.\n8.\nAcknowledgement\nWe thank Ida Korfage, Sheila Payne, Judith Spek,\nfor the feedback on the abstract of this work. We\nthank Richele and Iris Su Yi Tamminga from USC\nfor their valuable discussion and feedback on the\nextracted metaphors. Funded by the European\nUnion under Horizon Europe Work Programme\n101057332. Views and opinions expressed are\nhowever those of the author(s) only and do not\nnecessarily reflect those of the European Union or\nthe European Health and Digital Executive Agency\n(HaDEA). Neither the European Union nor the\ngranting authority can be held responsible for them.\nThe UK team are funded under the Innovate UK\nHorizon Europe Guarantee Programme, UKRI Ref-\nerence Number: 10041120.\n9.\nBibliographical References\nLynda Appleton and Maria Flynn. 2014. Search-\ning for the new normal: Exploring the role of\nlanguage and metaphors in becoming a cancer\nsurvivor. European Journal of Oncology Nursing,\n18(4):378–384.\nSilke Creten, Priscilla Heynderickx, and Sylvain\nDieltjens. 2022. The stigma toward dementia\non twitter: a sentiment analysis of dutch lan-\nguage tweets. Journal of Health Communication,\n27(10):697–705.\nSabine De Knop and Julien Perrez. 2014. Concep-\ntual metaphors as a tool for the efficient teaching\nof dutch and german posture verbs. Review of\nCognitive Linguistics. Published under the aus-\npices of the Spanish Cognitive Linguistics Asso-\nciation, 12(1):1–29.\nJana Declercq, Lotte van Poppel, and Thomas\nVelvis. 2023. Machines, journeys, prisons and\nyo-yos: Metaphors of pain, illness and medicine\nin consultations with chronic pain patients. Social\nScience & Medicine, 330:116043.\nZsófia Demjén and Elena Semino. 2020. Communi-\ncating nuanced results in language consultancy:\nThe case of cancer and the violence metaphor.\nIn Professional communication: Consultancy, ad-\nvocacy, activism, pages 191–210. Springer.\nQingxiu Dong, Lei Li, Damai Dai, Ce Zheng,\nJingyuan Ma, Rui Li, Heming Xia, Jingjing Xu,\nZhiyong Wu, Baobao Chang, Xu Sun, Lei Li, and\nZhifang Sui. 2024. A survey on in-context learn-\ning. In Proceedings of the 2024 Conference on\nEmpirical Methods in Natural Language Process-\ning, pages 1107–1128, Miami, Florida, USA. As-\nsociation for Computational Linguistics.\nRaymond W Gibbs Jr and Heather Franks. 2002.\nEmbodied metaphor in women’s narratives about\ntheir experiences with cancer. Health communi-\ncation, 14(2):139–165.\nIngeborg PM Griffioen, Judith AC Rietjens, Mari-\njke Melles, Dirk Snelders, Marjolein YV Homs,\nCasper H van Eijck, and Anne M Stiggelbout.\n2021. The bigger picture of shared decision mak-\ning: a service design perspective using the care\npath of locally advanced pancreatic cancer as a\ncase. Cancer Medicine, 10(17):5907–5916.\nPragglejaz Group. 2007. Mip: A method for iden-\ntifying metaphorically used words in discourse.\nMetaphor and symbol, 22(1):1–39.\nLifeng Han, Najet Hadj Mohamed, Malak Rassem,\nGareth JF Jones, Alan F Smeaton, and Goran\nNenadic. 2025. Towards a resource for multilin-\ngual lexicons: an mt assisted and human-in-the-\nloop multilingual parallel corpus with multi-word\nexpression annotation.\nKristine J Harrington. 2012. The use of metaphor in\ndiscourse about cancer: a review of the literature.\nClinical journal of oncology nursing, 16(4).\nMarij A Hillen,\nMaria Grazia Rossi,\nAranka\nAkkermans, Leonie AL Baatenburg de Jong,\nJolanda HM Dobbe,\nTanja Henkel,\nVicky\nLehmann, Susan J Oudbier, Tanja J de Rijke,\nEllen MA Smets, et al. 2025. Clinicians’ use of\nmetaphoric language in conversations with fam-\nilies of critically ill patients in the intensive care\nunit. Patient Education and Counseling, page\n108813.\nCharlotte Hommerberg, Anna W Gustafsson, and\nAnna Sandgren. 2020. Battle, journey, imprison-\nment and burden: Patterns of metaphor use in\nblogs about living with advanced cancer. BMC\nPalliative Care, 19(1):59.\nGeorge Lakoff. 1993. The contemporary theory of\nmetaphor.\nYufeng Liu, Elena Semino, Judith Rietjens, and\nSheila Payne. 2024.\nCancer experience in\nmetaphors:\npatients, carers, professionals,\nstudents–a scoping review. BMJ Supportive &\nPalliative Care, 14(e3):e2366–e2376.\nMarlene Lutz, Indira Sen, Georg Ahnert, Elisa\nRogers, and Markus Strohmaier. 2025.\nThe\nprompt makes the person(a): A systematic eval-\nuation of sociodemographic persona prompting\nfor large language models.\n"}, {"page": 11, "text": "Dalia Magaña and Teenie Matlock. 2018.\nHow\nspanish speakers use metaphor to describe their\nexperiences with cancer. Discourse & communi-\ncation, 12(6):627–644.\nMetaphor Menu, Lancaster University. 2025. A\nmetaphor menu for people living with cancer.\nJames Chike Nwankwo. 2024. Metaphor and ther-\napeutic potential in cancer discourse: A com-\nparative case study of american and nigerian\nself-help books.\nCommunication & Medicine,\n19(3):271–283.\nTrijntje Pasma. 2011. Metaphor and register vari-\nation: The personalization of dutch news dis-\ncourse.\nTryntje Pasma. 2012. Metaphor identification in\ndutch discourse. In Metaphor in use, pages 69–\n84. John Benjamins Publishing Company.\nTryntje Pasma. 2019.\nChapter 5. linguistic\nmetaphor identification in dutch. In Metaphor\nIdentification in Multiple Languages:\nMIPVU\naround the world, pages 91–112. John Ben-\njamins Publishing Company.\nRichard T Penson, Lidia Schapira, Kristy J Daniels,\nBruce A Chabner, and Thomas J Lynch Jr. 2004.\nCancer as metaphor. The oncologist, 9(6):708–\n716.\nValeria A Pfeifer, Karen L Weihs, and Vicky T\nLai. 2024.\nNarratives about cancer:\nWhat\nmetaphors can tell us about depressive symp-\ntoms in breast cancer patients. Health Commu-\nnication, 39(9):1888–1898.\nLibo Ren, Yee Man Ng, and Lifeng Han. 2025.\nMalei at multiclinsum: Summarisation of clin-\nical documents using perspective-aware itera-\ntive self-prompting with llms.\narXiv preprint\narXiv:2509.07622.\nPablo Romero, Libo Ren, Lifeng Han, and Goran\nNenadic. 2025. The Manchester bees at Per-\nAnsSumm 2025: Iterative self-prompting with\nclaude and o1 for perspective-aware health-\ncare answer summarisation. In Proceedings of\nthe Second Workshop on Patient-Oriented Lan-\nguage Processing (CL4Health), pages 340–348,\nAlbuquerque, New Mexico. Association for Com-\nputational Linguistics.\nAbulhair Saparov and He He. 2023. Language\nmodels are greedy reasoners: A systematic for-\nmal analysis of chain-of-thought. In The Eleventh\nInternational Conference on Learning Represen-\ntations.\nJohn Schuster, Erik Beune, and Karien Stronks.\n2011. Metaphorical constructions of hyperten-\nsion among three ethnic groups in the nether-\nlands. Ethnicity & health, 16(6):583–600.\nElena Semino, Zsófia Demjén, Jane Demmen,\nVeronika Koller, Sheila Payne, Andrew Hardie,\nand Paul Rayson. 2017a. The online use of vi-\nolence and journey metaphors by patients with\ncancer, as compared with health professionals:\na mixed methods study. BMJ supportive & pal-\nliative care, 7(1):60–66.\nElena Semino, Zsófia Demjén, Andrew Hardie,\nSheila\nPayne,\nand\nPaul\nRayson.\n2017b.\nMetaphor, cancer and the end of life:\nA\ncorpus-based study. Routledge.\n10.\nLanguage Resource References\n"}]}