{"doc_id": "arxiv:2602.04279", "source": "arxiv", "lang": "en", "pdf_path": "data/raw/arxiv/pdf/2602.04279.pdf", "meta": {"doc_id": "arxiv:2602.04279", "source": "arxiv", "arxiv_id": "2602.04279", "title": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation", "authors": ["Jiarui Jin", "Haoyu Wang", "Xingliang Wu", "Xiaocheng Fang", "Xiang Lan", "Zihan Wang", "Deyun Zhang", "Bo Liu", "Yingying Zhang", "Xian Wu", "Hongyan Li", "Shenda Hong"], "published": "2026-02-04T07:17:55Z", "updated": "2026-02-04T07:17:55Z", "summary": "Electrocardiography (ECG) serves as an indispensable diagnostic tool in clinical practice, yet existing multimodal large language models (MLLMs) remain unreliable for ECG interpretation, often producing plausible but clinically incorrect analyses. To address this, we propose ECG-R1, the first reasoning MLLM designed for reliable ECG interpretation via three innovations. First, we construct the interpretation corpus using \\textit{Protocol-Guided Instruction Data Generation}, grounding interpretation in measurable ECG features and monograph-defined quantitative thresholds and diagnostic logic. Second, we present a modality-decoupled architecture with \\textit{Interleaved Modality Dropout} to improve robustness and cross-modal consistency when either the ECG signal or ECG image is missing. Third, we present \\textit{Reinforcement Learning with ECG Diagnostic Evidence Rewards} to strengthen evidence-grounded ECG interpretation. Additionally, we systematically evaluate the ECG interpretation capabilities of proprietary, open-source, and medical MLLMs, and provide the first quantitative evidence that severe hallucinations are widespread, suggesting that the public should not directly trust these outputs without independent verification. Code and data are publicly available at \\href{https://github.com/PKUDigitalHealth/ECG-R1}{here}, and an online platform can be accessed at \\href{http://ai.heartvoice.com.cn/ECG-R1/}{here}.", "query": "(cat:cs.CL OR cat:cs.LG) AND (all:\"large language model\" OR all:LLM) AND (all:medical OR all:clinical OR all:healthcare)", "url_abs": "http://arxiv.org/abs/2602.04279v1", "url_pdf": "https://arxiv.org/pdf/2602.04279.pdf", "meta_path": "data/raw/arxiv/meta/2602.04279.json", "sha256": "13d115303f62dc36fbcd228dfb4409aa445e1071225e18beefc183bfe73d4fad", "status": "ok", "fetched_at": "2026-02-18T02:19:48.942336+00:00"}, "pages": [{"page": 1, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for\nReliable ECG Interpretation\nJiarui Jin * 1 2 Haoyu Wang * 2 Xingliang Wu 3 Xiaocheng Fang 1 2 Xiang Lan 4 Zihan Wang 1\nDeyun Zhang 5 Bo Liu 1 Yingying Zhang 6 Xian Wu 6 Hongyan Li 1 Shenda Hong 2\nAbstract\nElectrocardiography (ECG) serves as an indis-\npensable diagnostic tool in clinical practice,\nyet existing multimodal large language models\n(MLLMs) remain unreliable for ECG interpreta-\ntion, often producing plausible but clinically in-\ncorrect analyses. To address this, we propose\nECG-R1, the first reasoning MLLM designed\nfor reliable ECG interpretation via three innova-\ntions. First, we construct the interpretation cor-\npus using Protocol-Guided Instruction Data Gen-\neration, grounding interpretation in measurable\nECG features and monograph-defined quantita-\ntive thresholds and diagnostic logic. Second, we\npresent a modality-decoupled architecture with\nInterleaved Modality Dropout to improve robust-\nness and cross-modal consistency when either the\nECG signal or ECG image is missing. Third, we\npresent Reinforcement Learning with ECG Diag-\nnostic Evidence Rewards to strengthen evidence-\ngrounded ECG interpretation. Additionally, we\nsystematically evaluate the ECG interpretation\ncapabilities of proprietary, open-source, and med-\nical MLLMs, and provide the first quantitative ev-\nidence that severe hallucinations are widespread,\nsuggesting that the public should not directly trust\nthese outputs without independent verification.\nCode and data are publicly available at here, and\nan online platform can be accessed at here.\n*Equal contribution 1School of Intelligence Science and Tech-\nnology, Peking University 2National Institute of Health Data Sci-\nence, Peking University 3Tianjin Institute of Cardiology, the Sec-\nond Hospital of Tianjin Medical University 4National University of\nSingapore 5HeartVoice Medical Technology 6Jarvis Lab, Tencent.\nCorrespondence to: Shenda Hong <hongshenda@pku.edu.cn>,\nHongyan Li <leehy@pku.edu.cn>.\nPreprint. February 5, 2026.\n1. Introduction\nElectrocardiogram (ECG), which captures the electrical ac-\ntivity of the heart through surface electrodes, is the foun-\ndation for diagnosing cardiac diseases (Hong et al., 2020;\nLiu et al., 2021). As the most common data in cardiology,\nthe reliability of ECG interpretation is crucial. Incorrect\ninterpretations can directly result in patients not receiving\nappropriate treatment, leading to more severe health prob-\nlems or life-threatening situations (Masoudi et al., 2006;\nRafie et al., 2021). In clinical practice, automated algo-\nrithms extract ECG features (e.g., R-R interval) and gen-\nerate preliminary diagnostic hypotheses, which are then\ncross-checked and confirmed by clinicians against medical\nprotocols and twelve-lead waveform analysis to ensure the\naccuracy and reliability of the interpretation and diagnosis.\nDeep learning methods have made promising advancements\nin cardiac anomaly detection (Kiyasseh et al., 2021; Lan\net al., 2022; Na et al., 2024; Jin et al., 2025c; Li et al.,\n2025b; Jin et al., 2025a), but still lack sufficient language\ninterpretation capabilities and model interpretability. In\nrecent years, medical multimodal large language models\n(medical MLLMs) have rapidly advanced in tasks such as\nmedical data interpretation and clinical report generation\n(Huang et al., 2025). However, on routine clinical ECGs, our\nexperiments indicate that existing medical MLLMs remain\nmarkedly inadequate in diagnostic reliability in two aspects:\nHallucination in ECG Interpretation.\nRecent propri-\netary MLLMs like GPT-5.1 (OpenAI, 2025), and medical\nMLLMs like MedGemma (Sellergren et al., 2025), often\ngenerate ECG interpretations that seemingly exhibit struc-\ntural completeness and appropriate clinical terminology.\nHowever, quantitative evaluation reveals that these outputs\ncontain numerous hallucinated statements and exhibit low\ndiagnostic accuracy (see Section 3.3 for details). The fun-\ndamental cause lies in the scarcity of high-quality ECG\ninterpretation data during training. Although the recently\nreleased ECG-Grounding (Lan et al., 2025) dataset provides\nevidence-based ECG interpretation data, its interpretation is\nstill generated by purely prompting general-purpose LLMs\nthat rely heavily on pretrained knowledge, which can intro-\nduce clinical errors and undermine reliability.\n1\narXiv:2602.04279v1  [cs.CL]  4 Feb 2026\n"}, {"page": 2, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nMethod Category\nModality\nCorpus\nProperties\nImage\nSignal\nReliability\nRobustness\nConsistency\nGeneral & Medical\nMLLMs\n✓\n✗\n✗\n✗\n✗\nPrevious ECG\nMLLMs\n✓\n✓\n✗\n✗\n✗\nECG-R1 (Ours)\n✓\n✓\n✓\n✓\n✓\n✓Supported ✗Not Supported\nFigure 1. Left: Attribute comparison among general/medical MLLMs, previous ECG-specialized MLLMs, and ECG-R1. General/medical\nMLLMs typically cannot perform signal analysis and lack high-quality ECG interpretation corpora, which often leads to hallucinated,\nclinically incorrect interpretations at test time. Previous ECG-specialized MLLMs often construct training corpus by purely prompting\nLLMs from ECG features, thereby introducing medical errors that render the corpus unreliable, and they are neither robust nor cross-modal\nconsistent under modality missing. Right: ECG-R1 follows a monograph-defined protocol to generate structured, clinically aligned\ninterpretations, remaining robust and cross-modal consistent under modality missing.\nInstability and Inconsistency under Modality Missing.\nAs a common clinical data format, ECG is routinely pre-\nsented in two forms: signals and images.\nSince these\nmodalities convey consistent underlying semantic content,\na model’s interpretation of the same ECG should remain\ncross-modally consistent. However, most current medical\nMLLMs are limited to image-based ECG analysis and do\nnot support signal (time-series) analysis. Although recent\nECG omni-perception MLLMs like GEM (Lan et al., 2025),\nintegrate ECG signals and ECG images, quantitative re-\nsults show substantial performance degradation in metrics\nsuch as diagnostic accuracy and cross-modal inconsistency\nunder modality missing conditions (Figure 4 and Table 2,\nrespectively), which undermines the reliability of ECG in-\nterpretation across varying data completeness conditions.\nTo address the above challenges, we propose ECG-R1, the\nfirst reasoning MLLM for ECG interpretation. ECG-R1\ndiffers from previous methods in three key aspects. First,\nto mitigate the issue of hallucination in interpretations, we\nintroduce a novel Protocol-Guided Instruction Data Gen-\neration paradigm. This paradigm incorporates a grounding\nfeature extractor to extract precise physiological character-\nistics from ECG signals (e.g., R-R interval) and integrates\na five-phase protocol extracted from a medical monograph,\nguiding the interpretation generation model to follow pre-\ndefined thresholds and systematic diagnostic logic. Sec-\nond, to address the issue of modality missing, we present\na modality-decoupled architecture and introduce the theo-\nretically motivated training strategy Interleaved Modality\nDropout (IMD), which explicitly simulates random modal-\nity dropouts and interleaved inputs during training to en-\nhance robustness and cross-modal consistency under vari-\nous data completeness scenarios. Finally, as the first rea-\nsoning MLLM in this field, we introduce the Reinforce-\nment Learning with ECG Diagnostic Evidence Rewards\n(EDER). Unlike general reasoning LLMs (e.g., DeepSeek-\nR1 (Guo et al., 2025)) that mainly optimize final-answer cor-\nrectness, ECG-R1 additionally rewards structured interme-\ndiate reasoning, complementing answer-level optimization\nwith process-level clinical reasoning and thereby improving\nECG interpretation accuracy and reliability. In summary,\nthe main contributions of this work are as follows:\n• We propose ECG-R1, the first reasoning MLLM for\nECG interpretation, and further optimize it via rein-\nforcement learning with ECG Diagnostic Evidence\nRewards to improve ECG interpretation capability.\n• We introduce Protocol-Guided Instruction Data Gen-\neration, leveraging monograph-defined thresholds and\ndiagnostic rules to generate the corpus of structured\nsix-step analyses with a final summary and diagnosis,\nwhile surfacing plausible unannotated abnormalities.\n• We present Interleaved Modality Dropout, a theoreti-\ncally motivated training strategy that simulates modal-\nity dropouts and token-block order swapping, and pro-\nvide theoretical guarantees for robustness and cross-\nmodal consistency.\n• To facilitate future research, we systematically evalu-\nate ECG interpretation across proprietary, open-source,\nand medical MLLMs, revealing substantial limitations\nin current models, and further validate ECG-R1 via\nlicensed-cardiologist evaluation, demonstrating supe-\nrior reliability and clinical usefulness.\n2\n"}, {"page": 3, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nFigure 2. Framework of ECG-R1. Instruction generation builds a protocol-guided interpretation corpus by combining ECG grounding\nfeatures with the monograph protocol. Architecture adopts a decoupled dual-encoder design with lightweight projectors to align modality-\nspecific representations into a shared LLM space. Training follows a two-stage strategy with SFT followed by RL, and integrates IMD to\nenhance robustness and cross-modal consistency under modality missing.\n2. Method\n2.1. Framework Overview\nWe overview the key characteristics of ECG-R1 in Figure 1\nand illustrate its end-to-end training pipeline in Figure 2.\nGiven multimodal input x = (xtext, xI, xT ), where xtext de-\nnotes the instruction text, xI the rendered ECG image, and\nxT the ECG time-series signal, the model generates an ECG\ninterpretation y. We present ECG-R1 in three components:\ninstruction corpus curation (Section 2.2), architecture design\n(Section 2.3), and the training strategy (Sections 2.4–2.6).\n2.2. Protocol-Guided Instruction Data Generation\nInstruction data underpins multimodal training and critically\ndetermines how an MLLM responds to clinical queries. Re-\ncent efforts (e.g., ECG-Grounding) generate fine-grained\nsupervision by purely prompting general-purpose LLMs to\nproduce causal-style interpretations from diagnosis labels\nand extracted signal features. However, purely prompt-\nbased generation is largely driven by pretrained priors rather\nthan explicit diagnostic criteria, which can introduce clin-\nically implausible causal attributions and factual medical\nerrors (Figure 5). To mitigate these issues, we introduce\nProtocol-Guided Instruction Data Generation, which gener-\nates supervision by adhering to standardized ECG interpre-\ntation protocols derived from a clinical monograph.\nGrounding Features Extraction.\nTo enable feature-\ngrounded ECG interpretation, we extract structured physi-\nological evidence from the raw ECG time-series. For each\nlead and detected heartbeat, we measure fiducial-point am-\nplitudes, waveform morphology, and key intervals, and or-\nganize them into beat-wise, time-ordered feature sequences\n(e.g., [QRS1, . . . , QRSK] for QRS duration over K beats).\nIn practice, we construct 14 sequences per lead across 12\nleads, including heart rate, RR intervals, P amplitude/dura-\ntion, PR interval, QRS amplitude/duration, T amplitude/du-\nration, ST descriptors, and QT/QTc intervals. The extrac-\ntion is defined as xfs = FeatureDB(xT ), where xfs is a\nfeature dictionary and FeatureDB (Hong et al., 2019) is a\ndeterministic, non-trainable extractor.\nProtocol-Guided Diagnosis Guider. Given the extracted\nfeature dictionary xfs, our goal is to generate a low-\nhallucination target response y without costly expert an-\nnotations. We therefore design a protocol-guided diagno-\nsis guider that composes a protocol-aware prompt: xp =\nProtocolGuider(xfs, xprotocol), which steers an LLM to-\nward evidence-based ECG interpretation. Here, xprotocol\nis derived from Chapter 23 (How to Read an ECG) of\n3\n"}, {"page": 4, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nFigure 3. Architecture Comparison of GEM and ECG-R1.\nECG from Basics to Essentials: Step by Step (Stroobandt\net al., 2015). The original procedure is reorganized into\nfive phases: (i) Technical, Rate & Rhythm, (ii) Conduction,\nAxis & Intervals, (iii) Chamber Hypertrophy & Voltage,\n(iv) Ischemia, Infarction & Mimics, and (v) Electrolytes &\nQT. We further enforce differential exclusion with explicit\nnegatives to rule out key mimics.\nECG Protocol-Guided Grounding CoT Data. Using the\nproposed protocol-guided generation pipeline, we curate\ninstruction–response pairs from MIMIC-IV-ECG (John-\nson et al., 2023), where each y follows a fixed schema:\na <think> block encoding the six-step protocol reasoning\ntrace (five phases plus a final medical reasoning step), a brief\nsummary narrative, and an <answer> block providing\nthe final diagnosis. We employ DeepSeek-V3.1-Terminus\n(Liu et al., 2024a) as an interpretation generator. Given\na protocol-structured prompt xp, it produces an interpre-\ntation y = InterpretationGenerator(xp), where y corre-\nsponds to a single protocol-guided instruction instance in\nour corpus. Repeating this procedure yields 30,000 protocol-\nguided instruction samples. Figure 5 shows a qualitative\ncomparison. Interpretations relying on pretrained priors are\nprone to hallucinations and factual errors. By contrast, our\nprotocol-guided generation injects standardized thresholds\nand a systematic workflow, reducing hallucination-driven\nmistakes and revealing clinically meaningful abnormalities\nmissed by the original report.\n2.3. Decoupled Modalities Encoding\nDesign Motivation.\nExisting ECG omni-perception\nMLLMs adopt a coupled encoding strategy (Figure 3): time-\nseries (TS) embeddings are projected through a TS–Image\nalignment layer and then reuse the Image–Language pro-\njector before being injected into the <image> token space\nwith fixed concatenation. This design (i) tightly couples TS\nencoding to the <image> placeholder, implicitly assuming\npaired modalities and making single-modality inference less\nnatural and (ii) reuses a single Image–Language projector\nacross heterogeneous modalities, creating a shared capacity\nbottleneck and representational compromise.\nTo address this issue, we instead use a Decoupled Modalities\nEncoding scheme with Qwen3-VL-8B (Bai et al., 2025)\n(LLM + visual encoder) and ECG-CoCa (Zhao et al., 2025b)\n(time-series encoder). We introduce an explicit <ecg> tag\n(placed before <image>) and inject the time-series token\nblock only at <ecg>, so the model encodes the time-series\nonly when <ecg> appears. Given xT and xI, we compute\nmodality tokens and map them into the LLM embedding\nspace via two independent projectors:\neT = EncoderT (xT ; θET ), zT = ProjT (eT ; θProjT ),\neI = EncoderI(xI; θEI), zI = ProjI(eI; θProjI),\n(1)\nwhere θM ≜{θProjI, θProjT }. and zT , zI ∈R·×d. We\ncondition the LLM on xtext together with modality tokens\n(zT , zI), injecting zT at <ecg> and zI at <image>.\n2.4. Interleaved Modality Dropout\nTheoretical Motivation.\nPrior ECG omni-perception\nMLLMs adopt a fixed fusion pattern, typically concate-\nnating the time-series and image token blocks in a prede-\ntermined order. Training under this single canonical fusion\npattern makes the model sensitive to test-time deviations\n(e.g., missing a modality). Such shifts degrade performance\nand exacerbate cross-modal inconsistency.\nInsight. We represent common test-time deviations of ECG\nfusion as a finite set of environments Ttest (formalized in\nSetup), covering modality missingness and modality-block\norder changes. In ECG, the image and time-series are two\nrenderings of the same waveform. Assuming typical pre-\nprocessing where external visual annotations (e.g., cardiolo-\ngist notes) are excluded, the intrinsic view asymmetry ∆view\nis expected to be small, unlike generic omni-perception\ntasks where different views carry distinct information (e.g.,\nspeech for semantics; vision for spatial information).\nTo address these issues, we propose Interleaved Modality\nDropout (IMD). During supervised fine-tuning (SFT) and\nreinforcement learning (RL) stages, we sample a transfor-\nmation τ ∼q over Ttest by (i) randomly dropping either\nthe image or the time-series modality and (ii) optionally\nswapping the order of their token blocks. This corresponds\nto minimizing a mixture risk Rq(θ) = Eτ∼q[Rτ(θ)] over\nall test-relevant environments instead of a single fixed pat-\ntern, which we later show provably upper-bounds the worst-\nenvironment risk Rmax(θ) and, in the ECG setting where\nintrinsic view asymmetries ∆view and ∆swap are negligi-\nble, also controls the cross-modal discrepancies F(θ) and\nFswap(θ), thereby yielding explicit robustness and consis-\ntency guarantees without introducing additional missing-\nmodality generators or explicit alignment losses.\nSetup.\nLet x = (xtext, xI, xT ) and y denote the target\noutput text. Under teacher forcing, define the NLL loss\n4\n"}, {"page": 5, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nℓθ(x, y) ≜−log Pθ(y | x).\nIMD samples a transfor-\nmation τ ∼q from the finite environment set Ttest =\n{τI, τT , τIT , τT I}, where τI, τT drop one modality and\nτIT , τT I swap the two modality token blocks. In practice,\nq is induced by two independent trials: (i) a modality-drop\ntrial with probability pd; and (ii) conditioned on retaining\nboth modalities, a token-swap trial with probability ps.\nDefine the environment risk Rτ(θ) ≜E(x,y)[ℓθ(τ(x), y)],\nthe mixture risk Rq(θ) ≜Eτ∼q[Rτ(θ)], and the worst-\nenvironment risk Rmax(θ) ≜maxτ∈Ttest Rτ(θ).\nAssumption 2.1 (Coverage). There exists α > 0 such that\nq(τ) ≥α for all τ ∈Ttest.\nModality Robustness.\nWe study robustness to the\nmodality-drop and token-swap transformations in Ttest, quan-\ntified by the worst-environment risk Rmax(θ).\nTheorem 2.2 (Robustness under IMD). Under Assump-\ntion 2.1, Rmax(θ) ≤α−1Rq(θ), where in our implementa-\ntion α = min{pd/2, (1 −pd)ps, (1 −pd)(1 −ps)}.\nModality Consistency.\nDefine F(θ) ≜Ex TV(Pθ(· |\nτI(x)), Pθ(· | τT (x))) and Fswap(θ) ≜Ex TV(Pθ(· |\nτIT (x)), Pθ(· | τT I(x))). Allowing intrinsic information\ndisparity, let ∆view ≜Ex TV(P ⋆(· | τI(x)), P ⋆(· | τT (x)))\nand ∆swap ≜Ex TV(P ⋆(· | τIT (x)), P ⋆(· | τT I(x))). In\nECG, τI(x) and τT (x) are two renderings of the same wave-\nform, so ∆view and ∆swap are negligible.\nTheorem 2.3 (Consistency via excess risk). Let R⋆\nτ be the\nBayes-optimal risk in environment τ and ετ(θ) ≜Rτ(θ) −\nR⋆\nτ. Then\nF(θ) ≤∆view +\np\nετI(θ)/2 +\np\nετT (θ)/2,\nFswap(θ) ≤∆swap +\np\nετIT (θ)/2 +\np\nετT I(θ)/2.\nMoreover, by coverage, for any τ ∈Ttest, Rq(θ) −¯R⋆\nq ≥\nα ετ(θ), where ¯R⋆\nq ≜Eτ∼q[R⋆\nτ].\nProofs.\nSee Appendix D.2 and Appendix D.3.\nTakeaway.\nTheorems 2.2 and 2.3 together establish that\noptimizing the IMD mixture risk Rq(θ) enforces both\ndesiderata over Ttest: by coverage, small Rq(θ) upper-\nbounds the worst-environment risk Rmax(θ), while the mix-\nture excess risk Rq(θ) −¯R⋆\nq controls cross-modal discrep-\nancy. In ECG, the image and time-series are two renderings\nof the same waveform, so ∆view (and ∆swap) is negligible,\nand reducing Rq(θ) directly promotes paired-view agree-\nment and swap invariance. In contrast, fixed concatenation\nminimizes only Rτ0(θ), with no guarantees on Rmax(θ) or\ncross-modal consistency in unseen test environments.\n2.5. Supervised Fine-tuning\nWe conduct one-epoch supervised fine-tuning (SFT) on\nthe instruction-tuning set DSFT (defined in Section 3.1),\nwhich pools our protocol-guided instruction samples with\na public ECG instruction dataset, and optimize only θ =\n{θM, θLLM} with IMD:\nmin\nθ={θM,θLLM} E(x,y)∼DSF T\n\u0002\n−log πθ(y | x)\n\u0003\n.\n(2)\n2.6. Reinforcement Learning with ECG Diagnostic\nEvidence Rewards\nAfter SFT, we further post-train the model with reinforce-\nment learning (RL) to improve reasoning ability. Prior rea-\nsoning MLLMs (e.g., DeepSeek-R1) mainly reward format\ncompliance and final-answer correctness, leaving intermedi-\nate reasoning unsupervised and thus permitting hallucinated\ninterpretation steps. Because ECG interpretation requires\nstage-wise evidence grounding and differential exclusion,\ninspired by R1-VL (Zhang et al., 2025), we propose ECG\nDiagnostic Evidence Rewards (EDER), which adds stepwise\nevidence rewards beyond outcome and format, encouraging\nverifiable reasoning at each step.\nTraining Data.\nStarting from the overall instruction cor-\npus DSFT, we construct the RL training set DRL as a con-\ntrolled subset of the ECG Protocol-Guided Grounding CoT.\nSpecifically, we first identify the top-500 most frequent\nreport texts, and for each report type we retain up to 10 sam-\nples via uniform sampling without replacement (keeping all\nsamples when fewer than 10 are available). We then apply a\nglobal shuffle with a fixed random seed of 42, resulting in\n|DRL| = 3,948 training samples.\nExtracting Key Diagnostic Evidence.\nWe employ\nDeepSeek-V3.1-Terminus as an evidence extractor. Given\nthe reference protocol-structured K-step reasoning trace y\nassociated with each training instance in DRL (with K=6\nin our protocol), it extracts step-specific key diagnostic evi-\ndence phrases Ek(y) that are directly relevant to the ground-\ntruth diagnosis labels a⋆. To ensure clinical specificity, we\nretain up to three salient evidence phrases per step, cap each\nphrase at six words, and prioritize diagnostically actionable\ncues with explicit abnormal descriptors or negative findings.\nReward Shaping and Optimization.\nUnder IMD, given\na training pair (x, y) ∼DRL, where x = (xtext, xI, xT )\nand y is the protocol-structured target response containing\na K-step interpretation trace (with K=6 in our protocol),\na brief summary narrative, and a final diagnosis a⋆. The\npolicy πθ samples a response ˜y ∼πθ(· | x) with the same\nstructure and a predicted diagnosis ˆa(˜y).\n5\n"}, {"page": 6, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nTable 1. Grounded ECG Interpretation Results.\nMetric\nDiagnosis\nAccuracy\nAnalysis\nCompleteness\nAnalysis\nRelevance\nLead\nEvidence\nValidity\nECG\nFeature\nGrounding\nEvidence\nBased\nReasoning\nClinical\nDiagnostic\nFidelity\nProprietary MLLMs\nGemini-3-Pro\n13.40\n2.41\n0.97\n0.74\n30.13\n21.47\n27.48\nGPT-5.1-Instant\n31.48\n3.03\n1.48\n1.92\n47.29\n40.33\n43.46\nOpen-source MLLMs\nMiMo-VL-7B-SFT\n11.28\n1.21\n0.50\n0.24\n23.52\n21.24\n25.22\nGLM-4.1V-9B-Base\n17.53\n1.94\n0.78\n0.57\n30.83\n23.97\n25.24\nQwen3-VL-8B-Instruct\n20.03\n2.67\n0.82\n0.32\n34.20\n28.35\n31.17\nInternVL3-8B-Instruct\n20.94\n1.78\n0.97\n0.18\n27.80\n20.43\n21.55\nMiniCPM-V-4.5\n25.29\n2.83\n1.40\n0.45\n38.82\n31.12\n34.77\nMedical MLLMs\nMedVLM-R1\n16.62\n0.49\n0.13\n0.00\n11.36\n5.63\n5.12\nChiron-o1-8B\n21.20\n1.57\n1.01\n0.45\n30.81\n24.87\n25.88\nQoQ-Med-VL-7B\n27.01\n2.56\n1.79\n0.42\n37.38\n32.85\n33.70\nMedGemma-4B\n27.34\n2.10\n0.92\n0.02\n26.24\n21.52\n23.14\nMedGemma-27B\n25.23\n3.20\n1.50\n0.81\n42.04\n36.14\n39.22\nHuatuoGPT-Vision-7B\n29.27\n1.83\n1.34\n0.18\n33.21\n29.41\n29.85\nECG-specialized MLLMs\nPULSE\n66.13\n1.90\n1.86\n0.19\n41.6\n39.42\n40.53\nGEM\n74.70\n4.25\n3.79\n4.41\n65.34\n63.15\n62.90\nECG-R1 (SFT)\n79.33\n6.36\n4.58\n5.53\n79.92\n78.08\n83.51\nECG-R1 (RL)\n80.29\n6.51\n4.74\n5.81\n80.57\n79.08\n84.20\nTo reward stepwise evidence grounding, we compute a per-\nstep evidence coverage score. Let Ek(y) denote the set of\nstep-specific key evidence phrases extracted from the k-th\nstep text of the target response y, and let ˜y(k) denote the\ngenerated text at step k. We define the step reward as\nr(k)\nstep(x, ˜y; y) =\n\f\f match(Ek(y), ˜y(k))\n\f\f\n\f\fEk(y)\n\f\f\n,\n(3)\nwhere match(·, ·) counts the number of evidence phrases\nthat appear in ˜y(k) after simple normalization (e.g., case-\nfolding). We then compute the diagnostic process reward\nby averaging per-step scores:\nREDER(x, ˜y; y) = 1\nK\nK\nX\nk=1\nr(k)\nstep(x, ˜y; y).\n(4)\nThe diagnosis accuracy reward is computed from the pre-\ndicted diagnosis in the <answer> block as a set-level Jac-\ncard similarity:\nRaccuracy(x, ˜y) =\n\f\fS(ˆa(˜y)) ∩S(a⋆)\n\f\f\n\f\fS(ˆa(˜y)) ∪S(a⋆)\n\f\f.\n(5)\nwhere S(·) maps a diagnosis string to a label set by splitting\non semicolons for multi-label cases and treating it as a\nsingleton otherwise. We include a format reward Rformat(˜y),\nwhich assigns 1 if ˜y contains a non-empty <think> block\nand 0 otherwise. Finally, the total reward is then defined as\nRtotal = Rformat + Raccuracy + λ REDER,\n(6)\nwhere λ controls the weight of the stepwise evidence-\ngrounding reward. After computing rewards, we optimize\nthe policy with DAPO (Yu et al., 2025a).\nFor each x,\nwe sample G responses ˜yi from πθold(· | x), compute\nRi = Rtotal(x, ˜yi; y), and set a per-response advantage\nˆAi = (Ri −mean({Rj}))/std({Rj}), shared across to-\nkens in ˜yi. Let ri,t(θ) = πθ(˜yi,t | x, ˜yi,<t)/πθold(˜yi,t |\nx, ˜yi,<t). DAPO updates θ by maximizing the decoupled-\nclipping PPO objective with N = PG\ni=1 |˜yi|, ϵlow=0.2, and\nϵhigh=0.3:\nJ(θ) = E\nh\n1\nN\nP\ni,t min\n\u0000ri,t(θ), ˜ri,t(θ)\n\u0001 ˆAi\ni\n,\nwhere ˜ri,t(θ) = clip\n\u0000ri,t(θ), 1 −ϵlow, 1 + ϵhigh\n\u0001\n.\n3. Experiments\n3.1. Training Dataset\nWe define DSFT as the union of our ECG Protocol-Guided\nGrounding CoT and ECGInstruct (Liu et al., 2024c). We\nsynthesize ECG images from raw signals using ECG-image-\nkit (Shivashankara et al., 2024) and extract fine-grained\n6\n"}, {"page": 7, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nFigure 4. Modality Missing Results between Time-Series and Image Modalities.\nfeatures via FeatureDB (Hong et al., 2019).\n3.2. Main Evaluation Tasks and Metrics\nGrounded ECG Interpretation. We evaluate grounded\nECG interpretation to assess whether the MLLM attains\ncardiologist-level competency in basic ECG reading, where\naccurate diagnosis must be accompanied by fine-grained\nevidence localization and clinically grounded justification.\nPerformance is measured by seven rubric-based metrics\n(Appendix B.1) that jointly quantify diagnostic correctness,\ncoverage and relevance of ECG findings, lead-wise evidence\nvalidity, and the fidelity of evidence-based clinical reason-\ning. For fair comparison, we adopt the ECG-Grounding\ntest set (Lan et al., 2025) comprising 2,381 samples. Fi-\nnally, to avoid dependence on an older closed-source grader\n(GPT-4o) with potential access restrictions and long-term\nunavailability, we use DeepSeek-V3.1-Terminus to score\nthe MLLM outputs under the same evaluation rubric.\nRobust and Consistent ECG Interpretation. We intro-\nduce the Robust and Consistent ECG Interpretation task\nto evaluate model performance under different levels of\ndata completeness, focusing on robustness and consistency\nin modality missing conditions for ECG omni-perception\nMLLMs. For robustness, under the full-modality input\nsetting, we randomly drop either the time-series or image\nmodality, retaining only a single modality for evaluation,\nand assess performance using the same test set and met-\nrics as the Grounded ECG Interpretation task. For consis-\ntency, we evaluate time-series-only and image-only inputs\non the same cases and quantify cross-modal output agree-\nment using three text-similarity metrics, whose definitions\nand scoring criteria are provided in Appendix B.1.\nCardiologist Evaluation. To assess the real-world relia-\nbility and usefulness of the interpretations, we invited four\nlicensed cardiologists to independently review the model\nTable 2. Modality Consistency Results between Time-Series and\nImage Modalities.\nMetric\nBLEU-4\nROUGE-L\nSBERT-Score\nGEM\n0.33\n0.43\n0.92\nECG-R1\n0.69\n0.73\n0.97\noutputs using seven predefined clinical criteria, with de-\ntailed metric definitions and scoring rubrics provided in Ap-\npendix B.1. Specifically, we randomly sampled 100 test set\ncases and collected cardiologist ratings for interpretations\ngenerated by GEM (the strongest baseline) and ECG-R1,\nreporting results as mean and standard deviation.\n3.3. Evaluation Results on ECG Interpretation\nTable 1 summarizes the performance of representative\nproprietary, open-source, medical, and ECG-specialized\nMLLMs, together with our method, on seven evaluation\nmetrics for ECG interpretation.\nAmong all non-ECG-\nspecialized MLLMs, GPT-5.1 achieves the highest Diag-\nnosis Accuracy. However, its absolute score remains low\nat 31.48, falling far short of the reliability required for real-\nworld clinical deployment. Notably, despite ECG being a\nroutine clinical modality, existing medical MLLMs still fail\nto interpret ECGs reliably, with Diagnosis Accuracy con-\nsistently below 30.00. A deeper analysis reveals that most\nnon-ECG-specialized MLLMs obtain relatively high scores\nin Analysis Completeness, yet perform poorly in Analy-\nsis Relevance, Lead Evidence Validity, and ECG Feature\nGrounding. This discrepancy indicates that these models\ncan follow instructions to generate structurally complete\nand seemingly comprehensive analyses (e.g., mentioning\nR–R intervals), but the underlying content is often incorrect,\nexhibiting systematic hallucinations that ultimately lead to\nerroneous diagnostic conclusions. Although MLLMs excel\nat general image understanding, our results provide the first\n7\n"}, {"page": 8, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nTable 3. Cardiologist Evaluation of Reliability and Usefulness Metrics (Mean and STD).\nMetric\nReliability\nUsefulness\nAnalytical\nRelevance\nAnalytical\nAccuracy\nAnalytical\nCompleteness\nReasoning\nQuality\nFindings\nNovelty\nClinical\nValue\nOverall\nSatisfaction\nGEM\n4.16/5 (0.78)\n3.89/5 (0.89)\n4.05/5 (0.71)\n4.03/5 (0.73)\n2.82/5 (1.59)\n3.84/5 (1.00)\n3.84/5 (0.99)\nECG-R1\n4.55/5 (0.53)\n4.34/5 (0.66)\n4.43/5 (0.58)\n4.48/5 (0.57)\n3.25/5 (1.78)\n4.38/5 (0.64)\n4.38/5 (0.63)\nsystematic evidence that severe hallucination is pervasive\nin ECG interpretation, cautioning against uncritical public\nreliance on their outputs.\nIn comparisons with ECG-specialized MLLMs, ECG-R1\ndelivers consistent, comprehensive gains. Compared with\nGEM, the first ECG omni-perception MLLM and the previ-\nous best-performing model, ECG-R1 increases Diagnosis\nAccuracy to 80.29 and improves analysis quality (Anal-\nysis Completeness 6.51; Analysis Relevance 4.74), indi-\ncating interpretations that are more complete and better\naligned with the final diagnosis. We attribute these gains\nto a structured, stepwise workflow that enforces systematic\nreview, improving coverage of critical diagnostic elements\nand reducing missed clinically relevant findings. Lead Evi-\ndence Validity also rises to 5.81, suggesting more diagnosis-\nrelevant, lead-specific evidence rather than template-style\nlead enumeration. Most notably, ECG-R1 yields a +17.49\naverage absolute gain over GEM on ECG Feature Ground-\ning, Evidence-Based Reasoning, and Clinical Diagnostic\nFidelity, indicating stronger grounding in verifiable ECG\nfeatures and tighter evidence-to-diagnosis linkage. More-\nover, we adopt explicit, monograph-defined phases with\na fixed sequence of rhythm, conduction, morphology, and\nischemia assessment, closely resembling real-world clini-\ncal ECG workflow before the final diagnosis. Finally, the\nRL model consistently outperforms the SFT model across\nall metrics, showing that evidence-rewarded reinforcement\nlearning further strengthens reasoning performance. Collec-\ntively, these gains indicate that ECG-R1 makes substantial\nprogress toward more reliable ECG interpretation.\n3.4. Evaluation Results on Robustness and Consistency\nunder Modality Missing\nFigure 4 and Table 2 present the robustness and consis-\ntency evaluation results specifically designed for ECG omni-\nperception MLLMs, with the representative model GEM\nused for comparison. In the robustness evaluation, GEM ex-\nhibits substantial performance degradation under modality\nmissing conditions. In particular, when only the time-series\nmodality is provided and the image modality is entirely\nmissing, Diagnosis Accuracy score suffers a maximum rela-\ntive drop of 28.0%, while Analysis Relevance score experi-\nences an even more severe maximum relative drop of 44.9%.\nThese results show that GEM is highly sensitive to missing\nmodalities and lacks robustness under incomplete inputs.\nIn contrast, ECG-R1 exhibits consistently smaller relative\ndrops when either the time-series or image modality is re-\nmoved, and even with one modality entirely absent, it still\nsurpasses GEM using both modalities. In the consistency\nevaluation, we assess the agreement between interpreta-\ntions generated from time-series-only and image-only inputs.\nGEM achieves BLEU-4 and ROUGE-L scores of 0.33 and\n0.43, indicating substantial discrepancies in surface expres-\nsion and content coverage across modalities. In contrast,\nECG-R1 attains markedly higher scores on both metrics,\ndemonstrating improved cross-modality textual consistency.\nMoreover, ECG-R1 achieves an SBERT-Score of 0.97, re-\nflecting strong semantic alignment between interpretations\nproduced under different modality conditions. Collectively,\nthese results show that ECG-R1 maintains reliable ECG\ninterpretations across varying levels of data completeness.\n3.5. Cardiologist Evaluation Results\nTable 3 reports the ratings independently provided by four\nlicensed cardiologists. For reliability, ECG-R1 consistently\noutperforms GEM across all three criteria. The gains in An-\nalytical Relevance and Analytical Completeness are driven\nby a structured, stepwise interpretation procedure, which\nkeeps the analysis diagnosis-focused and systematically cov-\ners key ECG components. Crucially, Analytical Accuracy\nmeasures whether an interpretation contains medical fac-\ntual errors, where lower scores indicate more frequent or\nmore severe errors, and thus directly reflects the severity\nof hallucination-like failures in ECG interpretation. Under\nthis criterion, ECG-R1 achieves higher accuracy than GEM\n(4.34 vs. 3.89), because ECG-R1’s interpretation corpus is\ngenerated under protocol guidance, whereas GEM’s inter-\npretation corpus relies on pretrained knowledge from LLMs\nalone. For usefulness, ECG-R1 consistently outperforms\nGEM across all four criteria. The Reasoning Quality gain\nstems from our monograph-derived five-phase analysis that\naligns with standard clinical workflow, and the improve-\nments in Clinical Value and Overall Satisfaction indicate\nmore actionable, trustworthy support. Findings Novelty is\nalso higher, though inherently case-dependent with greater\ninter-rater variability. Overall, cardiologists judge the inter-\npretations from ECG-R1 to be more trustworthy.\n8\n"}, {"page": 9, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\n4. Conclusion\nIn this work, we propose ECG-R1, the first reasoning\nMLLM for ECG interpretation. ECG-R1 improves reliabil-\nity through three innovations: Protocol-Guided Instruction\nData Generation to construct structured, comprehensive in-\nterpretations and reduce factual errors; Interleaved Modality\nDropout to enhance robustness and cross-modal consistency\nunder varying data completeness; and Reinforcement Learn-\ning with ECG Diagnostic Evidence Rewards to strengthen\nevidence-based reasoning. We also conduct a systematic\nevaluation of ECG interpretation across proprietary, open-\nsource, and medical MLLMs, exposing key limitations in\nthese MLLMs. Experiments show that ECG-R1 consistently\noutperforms prior state-of-the-art methods in diagnostic ac-\ncuracy and interpretation quality, while remaining stable\nunder modality missing conditions, representing substantial\nprogress toward reliable ECG interpretation.\nImpact Statement\nThis work aims to improve the reliability of ECG interpre-\ntation produced by multimodal large language models by\ngrounding interpretations in structured clinical logic and\nECG-derived physiological measurements. If developed\nand validated responsibly, such approaches may help reduce\nhallucinated ECG interpretations produced by multimodal\nlarge language models, improve the consistency of model-\ngenerated reports under real-world data imperfections, and\nsupport research on safer AI-assisted ECG workflows.\nAt the same time, ECG interpretation is a high-stakes medi-\ncal application. Despite the improvements demonstrated in\nthis study, the proposed methods and models are intended\nfor research purposes and are not a substitute for profes-\nsional medical judgment. Model outputs may still contain\nmedical factual errors, omissions, or misleading statements,\nand should not be used as a standalone basis for critical\nclinical decisions. In particular, the public should not di-\nrectly rely on model-generated ECG interpretations without\nqualified clinical oversight. Any real-world deployment\nwould require rigorous prospective validation, appropriate\nclinical governance, and regulatory review, with clinicians\nremaining responsible for final decisions.\nReferences\nBai, S., Cai, Y., Chen, R., Chen, K., Chen, X., Cheng, Z.,\nDeng, L., Ding, W., Gao, C., Ge, C., Ge, W., Guo, Z.,\nHuang, Q., Huang, J., Huang, F., Hui, B., Jiang, S., Li,\nZ., Li, M., Li, M., Li, K., Lin, Z., Lin, J., Liu, X., Liu,\nJ., Liu, C., Liu, Y., Liu, D., Liu, S., Lu, D., Luo, R., Lv,\nC., Men, R., Meng, L., Ren, X., Ren, X., Song, S., Sun,\nY., Tang, J., Tu, J., Wan, J., Wang, P., Wang, P., Wang,\nQ., Wang, Y., Xie, T., Xu, Y., Xu, H., Xu, J., Yang, Z.,\nYang, M., Yang, J., Yang, A., Yu, B., Zhang, F., Zhang,\nH., Zhang, X., Zheng, B., Zhong, H., Zhou, J., Zhou,\nF., Zhou, J., Zhu, Y., and Zhu, K. Qwen3-VL Technical\nReport, November 2025. URL http://arxiv.org/\nabs/2511.21631. arXiv:2511.21631 [cs].\nChen, J., Gui, C., Ouyang, R., Gao, A., Chen, S., Chen,\nG. H., Wang, X., Zhang, R., Cai, Z., Ji, K., Yu, G., Wan,\nX., and Wang, B. HuatuoGPT-Vision, Towards Injecting\nMedical Visual Knowledge into Multimodal LLMs at\nScale, September 2024a. URL http://arxiv.org/\nabs/2406.19280. arXiv:2406.19280 [cs].\nChen, J., Xiao, S., Zhang, P., Luo, K., Lian, D., and\nLiu, Z.\nBge m3-embedding:\nMulti-lingual, multi-\nfunctionality, multi-granularity text embeddings through\nself-knowledge distillation, 2024b.\nDai,\nW.,\nChen,\nP.,\nEkbote,\nC.,\nand Liang,\nP. P.\nQoQ-Med: Building Multimodal Clinical Foundation\nModels with Domain-Aware GRPO Training, Octo-\nber 2025.\nURL http://arxiv.org/abs/2506.\n00711. arXiv:2506.00711 [cs].\nGoogle.\nA new era of intelligence with Gemini\n3,\n2025.\nURL\nhttps://blog.google/\nproducts-and-platforms/products/\ngemini/gemini-3/.\nGuo, D., Yang, D., Zhang, H., Song, J., Wang, P., Zhu,\nQ., Xu, R., Zhang, R., Ma, S., Bi, X., et al. Deepseek-\nr1 incentivizes reasoning in llms through reinforcement\nlearning. Nature, 645(8081):633–638, 2025.\nHong, S., Zhou, Y., Wu, M., Shang, J., Wang, Q., Li, H., and\nXie, J. Combining deep neural networks and engineered\nfeatures for cardiac arrhythmia detection from ECG\nrecordings. Physiological Measurement, 40(5):054009,\nJune 2019. ISSN 1361-6579. doi: 10.1088/1361-6579/\nab15a2. URL https://iopscience.iop.org/\narticle/10.1088/1361-6579/ab15a2.\nHong, S., Zhou, Y., Shang, J., Xiao, C., and Sun, J. Op-\nportunities and challenges of deep learning methods for\nelectrocardiogram data: A systematic review. Comput-\ners in Biology and Medicine, 122:103801, July 2020.\nISSN 00104825.\ndoi:\n10.1016/j.compbiomed.2020.\n103801. URL https://linkinghub.elsevier.\ncom/retrieve/pii/S0010482520301694.\nHuang, J., Zhang, J., Jiang, K., Qiu, H., Zhang, X., Shao,\nL., Lu, S., and Tao, D.\nVisual Instruction Tuning\ntowards General-Purpose Multimodal Large Language\nModel: A Survey. International Journal of Computer\nVision, 133(11):8151–8189, November 2025. ISSN 0920-\n5691, 1573-1405. doi: 10.1007/s11263-025-02572-7.\nURL https://link.springer.com/10.1007/\ns11263-025-02572-7.\n9\n"}, {"page": 10, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nJin, J., Fang, X., Wang, H., Li, J., Liu, C., Xie, D., Li,\nH., and Hong, S. Self-Alignment Learning to Improve\nMyocardial Infarction Detection from Single-Lead ECG,\nSeptember 2025a. URL http://arxiv.org/abs/\n2509.19397. arXiv:2509.19397 [eess].\nJin, J., Wang, H., Lan, X., Li, J., Cheng, G., Li, H., and\nHong, S. UniECG: Understanding and Generating ECG\nin One Unified Model, September 2025b. URL http://\narxiv.org/abs/2509.18588. arXiv:2509.18588\n[cs].\nJin, J., Wang, H., Li, H., Li, J., Pan, J., and Hong, S. Read-\ning your heart: Learning ECG words and sentences via\npre-training ECG language model. In The Thirteenth\nInternational Conference on Learning Representations,\n2025c. URL https://openreview.net/forum?\nid=6Hz1Ko087B.\nJohnson, A. E., Bulgarelli, L., Shen, L., Gayles, A., Sham-\nmout, A., Horng, S., Pollard, T. J., Hao, S., Moody, B.,\nGow, B., et al. Mimic-iv, a freely accessible electronic\nhealth record dataset. Scientific data, 10(1):1, 2023.\nKiyasseh, D., Zhu, T., and Clifton, D. A.\nCLOCS:\nContrastive Learning of Cardiac Signals Across Space,\nTime, and Patients. In Proceedings of the 38th Interna-\ntional Conference on Machine Learning, pp. 5606–5615.\nPMLR, July 2021. URL https://proceedings.\nmlr.press/v139/kiyasseh21a.html.\nLan, X., Ng, D., Hong, S., and Feng, M.\nIntra-Inter\nSubject Self-Supervised Learning for Multivariate Car-\ndiac Signals.\nProceedings of the AAAI Conference\non Artificial Intelligence, 36(4):4532–4540, June 2022.\nISSN 2374-3468, 2159-5399. doi: 10.1609/aaai.v36i4.\n20376.\nURL https://ojs.aaai.org/index.\nphp/AAAI/article/view/20376.\nLan, X., Wu, F., He, K., Zhao, Q., Hong, S., and Feng,\nM.\nGEM: Empowering MLLM for Grounded ECG\nUnderstanding with Time Series and Images, Octo-\nber 2025.\nURL http://arxiv.org/abs/2503.\n06073. arXiv:2503.06073 [cs].\nLi, C., Wong, C., Zhang, S., Usuyama, N., Liu, H., Yang, J.,\nNaumann, T., Poon, H., and Gao, J. LLaVA-med: Train-\ning a large language-and-vision assistant for biomedicine\nin one day.\nIn Thirty-seventh Conference on Neural\nInformation Processing Systems Datasets and Bench-\nmarks Track, 2023.\nURL https://openreview.\nnet/forum?id=GSuP99u2kR.\nLi, H., Li, Z., Mao, Y., Liu, Z., Sun, Z., and Huang,\nZ. anyECG-chat: A Generalist ECG-MLLM for Flexi-\nble ECG Input and Multi-Task Understanding, Novem-\nber 2025a. URL http://arxiv.org/abs/2506.\n00942. arXiv:2506.00942 [cs].\nLi, J., Liu, C., Cheng, S., Arcucci, R., and Hong, S.\nFrozen Language Model Helps ECG Zero-Shot Learn-\ning.\nIn Medical Imaging with Deep Learning, pp.\n402–415. PMLR, January 2024.\nURL https://\nproceedings.mlr.press/v227/li24a.html.\nLi, J., Aguirre, A. D., Junior, V. M., Jin, J., Liu, C., Zhong,\nL., Sun, C., Clifford, G., Brandon Westover, M., and\nHong, S. An electrocardiogram foundation model built on\nover 10 million recordings. NEJM AI, 2(7):AIoa2401033,\n2025b.\nLi, J., Chen, J., Qu, Y., Xu, S., Lin, Z., Zhu, J., Xu,\nB., Tan, W., Fu, P., Ju, J., Luo, Z., and Luan, J.\nXiaomi MiMo-VL-Miloco Technical Report, Decem-\nber 2025c. URL http://arxiv.org/abs/2512.\n17436. arXiv:2512.17436 [cs].\nLiu, A., Feng, B., Xue, B., Wang, B., Wu, B., Lu, C., Zhao,\nC., Deng, C., Zhang, C., Ruan, C., et al. Deepseek-\nv3 technical report. arXiv preprint arXiv:2412.19437,\n2024a.\nLiu, C., Wan, Z., Ouyang, C., Shah, A., Bai, W., and Ar-\ncucci, R. Zero-Shot ECG Classification with Multimodal\nLearning and Test-time Clinical Knowledge Enhance-\nment, July 2024b. URL http://arxiv.org/abs/\n2403.06659. arXiv:2403.06659 [eess].\nLiu, R., Bai, Y., Yue, X., and Zhang, P. Teach Multimodal\nLLMs to Comprehend Electrocardiographic Images, Oc-\ntober 2024c. URL http://arxiv.org/abs/2410.\n19008. arXiv:2410.19008 [eess].\nLiu, X., Wang, H., Li, Z., and Qin, L.\nDeep learning\nin ECG diagnosis:\nA review.\nKnowledge-Based\nSystems,\n227:107187,\nSeptember\n2021.\nISSN\n09507051.\ndoi:\n10.1016/j.knosys.2021.107187.\nURL\nhttps://linkinghub.elsevier.com/\nretrieve/pii/S0950705121004494.\nMasoudi, F. A., Magid, D. J., Vinson, D. R., Tricomi,\nA. J., Lyons, E. E., Crounse, L., Ho, P. M., Peterson,\nP. N., and Rumsfeld, J. S. Implications of the Failure to\nIdentify High-Risk Electrocardiogram Findings for the\nQuality of Care of Patients With Acute Myocardial In-\nfarction: Results of the Emergency Department Quality\nin Myocardial Infarction (EDQMI) Study. Circulation,\n114(15):1565–1571, October 2006. ISSN 0009-7322,\n1524-4539.\ndoi: 10.1161/CIRCULATIONAHA.106.\n623652. URL https://www.ahajournals.org/\ndoi/10.1161/CIRCULATIONAHA.106.623652.\nNa, Y., Park, M., Tae, Y., and Joo, S. Guiding Masked Repre-\nsentation Learning to Capture Spatio-Temporal Relation-\nship of Electrocardiogram, March 2024. URL http://\narxiv.org/abs/2402.09450. arXiv:2402.09450\n[eess].\n10\n"}, {"page": 11, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nOpenAI. Introducing GPT-5.1, 2025. URL https://\nopenai.com/index/gpt-5-1/.\nPan, J., Liu, C., Wu, J., Liu, F., Zhu, J., Li, H. B., Chen,\nC., Ouyang, C., and Rueckert, D. MedVLM-R1: In-\ncentivizing Medical Reasoning Capability of Vision-\nLanguage Models (VLMs) via Reinforcement Learn-\ning, March 2025. URL http://arxiv.org/abs/\n2502.19634. arXiv:2502.19634 [cs].\nRafie, N., Kashou, A. H., and Noseworthy, P. A. ECG\nInterpretation: Clinical Relevance, Challenges, and Ad-\nvances. Hearts, 2(4):505–513, November 2021. ISSN\n2673-3846. doi: 10.3390/hearts2040039. URL https:\n//www.mdpi.com/2673-3846/2/4/39.\nSellergren, A., Kazemzadeh, S., Jaroensri, T., Kiraly, A.,\nTraverse, M., Kohlberger, T., Xu, S., Jamil, F., Hughes,\nC., Lau, C., et al. Medgemma technical report. arXiv\npreprint arXiv:2507.05201, 2025.\nShivashankara, K. K., Deepanshi, Mehri Shervedani, A.,\nClifford, G. D., Reyna, M. A., and Sameni, R. ECG-\nImage-Kit: a synthetic image generation toolbox to facili-\ntate deep learning-based electrocardiogram digitization.\nPhysiological Measurement, 45(5):055019, May 2024.\nISSN 0967-3334, 1361-6579. doi: 10.1088/1361-6579/\nad4954. URL https://iopscience.iop.org/\narticle/10.1088/1361-6579/ad4954.\nStroobandt, R. X., Barold, S. S., and Sinnaeve, A. F. ECG\nfrom Basics to Essentials: Step by Step. John Wiley &\nSons, 2015.\nSun, H., Jiang, Y., Lou, W., Zhang, Y., Li, W., Wang, L.,\nLiu, M., Liu, L., and Wang, X. Chiron-o1: Igniting\nmultimodal large language models towards generaliz-\nable medical reasoning via mentor-intern collaborative\nsearch. In The Thirty-ninth Annual Conference on Neural\nInformation Processing Systems, 2025. URL https:\n//openreview.net/forum?id=gUbQZ7AtaZ.\nTeam, G.-V., Hong, W., Yu, W., Gu, X., Wang, G., Gan, G.,\nTang, H., Cheng, J., Qi, J., Ji, J., Pan, L., Duan, S., Wang,\nW., Wang, Y., Cheng, Y., He, Z., Su, Z., Yang, Z., Pan, Z.,\nZeng, A., Wang, B., Chen, B., Shi, B., Pang, C., Zhang,\nC., Yin, D., Yang, F., Chen, G., Li, H., Zhu, J., Chen, J.,\nXu, J., Xu, J., Chen, J., Lin, J., Chen, J., Wang, J., Chen,\nJ., Lei, L., Gong, L., Pan, L., Liu, M., Xu, M., Zhang, M.,\nZheng, Q., Lyu, R., Tu, S., Yang, S., Meng, S., Zhong,\nS., Huang, S., Zhao, S., Xue, S., Zhang, T., Luo, T., Hao,\nT., Tong, T., Jia, W., Li, W., Liu, X., Zhang, X., Lyu, X.,\nZhang, X., Fan, X., Huang, X., Xue, Y., Wang, Y., Wang,\nY., Wang, Y., An, Y., Du, Y., Huang, Y., Niu, Y., Shi, Y.,\nWang, Y., Wang, Y., Yue, Y., Li, Y., Liu, Y., Zhang, Y.,\nWang, Y., Zhang, Y., Xue, Z., Du, Z., Hou, Z., Wang,\nZ., Zhang, P., Liu, D., Xu, B., Li, J., Huang, M., Dong,\nY., and Tang, J. GLM-4.5V and GLM-4.1V-Thinking:\nTowards Versatile Multimodal Reasoning with Scalable\nReinforcement Learning, January 2026. URL http://\narxiv.org/abs/2507.01006. arXiv:2507.01006\n[cs].\nYu, Q., Zhang, Z., Zhu, R., Yuan, Y., Zuo, X., Yue, Y.,\nDai, W., Fan, T., Liu, G., Liu, L., Liu, X., Lin, H., Lin,\nZ., Ma, B., Sheng, G., Tong, Y., Zhang, C., Zhang, M.,\nZhang, W., Zhu, H., Zhu, J., Chen, J., Chen, J., Wang, C.,\nYu, H., Song, Y., Wei, X., Zhou, H., Liu, J., Ma, W.-Y.,\nZhang, Y.-Q., Yan, L., Qiao, M., Wu, Y., and Wang, M.\nDAPO: An Open-Source LLM Reinforcement Learning\nSystem at Scale, May 2025a. URL http://arxiv.\norg/abs/2503.14476. arXiv:2503.14476 [cs].\nYu, T., Wang, Z., Wang, C., Huang, F., Ma, W., He, Z., Cai,\nT., Chen, W., Huang, Y., Zhao, Y., Xu, B., Cui, J., Xu, Y.,\nRuan, L., Zhang, L., Liu, H., Tang, J., Liu, H., Guo, Q.,\nHu, W., He, B., Zhou, J., Cai, J., Qi, J., Guo, Z., Chen,\nC., Zeng, G., Li, Y., Cui, G., Ding, N., Han, X., Yao, Y.,\nLiu, Z., and Sun, M. MiniCPM-V 4.5: Cooking Efficient\nMLLMs via Architecture, Data, and Training Recipe,\nSeptember 2025b. URL http://arxiv.org/abs/\n2509.18154. arXiv:2509.18154 [cs].\nZhang, J., Huang, J., Yao, H., Liu, S., Zhang, X., Lu, S.,\nand Tao, D. R1-vl: Learning to reason with multimodal\nlarge language models via step-wise group relative policy\noptimization. arXiv preprint arXiv:2503.12937, 2025.\nZhao, Y., Kang, J., Zhang, T., Han, P., and Chen, T. ECG-\nChat: A Large ECG-Language Model for Cardiac Disease\nDiagnosis, April 2025a. URL http://arxiv.org/\nabs/2408.08849. arXiv:2408.08849 [eess].\nZhao, Y., Kang, J., Zhang, T., Han, P., and Chen, T. Ecg-\nchat: A large ecg-language model for cardiac disease\ndiagnosis. In 2025 IEEE International Conference on\nMultimedia and Expo (ICME), pp. 1–6, 2025b. doi: 10.\n1109/ICME59968.2025.11209476.\nZhu, J., Wang, W., Chen, Z., Liu, Z., Ye, S., Gu, L., Tian,\nH., Duan, Y., Su, W., Shao, J., Gao, Z., Cui, E., Wang,\nX., Cao, Y., Liu, Y., Wei, X., Zhang, H., Wang, H., Xu,\nW., Li, H., Wang, J., Deng, N., Li, S., He, Y., Jiang, T.,\nLuo, J., Wang, Y., He, C., Shi, B., Zhang, X., Shao, W.,\nHe, J., Xiong, Y., Qu, W., Sun, P., Jiao, P., Lv, H., Wu,\nL., Zhang, K., Deng, H., Ge, J., Chen, K., Wang, L., Dou,\nM., Lu, L., Zhu, X., Lu, T., Lin, D., Qiao, Y., Dai, J., and\nWang, W. InternVL3: Exploring Advanced Training and\nTest-Time Recipes for Open-Source Multimodal Models,\nApril 2025. URL http://arxiv.org/abs/2504.\n10479. arXiv:2504.10479 [cs].\n11\n"}, {"page": 12, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nECG-R1: Protocol-Guided and Modality-Agnostic MLLM for\nReliable ECG Interpretation\nAppendix\nRelated Work. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .13\nMedical Multimodal Large Language Model . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 13\nLanguage-based ECG Analysis . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 13\nExperiment Details . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 14\nMetrics. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .14\nHyperparameter Settings . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 16\nBaseline Models . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 16\nExtended Experiment Results . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 17\nDataset Comparison . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 17\nECG-Bench Results . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 18\nAblation Study on Interleaved Modality Dropout . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 18\nAblation Study on ECG Diagnostic Evidence Rewards . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19\nNumerical Analysis of the DiagnosisAccuracy Metric Evaluated by GPT-4o and DeepSeek v3.1 Terminus . . . . . . . . 20\nComplete Proofs for Section 2.4 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 22\nAuxiliary Lemmas. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .23\nProof of Robustness Theorem. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .23\nProof of Consistency and Swap-Invariance Theorem . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 23\nRemarks on Using infθ Rτ(θ) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 24\nCase Study . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 25\nInference Results . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 25\nCase Study Discussion . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 33\nPrompts . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 34\nCorpus Construction . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 34\nInterpretation Evaluation . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 39\n12\n"}, {"page": 13, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nA. Related Work\nA.1. Medical Multimodal Large Language Model\nMedical multimodal large language models (medical MLLMs) have progressed rapidly via instruction tuning for medical\ndata understanding, clinical text generation, and cross-modal QA (Huang et al., 2025). LLaVA-Med (Li et al., 2023) utilizes\nPubMed Central data and GPT-4-generated instructions for multimodal tuning. HuatuoGPT-Vision (Chen et al., 2024a)\nleverages the PubMedVision dataset, achieving superior performance in medical VQA and report generation, especially in\nChinese. MedGemma (Sellergren et al., 2025) specializes in diverse modalities like radiology and pathology, prioritizing\nmobile and single-GPU deployment. Recent research emphasizes reasoning and reliability. For examples, MedVLM-R1\n(Pan et al., 2025) employs reinforcement learning for chain-of-thought reasoning, while Chiron-o1-8B (Sun et al., 2025)\nintegrates MICS with tool-augmented thinking. QoQ-Med (Dai et al., 2025) reasons across images, time-series, and text\nusing Domain-aware GRPO to mitigate clinical bias. However, despite ECG being one of the most prevalent clinical data\nmodalities, our experiments show that existing medical MLLMs exhibit pronounced deficiencies in both the completeness\nand accuracy of ECG interpretation, which limits their practical applicability in real-world clinical settings.\nA.2. Language-based ECG Analysis\nLanguage-based ECG interpretation and diagnosis remain in the early stages of exploration, with only a few recent studies\ndiscussing MLLM-based ECG analysis methods. Specifically, ECG-Chat (Zhao et al., 2025b) was developed as an MLLM\nfocused on processing time-series ECG data for report generation. In another approach, PULSE (Liu et al., 2024c) enhances\nECG image understanding for diagnosis and reporting by synthesizing realistic ECG images from raw signals. anyECG-\nChat (Li et al., 2025a) serves as a multi-task MLLM capable of report generation, abnormal waveform localization, and\nopen-ended QA. Furthermore, GEM (Lan et al., 2025) is an omni-perception MLLM that performs cross-modal fusion\nbetween time-series ECG and ECG images to produce evidence-based ECG interpretations. UniECG (Jin et al., 2025b) was\nalso introduced as an unified model capable of both evidence-based ECG interpretation and signal generation. However,\nprior approaches that rely on the pretrained knowledge of general-purpose LLMs for data generation may suffer from\nhallucinations, thereby reducing the reliability of the resulting interpretations. Moreover, existing ECG omni-perception\nMLLMs still exhibit pronounced performance degradation under modality missing conditions, which hinders their prospects\nfor real-world deployment.\n13\n"}, {"page": 14, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nB. Experiment Details\nB.1. Metrics\nGrounded ECG Interpretation: Evaluation Metric Rubrics\nDiagnosisAccuracy\n(0–2)\nEvaluates whether the generated diagnosis is correct, specific, and supported by ECG findings. For each sample, we treat\nall sub-items with Score > 0 as correct and report the percentage of such sub-items among all sub-items.\n+2 per diagnosis Each correctly identified key diagnosis with supporting ECG features.\n+1 per diagnosis Each mostly correct diagnosis but lacking key supporting details.\n+0 per diagnosis Each incorrect or vague diagnosis not supported by ECG features.\nAnalysisCompleteness\n(0–1)\nChecks if all key ECG components (e.g., rhythm, intervals, waveforms, and lead-specific findings) are discussed. Results\nare provided in absolute terms, indicating the average number of correctly addressed key ECG features for each sample.\n+1 per feature For each correctly addressed key ECG feature (e.g., rhythm, PR interval, QRS duration, ST segment, T\nwave morphology).\n+0 per missing feature For each key feature omitted or inaccurately described.\nAnalysisRelevance\n(0–2)\nAssesses whether each provided explanation directly supports the diagnosis. Results showing on average how many\npoints support the diagnosis with clear ECG evidence for each sample.\n+2 per feature or per lead Each point that strongly supports the diagnosis with clear ECG evidence.\n+1 per feature or per lead Some points are relevant but not fully justified.\n+0 Includes unrelated or misleading explanations.\nLeadEvidenceValidity\n(0–2)\nEvaluates whether the lead-related statements are diagnostically necessary, correctly grounded, and free of unsupported\nlead-wise claims, rather than maximizing the number of mentioned leads.\n+2 per key lead/region For each diagnosis-critical lead (or contiguous lead group / territory) correctly referenced\nwith explicit and matching ECG evidence (e.g., ST elevation/depression, T-wave inversion, pathologic Q waves,\nbundle-branch morphology) that supports the stated diagnosis.\n+1 per key lead/region For each key lead/region mentioned with partially correct evidence, but missing important\ndetails (e.g., direction without magnitude/morphology) or showing minor inconsistencies.\n+0 per key lead/region Key lead/region is omitted or the described finding is incorrect / non-grounded and does not\nsupport the diagnosis.\nGroundedECGUnderstanding\n(0–100)\nDetermines if the interpretation references actual ECG features (e.g., QRS amplitude, PR interval) instead of generic\nterms. Results are scaled from 0 to 100.\n100 – ECG findings are comprehensively cited, linked to diagnoses, and cover all relevant ECG features.\n80 – ECG findings are explicitly cited and linked to diagnoses.\n50 – Some ECG references exist but are incomplete.\n0 – Lacks specific waveform references.\nEvidenceBasedReasoning\n(0–100)\nEvaluates whether the diagnosis follows logical, evidence-supported steps. Results are scaled from 0 to 100.\n100 – Findings logically progress to diagnosis with thorough and clear justifications covering all necessary steps.\n80 – Findings logically progress to diagnosis with clear justifications.\n50 – Some reasoning exists but lacks complete step-by-step analysis.\n0 – Reasoning is unclear or not derived from ECG findings.\nClinicalDiagnosticFidelity\n(0–100)\n14\n"}, {"page": 15, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nAssesses if the model mimics how a clinician interprets an ECG, considering all relevant factors. Results are scaled from\n0 to 100.\n100 – The analysis follows a structured clinical approach and considers all relevant clinical factors.\n80 – The analysis follows a structured clinical approach.\n50 – Some clinical reasoning is present but incomplete.\n0 – The approach lacks structured clinical reasoning.\nConsistent ECG Interpretation Metrics\nBLEU-4 measures cross-modal n-gram fidelity between the time-series-only and image-only generated interpretations\nby computing the modified precision over 1–4-grams with a brevity penalty to discourage overly short outputs; higher\nBLEU-4 indicates stronger surface-form agreement in local phrasing and word order.\nROUGE-L evaluates cross-modal sequence-level overlap using the longest common subsequence (LCS) between the two\ngenerated texts, typically summarized as an F-measure over LCS-based precision and recall; higher ROUGE-L reflects\nbetter global structural consistency while allowing limited rephrasing.\nSBERT-Score assesses cross-modal semantic agreement by encoding each generated text into a dense sentence embedding\nusing the embedding model BGE-M3 (Chen et al., 2024b), and then computing the cosine similarity between the two\nembeddings, capturing meaning-level alignment beyond lexical overlap.\nCardiologist Evaluation: Reliability Metrics\nAnalytical Relevance\n(1–5)\nDoes the model’s analysis closely support the diagnosis and provide corresponding ECG evidence?\n5 – Every analysis point is highly relevant to the diagnosis, with clear supporting evidence.\n4 – Most analyses are strongly relevant, with minor insufficiencies.\n3 – Some analyses are relevant, but there is clear irrelevant content.\n2 – Most analyses are weakly relevant.\n1 – The analysis is unrelated to the diagnosis.\nAnalytical Accuracy\n(1–5)\nAre there any medical factual errors in the model’s output?\n5 – Completely accurate.\n4 – Mostly accurate.\n3 – Some errors.\n2 – Obvious errors.\n1 – Severe errors.\nAnalytical Completeness\n(1–5)\nDoes the model comprehensively discuss key ECG components relevant to the diagnosis, including rhythm, intervals,\nand waveforms?\n5 – All relevant ECG features (rhythm, PR, QRS, ST, T waves, intervals, etc.) are accurately discussed.\n4 – Most key ECG features are covered, with minor omissions.\n3 – Only some features are covered, with significant gaps.\n2 – Only a few ECG features are mentioned.\n1 – ECG components are largely missing, with severe omissions.\nCardiologist Evaluation: Usefulness Metrics\nReasoning Quality\n(1–5)\nDoes the model provide a clear, evidence-based reasoning process similar to that of a clinician, logically deriving the\ndiagnosis from ECG features?\n15\n"}, {"page": 16, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\n5 – Clear and coherent reasoning structure, explaining each step from ECG to diagnosis causally.\n4 – Overall reasonable reasoning, but some steps lack detail.\n3 – Partial reasoning present, but incomplete or logically weak.\n2 – Disjointed reasoning with major gaps.\n1 – No logical reasoning, only a stack of conclusions.\nFindings Novelty\n(1–5)\nDoes the model provide insights or findings not noticed by the clinician?\n5 – Important new diagnoses or findings.\n4 – Novel and somewhat insightful content.\n3 – Some new findings, but of limited value.\n2 – Conventional content, not particularly insightful.\n1 – No new information.\nClinical Value\n(1–5)\nDoes the model output help in clinical decision-making?\n5 – Direct and significant support for clinical judgment; content is clear and reliable.\n4 – Most content is helpful and practically useful.\n3 – Somewhat informative, but basic or unclear.\n2 – Partially suggestive, with limited decision support.\n1 – No value for clinical judgment; not informative.\nOverall Satisfaction\n(1–5)\nSubjective rating of the overall output quality.\n5 – Very satisfied.\n4 – Satisfied.\n3 – Neutral.\n2 – Dissatisfied.\n1 – Very dissatisfied.\nB.2. Hyperparameter Settings\nIn the SFT stage, we fine-tune the ECG-R1 for 1 epoch using full fine-tuning with a learning rate of 2e-5. Training is\nperformed with a per-device batch size of 4 and gradient accumulation of 2 steps in 8 NVIDIA A100 GPUs. The ECG\nencoder and image encoder remain frozen. For IMD, we set the interleave probability ps to 0.1 and the modality dropout pd\nprobability to 0.5. In the RL stage, we only train the LLM component while freezing the ECG encoder, image encoder,\nand their corresponding projectors. Training is performed for 1 epoch with a learning rate of 1e-6. We employ the DAPO\nalgorithm with epsilon high set to 0.30 and epsilon low set to 0.2, and EDER weight λ set to 1.0. Generation uses a\ntemperature of 1.0 with dynamic sampling enabled. The training uses a per-device batch size of 4 and gradient accumulation\nof 2 steps. For IMD, we set the interleave probability ps to 0.1 and the modality dropout pd probability to 0.5.\nB.3. Baseline Models\nWe compare against four representative groups of baselines: (i) general-purpose proprietary MLLMs, including Gemini-3-Pro\n(Google, 2025) and GPT-5.1-Instant (OpenAI, 2025); (ii) general-purpose open-source MLLMs, including MiMo-VL-7B-\nSFT (Li et al., 2025c), GLM-4.1V-9B-Base (Team et al., 2026), Qwen3-VL-8B-Instruct (Bai et al., 2025), InternVL3-8B-\nInstruct (Zhu et al., 2025), and MiniCPM-V-4.5 (Yu et al., 2025b); (iii) medical MLLMs, including MedVLM-R1 (Pan\net al., 2025), Chiron-o1-8B (Sun et al., 2025), QoQ-Med-VL-7B (Dai et al., 2025), MedGemma-4B/27B (Sellergren et al.,\n2025), MedGemma-27B (Sellergren et al., 2025), and HuatuoGPT-Vision-7B (Chen et al., 2024a); and (iv) ECG-specialized\nMLLMs, including ECG-Chat (Zhao et al., 2025a), PULSE (Liu et al., 2024c), and GEM (Lan et al., 2025), enabling\na systematic comparison across general-purpose capability, open-source ecosystems, medical-domain adaptation, and\nECG-specific specialization.\n16\n"}, {"page": 17, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nC. Extended Experiment Results\nC.1. Dataset Comparison\nFigure 5. Qualitative Comparison of ECG-Grounding and our ECG Protocol-Guided Grounding CoT.\nFigure 6. Quantitative Comparison of ECG-Grounding and our ECG\nProtocol-Guided Grounding CoT.\nFigure 5 presents a qualitative comparison between\ntwo corpus generation paradigms, showing that ECG-\nGrounding data constructed under the GEM paradigm\nexhibits three systematic limitations: (1) Fundamental\nmedical errors, where interpretations may violate basic\nelectrocardiographic principles (e.g., conflating limb-lead\nlow voltage with voltage-based LVH criteria); (2) Incom-\nplete diagnostic dimensionality, as reasoning constrained\nto report-explicit elements often omits key dimensions\nsuch as intervals/conduction, axis assessment, and is-\nchemia–infarction differentiation, resulting in fragmented\nassessments; and (3) Surface-level label imitation, where\ndependence on provided labels discourages identifying\nclinically relevant but unannotated findings (e.g., QTc\nprolongation or intraventricular conduction delay). In\ncontrast, our ECG Protocol-Guided Grounding CoT data\ninjects a standardized, verifiable interpretation protocol\nthat tightly couples evidence extraction with stepwise rea-\nsoning, enabling more nuanced clinical inference, struc-\ntured coverage across diagnostic dimensions, and more\ncomprehensive scrutiny of latent high-risk abnormalities,\nthereby improving reliability and completeness.\nFigure 6 reports the quantitative results of ECG-R1 after SFT training on two datasets. Notably, the two datasets have the\nsame number of training instances and identical ECG samples. The model architecture and hyperparameters are held constant,\nand no RL training is applied. Our ECG Protocol-Guided Grounding CoT consistently outperforms ECG-Grounding across\n17\n"}, {"page": 18, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nall seven metrics. It improves diagnosis accuracy from 74.32 to 79.33 (+5.01) and yields substantially larger gains on\nprocess-oriented dimensions related to interpretability and traceability, with the largest increase in clinical diagnostic fidelity\nfrom 62.98 to 83.51 (+20.53), alongside improvements in evidence-based reasoning from 63.44 to 78.08 (+14.64) and ECG\nfeature grounding from 66.21 to 79.92 (+13.71). Consistent improvements are also observed in analysis completeness from\n4.13 to 6.36 (+2.23), analysis relevance from 3.55 to 4.58 (+1.03), and lead evidence validity from 3.85 to 5.53 (+1.68). The\ngains are driven not only by higher diagnosis accuracy but also by protocolized CoT supervision that strengthens process\nconstraints and evidence alignment during SFT, leading to more verifiable intermediate evidence and clinically faithful\nreasoning without sacrificing final correctness.\nC.2. ECG-Bench Results\nTable 4. ECG-Bench Abnormality Detection Results.\nDatasets\nPTB-XL Super\nCODE-15%\nCPSC 2018\nCSN\nG12EC\nMetric\nAUC\nF1\nHL\nAUC\nF1\nHL\nAUC\nF1\nHL\nACC\nACC\nRandom\n50.3\n33.2\n50.1\n48.8\n15.0\n32.1\n51.2\n15.1\n28.8\n11.6\n12.1\nProprietary MLLMs\nGPT-4o\n55.6\n28.3\n26.2\n59.9\n24.9\n15.7\n50.9\n10.6\n18.2\n57.5\n49.2\nGPT-4o-mini\n52.0\n20.4\n31.7\n57.5\n22.0\n15.1\n49.2\n11.0\n25.5\n32.1\n33.2\nGemini-1.5-Pro\n50.7\n15.3\n27.9\n56.7\n20.0\n15.9\n50.1\n7.4\n20.5\n50.5\n36.0\nClaude-3.5-Sonnet\n54.0\n27.5\n29.6\n58.3\n20.3\n17.8\n52.8\n11.5\n18.9\n51.5\n51.4\nECG-specialized Methods\nMETS\n-\n65.7\n-\n-\n-\n-\n-\n-\n-\nN/A\nN/A\nMERL\n74.2\n-\n-\n-\n-\n-\n82.8\n-\n-\nN/A\nN/A\nST-MEM\n71.4\n-\n-\n-\n-\n-\n70.4\n-\n-\nN/A\nN/A\nPULSE\n82.4\n74.8\n11.0\n90.7\n85.4\n5.0\n76.9\n57.6\n8.6\n85.2\n78.2\nGEM\n83.4\n75.8\n11.0\n91.5\n86.4\n4.7\n79.1\n61.1\n8.1\n86.2\n80.5\nECG-R1(Ours)\n81.7\n73.7\n11.4\n91.4\n86.7\n4.6\n74.9\n51.2\n9.8\n90.4\n84.5\nWe further evaluate ECG-R1 on conventional ECG abnormality detection using ECG-Bench (Liu et al., 2024c), as shown in\nTable 4. We use macro AUC, macro F1, and hamming loss (HL) for multi-label datasets, and accuracy for others. Across all\nfive datasets, proprietary MLLMs exhibit near-random performance, indicating that generic multimodal capabilities are\ninsufficient for accurate ECG abnormality detection. We compare against ECG-specialized methods, where ST-MEM is\na self-supervised ECG model, METS (Li et al., 2024) and MERL (Liu et al., 2024b) are CLIP-like multimodal models,\nPULSE (Liu et al., 2024c), and GEM (Lan et al., 2025) are ECG-oriented MLLMs. Although ECG-R1 is not explicitly\noptimized for abnormality detection, it remains competitive with top-performing approaches, achieving new state of the art\non CSN and G12EC, while showing only marginal gaps to the best methods on the remaining datasets.\nC.3. Ablation Study on Interleaved Modality Dropout\nTable 5. Effect of Interleaved Modality Dropout on Robustness.\nMetric\nDiagnosis Accuracy\nPeak\nPerformance\nTrade-off\nRobustness\nRecovery\nGain\nEfficiency\nRatio\nOmni Modalities\n(Time-Series + Image)\nModality Missing\n(Only Time-Series)\nw/o IMD\n81.99\n36.77\n-\n-\n-\nw/ IMD\n80.29\n77.91\n-1.7\n41.14\n24.2x\nTable 6. Effect of Interleaved Modality Dropout on Consistency.\nMetric\nBLEU-4\nROUGE-L\nSBERT-Score\nw/o IMD\n0.54\n0.59\n0.92\nw/ IMD\n0.69\n0.73\n0.97\n18\n"}, {"page": 19, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nTable 5 studies how enabling Interleaved Modality Dropout (IMD) during training affects robustness. Omni modalities\nrefers to evaluation with both time-series and image inputs, while modality missing refers to evaluation with the image\nmodality completely absent and only time-series signals provided. Without IMD, the model achieves slightly higher peak\naccuracy under omni-modality inputs, but its performance collapses under modality missing, dropping to 36.77. In contrast,\ntraining with IMD maintains strong performance when the image modality is absent, reaching 77.91 in modality missing.\nThis corresponds to a robustness recovery gain of 41.14 with only a modest peak-performance trade-off of 1.7. Overall,\nIMD substantially improves robustness under modality missing conditions while incurring only a minor reduction in omni\nmodality accuracy, resulting in an efficiency ratio of 24.2x, defined as the ratio between robustness recovery gain and\npeak-performance trade-off.\nTable 6 reports the effect of Interleaved Modality Dropout on cross-modality consistency of model interpretations. For each\nsample in the test set, we generate two interpretations, one conditioned on the image modality only and the other conditioned\non the time-series modality only, and compute BLEU-4, ROUGE-L, and SBERT-Score to measure the agreement between\nthe two outputs. We then average these scores over all test samples to obtain the reported results. Without IMD, the\ntwo single-modality interpretations show limited alignment, indicating substantial variability when the available modality\nchanges. Enabling IMD yields higher cross-modality consistency, achieving BLEU-4 of 0.69, ROUGE-L of 0.73, and\nSBERT-Score of 0.97 averaged over the entire test set, demonstrating that IMD promotes more modality-invariant and\nsemantically consistent interpretations.\nOverall, IMD substantially improves both robustness and cross-modality consistency of the model outputs. The empirical\ngains are consistent with our theoretical analysis, suggesting that IMD is a sound training strategy for improving reliability\nunder modality missing conditions.\nC.4. Ablation Study on ECG Diagnostic Evidence Rewards\nTable 7. Effect of EDER on Grounded ECG Interpretation Results.\nMetric\nDiagnosis\nAccuracy\nAnalysis\nCompleteness\nAnalysis\nRelevance\nLead\nEvidence\nValidity\nECG\nFeature\nGrounding\nEvidence\nBased\nReasoning\nClinical\nDiagnostic\nFidelity\nw/o EDER\n79.96\n5.94\n4.30\n4.72\n78.53\n78.14\n83.53\nw/ EDER\n80.29\n6.51\n4.74\n5.81\n80.57\n79.08\n84.20\nFigure 7. Effect of EDER on Mean Output Length and Entropy during RL Training.\nTable 7 summarizes the effect of incorporating ECG Diagnostic Evidence Rewards (EDER) during RL training. EDER\nimproves both terminal diagnosis accuracy and the quality of the generated interpretations, consistently boosting analysis\ncompleteness and relevance, lead evidence validity, ECG feature grounding, evidence-based reasoning, and clinical diagnostic\nfidelity. We provide a deeper analysis of the above results. Figure 7 shows that incorporating EDER substantially alters the\nMLLM’s generation behavior during RL training. Without EDER, the mean rollout length progressively contracts, indicating\nthat when optimization is dominated by terminal diagnostic correctness, the policy can degenerate into a “shorter answer\nyields comparable reward” strategy, thereby omitting key diagnostic evidence statements. With EDER, the rollout length\n19\n"}, {"page": 20, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nremains more stable, suggesting that process-level rewards impose sustained constraints on evidence-driven interpretation,\nmitigating length collapse and encouraging the preservation of salient evidence statements. Regarding uncertainty, with\nEDER the output entropy is generally lower and exhibits smaller fluctuations, implying that EDER provides clearer learning\nsignals that concentrate the generation distribution and promote more consistent decisions, leading to a more stable training\ntrajectory. Conversely, without EDER, entropy remains higher and fluctuates more, suggesting that in the absence of\nevidence-level shaping, policy updates are driven primarily by sparse end-point feedback, resulting in less consistent\ngeneration dynamics and noisier training trajectories. Overall, EDER improves both the completeness of the reasoning\nprocess and the stability of generation, better aligning the learned policy with clinical requirements for interpretable and\nauditable ECG interpretation.\nC.5. Numerical Analysis of the DiagnosisAccuracy Metric Evaluated by GPT-4o and DeepSeek v3.1 Terminus\nOur observations and analyses indicate that the scoring mechanism of GPT-4o is predisposed toward a semantic-relevance-\nbased assessment. It is frequently confounded by secondary information generated by the model—such as accurate heart\nrate or rhythm descriptions—leading to an excessive tolerance for fatal clinical omissions (false negatives) and logically\ninconsistent over-diagnoses (false positives). This “semantic-priority” logic entails significant risk in clinical scenarios.\nConversely, the evaluation logic of DeepSeek v3.1 Terminus manifests as a rigorous clinical audit, prioritizing the accuracy\nof core diagnostic conclusions.\nFurthermore, GPT-4o’s tendency to aggregate multiple diagnostic points into a single score results in a minimal denominator\n(N), leading to significant metric inflation. Under a binary calculation logic where any score greater than 0 is categorized as\ncorrect, even marginal partial credits are amplified into a 100% accuracy rate for the given sample. This masks the model’s\nperformance bottlenecks in complex cases. In contrast, DeepSeek v3.1 Terminus mandates an exhaustive decomposition of\ndiagnostic claims, substantially increasing the evaluation denominator, thereby enhancing both evaluative transparency and\nstatistical discriminability.\nTo further illustrate these systematic discrepancies in evaluation logic and their impact on quantitative outcomes, we present\nthree representative case studies. These cases exemplify the divergent behaviors of GPT-4o and DeepSeek v3.1 Terminus in\nhandling clinical omissions, evaluation granularity, and diagnostic hallucinations:\nSample 45108524\nGPT-4o Evaluation Results:\n• The generated interpretation identifies a normal sinus rhythm correctly but lacks the specific mention of\npotential ischemic or infarct patterns seen in the ground truth. It mostly aligns with the identified rhythm\nbut misses key findings suggestive of ischemia.\n(1.0)\nDeepSeek v3.1 Terminus Evaluation Results:\n• The generated interpretation concludes a ‘normal ECG’ with ‘no evidence of ischemia, infarction, or\nconduction abnormalities.’ This is incorrect and non-specific. The ground truth identifies key, specific\ndiagnoses supported by ECG findings.\n(0.0)\nSample 44425880\nGPT-4o Evaluation Results:\n• The generated interpretation correctly identifies sinus bradycardia (2.0) and an inferior infarct (2.0),\nsupported by the findings of prolonged PR interval and QRS amplitude abnormalities. However, it lacks\nspecificity and clear support for the diagnosis of lateral ischemia.\n(4.0)\nDeepSeek v3.1 Terminus Evaluation Results:\n• Correctly identified sinus bradycardia with supporting heart rate (55 bpm).\n(2.0)\n• Correctly identified borderline first-degree A-V block (214 ms).\n(2.0)\n• Correctly identified inferior infarct with supporting findings (abnormal Q waves).\n(2.0)\n• Identified lateral ischemia but lacked specificity and over-interpreted ST changes in Lead I/aVL as\ndefinitive.\n(1.0)\n• Incorrectly suggested anterior ischemia (V1-V4) without ground truth support.\n(0.0)\n• Incorrectly suggested left main disease from aVR upslope, which was not mentioned in ground truth.\n(0.0)\n20\n"}, {"page": 21, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nSample 43556732\nGPT-4o Evaluation Results:\n• The generated interpretation correctly identifies sinus rhythm with PACs and a first-degree A-V block.\nHowever, the left ventricular hypertrophy and inferior infarct suggestions are less clear.\n(2.0)\n• The interpretation mentioned possible left atrial enlargement and lateral ischemia, which are noted\ninconsistently with ECG features.\n(1.0)\nDeepSeek v3.1 Terminus Evaluation Results:\n• Correctly identified sinus rhythm with PACs and first-degree A-V block, with specific ECG support\n(irregular RR intervals, PR interval of 280 ms).\n(2.0)\n• Diagnosis of ‘inferior infarct’ is incorrect and over-interprets findings.\n(0.0)\n• Diagnosis of ‘lateral ischemia’ is vague and not supported by ground truth.\n(0.0)\n• Diagnosis of ‘left main coronary artery disease’ based on aVR is incorrect.\n(0.0)\nIn medical research and clinical decision support systems, lenience in assessment tools often equates to the condoning of\nmedical risks. Therefore, utilizing DeepSeek v3.1 Terminus as the evaluative model provides a benchmark with superior\nclinical reference value and statistical power for medical LLMs. This explains why, despite lower absolute values in the\nDiagnosisAccuracy metric, the evaluative quality provided by DeepSeek v3.1 Terminus is far superior to that of GPT-4o.\n21\n"}, {"page": 22, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nD. Complete Proofs for Section 2.4\nNotation.\nLet x = (xtext, xI, xT ) be the multimodal input and y the output text sequence. For a transformation τ (dropping\na modality or swapping modality-token blocks), define the environment-specific observation\nzτ ≜τ(x),\nand the induced model distribution\nP τ\nθ (· | x) ≜Pθ(· | zτ) = Pθ(· | τ(x)).\nWe train with negative log-likelihood (NLL)\nℓθ(τ(x), y) ≜−log Pθ(y | τ(x)).\nThe population risk in environment τ is\nRτ(θ) ≜E(x,y)∼D\n\u0002\nℓθ(τ(x), y)\n\u0003\n= Ex∼DEy∼P ⋆(·|τ(x))\n\u0002\n−log Pθ(y | τ(x))\n\u0003\n,\n(7)\nwhere P ⋆(· | τ(x)) denotes the ground-truth conditional distribution of y given the observation zτ = τ(x). For IMD, we\nconsider the finite set\nTtest = {τI, τT , τIT , τT I}.\nIMD samples τ ∼q over Ttest via two independent trials: (i) a modality-drop trial with probability pd; and (ii) conditioned\non retaining both modalities, a token-order swap trial with probability ps. Concretely,\nq(τI) = q(τT ) = pd\n2 ,\nq(τT I) = (1 −pd)(1 −ps),\nq(τIT ) = (1 −pd)ps,\nwhere τI, τT drop one modality and τT I, τIT correspond to the canonical and swapped token-block orders, respectively. We\nchoose pd ∈(0, 1) and ps ∈(0, 1) so that q(τ) > 0 for all τ ∈Ttest. Therefore, Assumption 2.1 holds with\nα = min\nnpd\n2 , (1 −pd)(1 −ps), (1 −pd)ps\no\n.\nThe mixture risk under sampling distribution q is\nRq(θ) ≜Eτ∼q\n\u0002\nRτ(θ)\n\u0003\n.\n(8)\nWe also define the mixture Bayes risk ¯R⋆\nq ≜Eτ∼q[R⋆\nτ].\nBayes-optimal risks and excess risks.\nDefine the Bayes-optimal (unconstrained) risk for each environment:\nR⋆\nτ ≜inf\nQ(·|z) Ex∼DEy∼P ⋆(·|τ(x))\n\u0002\n−log Q\n\u0000y | z\n\u0001\u0003\f\f\f\nz=τ(x) = Ex∼DH\n\u0000P ⋆(· | τ(x))\n\u0001\n,\n(9)\nwhere the infimum is over all conditional distributions Q(· | z) defined on the environment observation z = τ(x).\nWe define the excess risk of model θ in environment τ as\nετ(θ) ≜Rτ(θ) −R⋆\nτ.\n(10)\nFor the single-modality environments, we also define the intrinsic view gap\n∆view ≜Ex∼D\nh\nTV\n\u0000P ⋆\nτI(· | x), P ⋆\nτT (· | x)\n\u0001i\n,\n(11)\nwhich can be non-zero due to information disparity between modalities.\n22\n"}, {"page": 23, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nD.1. Auxiliary Lemmas\nLemma D.1 (Cross-entropy decomposition). For any conditional distributions P ⋆(· | x) and Q(· | x),\nEy∼P ⋆(·|x)[−log Q(y | x)] = H(P ⋆(· | x)) + DKL\n\u0000P ⋆(· | x) ∥Q(· | x)\n\u0001\n.\nConsequently, for each environment τ,\nRτ(θ) = R⋆\nτ + Ex∼D\nh\nDKL\n\u0000P ⋆\nτ (· | x) ∥P τ\nθ (· | x)\n\u0001i\n,\nand hence\nετ(θ) = ExDKL\n\u0000P ⋆\nτ ∥P τ\nθ\n\u0001\n.\n(12)\nProof. The identity is standard: cross-entropy equals entropy plus KL divergence. Taking expectation over x ∼D\nand substituting Q = P τ\nθ yields the first equality. By definition of R⋆\nτ in (9), R⋆\nτ = ExH(P ⋆\nτ (· | x)). Subtracting\ncompletes (12).\nLemma D.2 (Pinsker’s inequality). For any distributions P, Q,\nTV(P, Q) ≤\nq\n1\n2DKL(P∥Q).\nLemma D.3 (Jensen for square root). For any nonnegative random variable Z, E[\n√\nZ] ≤\np\nE[Z].\nD.2. Proof of Robustness Theorem\nTheorem (Robustness under IMD).\nAssume Coverage: there exists α > 0 such that q(τ) ≥α for all τ ∈Ttest. Define\nRmax(θ) ≜max\nτ∈Ttest Rτ(θ).\nThen\nRmax(θ) ≤α−1Rq(θ).\n(13)\nProof.\nLet τ ⋆∈arg maxτ∈Ttest Rτ(θ) so that Rmax(θ) = Rτ ⋆(θ). By the definition of mixture risk (8),\nRq(θ) = Eτ∼q[Rτ(θ)] ≥q(τ ⋆) Rτ ⋆(θ) ≥α Rmax(θ),\nwhich implies (13).\nD.3. Proof of Consistency and Swap-Invariance Theorem\nDefinitions (consistency metrics).\nFor the single-modality views, define\nF(θ) ≜Ex∼D TV\n\u0000P τI\nθ (· | x), P τT\nθ (· | x)\n\u0001\n.\nFor interleaving (block-swap) invariance, define\nFswap(θ) ≜Ex∼D TV\n\u0000P τIT\nθ\n(· | x), P τT I\nθ\n(· | x)\n\u0001\n.\nOptionally, one may also define an intrinsic swap gap ∆swap ≜ExTV(P ⋆\nτIT (· | x), P ⋆\nτT I(· | x)), which is typically 0 when\nonly the token block order changes the input representation.\nTheorem (Consistency via excess risk).\nFor any θ,\nF(θ) ≤∆view +\np\nετI(θ)/2 +\np\nετT (θ)/2,\n(14)\nFswap(θ) ≤∆swap +\np\nετIT (θ)/2 +\np\nετT I(θ)/2.\n(15)\nMoreover, letting ¯R⋆\nq ≜Eτ∼q[R⋆\nτ], for any τ,\nRq(θ) −¯R⋆\nq ≥q(τ) ετ(θ),\nhence under Coverage (q(τ) ≥α) we have Rq(θ) −¯R⋆\nq ≥α ετ(θ).\n(16)\n23\n"}, {"page": 24, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nProof of (14).\nFix any x and abbreviate P θ\nI (·)=P τI\nθ (· | x), P θ\nT (·)=P τT\nθ (· | x), P ⋆\nI (·)=P ⋆\nτI(· | x), P ⋆\nT (·)=P ⋆\nτT (· | x).\nBy triangle inequality for total variation,\nTV(P θ\nI , P θ\nT ) ≤TV(P θ\nI , P ⋆\nI ) + TV(P ⋆\nI , P ⋆\nT ) + TV(P ⋆\nT , P θ\nT ).\n(17)\nTaking expectation over x ∼D gives\nF(θ) ≤∆view + ExTV(P τI\nθ (· | x), P ⋆\nτI(· | x)) + ExTV(P ⋆\nτT (· | x), P τT\nθ (· | x)).\n(18)\nApply Pinsker’s inequality (Lemma D.2) to the two TV terms:\nTV(P ⋆\nI , P θ\nI ) ≤\nq\n1\n2DKL(P ⋆\nI ∥P θ\nI ),\nTV(P ⋆\nT , P θ\nT ) ≤\nq\n1\n2DKL(P ⋆\nT ∥P θ\nT ).\nTaking expectation and applying Jensen (Lemma D.3) yields\nExTV(P ⋆\nI , P θ\nI ) ≤\nq\n1\n2ExDKL(P ⋆τI(· | x)∥P τI\nθ (· | x)),\n(19)\nExTV(P ⋆\nT , P θ\nT ) ≤\nq\n1\n2ExDKL(P ⋆τT (· | x)∥P τT\nθ (· | x)).\n(20)\nFinally, by Lemma D.1 (Eq. (12)),\nExDKL(P ⋆\nτI∥P τI\nθ ) = ετI(θ),\nExDKL(P ⋆\nτT ∥P τT\nθ ) = ετT (θ).\nSubstituting into (18) proves (14).\nProof of (15).\nThe proof is identical to the view case, replacing (τI, τT ) with (τIT , τT I) and ∆view with ∆swap.\nProof of mixture dominance (16).\nBy definitions,\nRq(θ) −¯R⋆\nq = Eτ∼q[Rτ(θ)] −Eτ∼q[R⋆\nτ] = Eτ∼q\n\u0002\nRτ(θ) −R⋆\nτ\n\u0003\n= Eτ∼q\n\u0002\nετ(θ)\n\u0003\n.\nSince ετ(θ) ≥0, for any fixed τ0,\nEτ∼q[ετ(θ)] ≥q(τ0) ετ0(θ),\nwhich gives the first inequality in (16). If additionally q(τ0) ≥α, then Rq(θ) −¯R⋆\nq ≥α ετ0(θ).\nD.4. Remarks on Using infθ Rτ(θ)\nRemark.\nIn the main text, one may write R⋆\nτ = infθ Rτ(θ) for notational simplicity. The identities in Lemma D.1 and\nEq. (12) hold exactly for the Bayes-optimal risk defined in (9). If the model family is expressive enough to realize P ⋆\nτ (· | x)\n(for each τ ∈Ttest), then infθ Rτ(θ) = R⋆\nτ and all bounds remain unchanged. Otherwise, one can interpret ετ(θ) as excess\nrisk over the Bayes-optimal predictor; replacing it by Rτ(θ) −infθ Rτ(θ) introduces an additional approximation term that\nis standard in statistical learning.\n24\n"}, {"page": 25, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nE. Case Study\nE.1. Inference Results\nCase Study: 41106347\nFigure 8. Report: Sinus rhythm with PACs; Left axis deviation; RBBB with left anterior fascicular block; Abnormal ECG.\nGEM Interpretation\nUpon analyzing the provided ECG image and computed measurements, several key features and abnormalities are\nevident. The rhythm is sinus with occasional premature atrial contractions (PACs), as indicated by irregular RR\nintervals, particularly the shorter intervals such as 238 ms and 241 ms. The heart rate is 68 bpm, which is within\nnormal limits. The presence of left axis deviation is suggested by the negative QRS complex in lead aVF and positive\nin lead I. The QRS duration is prolonged, particularly in leads I and V1, with durations reaching up to 150 ms,\nindicating a right bundle branch block (RBBB). Additionally, the left anterior fascicular block is suggested by the left\naxis deviation and the presence of a small R wave in lead I.\nInferior infarction is indicated by abnormal Q waves and ST segment changes in leads II, III, and aVF. The QRS\namplitude is notably reduced in these leads, and the ST segment shows a declination form, which is consistent with\nischemic changes. The anterior leads, particularly V2 to V4, show some ST segment elevation, which could suggest\nan anterior myocardial infarction. However, the lack of significant Q waves in these leads makes it less definitive.\nOverall, the ECG findings are consistent with a diagnosis of sinus rhythm with PACs, left axis deviation, RBBB with\nleft anterior fascicular block, and evidence of an inferior infarct. The anterior ST elevation is suggestive of possible\nmyocardial injury, but further clinical correlation and possibly additional testing would be necessary to confirm this.\nThe ECG is abnormal, and these findings warrant further investigation and clinical management.\n25\n"}, {"page": 26, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nECG-R1 Interpretation\n<think>\nStep 1: Technical, Rate & Rhythm\nThe ECG demonstrates good technical quality with a stable baseline, standard 25 mm/s speed, and 10 mm/mV\ncalibration, with no evidence of lead reversal as P waves are upright in lead I. The rhythm is sinus with a rate of 66\nbpm, confirmed by the presence of upright P waves in leads II, III, and aVF. The rhythm is occasionally irregular,\nwith intermittent premature beats characterized by an early, abnormal P wave morphology and a compensatory pause,\nconsistent with premature atrial contractions (PACs); the absence of an irregularly irregular rhythm without P waves\nrules out atrial fibrillation.\nStep 2: Conduction, Axis & Intervals\nThe frontal plane axis demonstrates left axis deviation, evidenced by a positive QRS complex in lead I and a negative\nQRS complex in lead II. The PR interval is within normal limits at approximately 160 ms, ruling out AV block. The\nQRS duration is prolonged at 120 ms, and an rSR’ pattern is present in lead V1 with a wide, slurred S wave in leads\nI and V6, confirming a right bundle branch block (RBBB). The combination of left axis deviation with RBBB is\nindicative of a bifascicular block involving the right bundle and the left anterior fascicle.\nStep 3: Chamber Hypertrophy & Voltage\nThere is no evidence of left ventricular hypertrophy, as the S wave in V1 and R wave in V6 do not meet the\nSokolow-Lyon voltage criteria. R wave progression across the precordial leads V1 to V4 is normal, with a transition\nzone around V3-V4, which rules out conditions like poor R wave progression or reversed progression suggestive of\nright ventricular hypertrophy or posterior infarction.\nStep 4: Ischemia, Infarction & Mimics\nA systematic analysis of all lead groups reveals no acute ischemic changes. There is no significant ST-segment\nelevation or depression meeting threshold criteria in the inferior (II, III, aVF), lateral (I, aVL, V5, V6), or anterior\n(V1-V4) leads. The ST segments are predominantly isoelectric or show non-specific, minimal deviations. No\npathologic Q waves are present in any territory. The T waves are appropriately discordant to the QRS complex in\nleads with RBBB (V1-V2), which is a normal finding and not indicative of ischemia.\nStep 5: Electrolytes & QT\nThe T wave morphology is normal without evidence of tenting suggestive of hyperkalemia or flattening with U waves\nsuggestive of hypokalemia. The corrected QT interval (QTc) is within normal limits, calculated at approximately 440\nms, ruling out significant QT prolongation.\nStep 6: Final Medical Reasoning\nThe ECG findings are consistent with a sinus rhythm with occasional PACs, a bifascicular block pattern comprising\nright bundle branch block and left anterior fascicular block, and no evidence of acute ischemia, infarction, or\nelectrolyte disturbance. The overall tracing is abnormal due to the conduction delays.\n</think>\nThis ECG demonstrates sinus rhythm at 66 bpm with occasional premature atrial contractions. The conduction\nsystem shows a bifascicular block pattern, characterized by a right bundle branch block with a QRS duration of 120\nms and left axis deviation, consistent with concomitant left anterior fascicular block. There is no evidence of chamber\nhypertrophy, acute ischemic ST-T wave changes, pathologic Q waves, or electrolyte abnormalities. The corrected QT\ninterval is normal. The tracing is abnormal due to the identified conduction delays.\n<answer>Sinus rhythm with PAC(s); Left axis deviation; RBBB with left anterior fascicular block; Abnormal\nECG</answer>\n26\n"}, {"page": 27, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nCase Study: 48410813\nFigure 9. Report: Atrial fibrillation with rapid ventricular response with PVC(s); Left axis deviation; RBBB with left anterior\nfascicular block; Lateral ST-T changes may be due to myocardial ischemia; Abnormal ECG.\nGEM Interpretation\nUpon analyzing the provided ECG image and computed measurements, several key features and abnormalities\nare evident. The heart rate is elevated at 120 bpm, indicating sinus tachycardia. The presence of premature atrial\ncontractions (PACs) is suggested by irregular RR intervals, particularly the shorter intervals such as 188 ms and 203\nms. The ECG also reveals a left axis deviation, which is supported by the negative QRS complex in lead aVF and\npositive in lead I. The QRS duration is prolonged in several leads, notably in lead I with durations up to 158 ms,\nindicating a right bundle branch block (RBBB) with left anterior fascicular block. This is further corroborated by the\npresence of a small R wave in lead V1 and a broad S wave in lead I.\nAdditionally, the ECG shows signs of left ventricular hypertrophy, as suggested by the increased QRS amplitude in\nleads V5 and V6, with values reaching up to 1.7 mV. The lateral ST-T changes, particularly in leads I, aVL, V5, and\nV6, are likely due to ventricular hypertrophy, as indicated by the ST segment declination and T wave inversion. These\nfindings collectively suggest an abnormal ECG with multiple underlying cardiac conditions. The combination of\nsinus tachycardia, PACs, left axis deviation, RBBB with left anterior fascicular block, and left ventricular hypertrophy,\nalong with lateral ST-T changes, provides a comprehensive picture of the patient’s cardiac status. This analysis is\nconsistent with the observed ECG features and computed measurements, supporting a diagnosis of an abnormal ECG\nwith multiple cardiac abnormalities.\n27\n"}, {"page": 28, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nECG-R1 Interpretation\n<think>\nStep 1: Technical, Rate & Rhythm\nThe ECG demonstrates an irregularly irregular rhythm with a mean ventricular rate of 118 bpm, consistent with\ntachycardia. There is an absence of discernible, organized P waves across all leads, including Lead II and V1, which\nrules out sinus rhythm and confirms the diagnosis of atrial fibrillation. The baseline shows some undulation but\nis otherwise stable without significant artifact, and the calibration is standard at 25 mm/s and 10 mm/mV, with no\nevidence of limb lead reversal as P waves are not present to assess.\nStep 2: Conduction, Axis & Intervals\nThe frontal plane axis demonstrates left axis deviation, evidenced by a positive QRS complex in Lead I and a negative\nQRS complex in Lead II. The QRS duration is prolonged at 120-130 ms, and an rSR’ pattern is present in Lead V1\nwith a wide, slurred S wave in Leads I and V6, confirming a right bundle branch block (RBBB). The combination of\nleft axis deviation with RBBB is indicative of a concomitant left anterior fascicular block. The PR interval is not\nmeasurable due to the underlying atrial fibrillation.\nStep 3: Chamber Hypertrophy & Voltage\nThere is evidence of left ventricular hypertrophy based on voltage criteria, with an R wave amplitude in Lead aVL\nmeasuring up to 1.34 mV, which exceeds the 11 mm threshold. The S wave in V1 and R wave in V6 also sum to a\nvoltage supportive of LVH. R wave progression across the precordial leads V1 to V4 is normal, ruling out poor R\nwave progression. There is no evidence of right ventricular hypertrophy.\nStep 4: Ischemia, Infarction & Mimics\nA systematic scan reveals no evidence of acute ischemia or infarction. There are no pathologic Q waves in the\ninferior (II, III, aVF), lateral (I, aVL, V5, V6), or anterior (V1-V4) leads. The ST segments are isoelectric without\nsignificant elevation or depression in any contiguous lead groups, ruling out STEMI, pericarditis, and non-STEMI.\nThe T waves in the lateral leads (V5, V6) are inverted, which is a secondary repolarization abnormality consistent\nwith the underlying RBBB and LVH rather than primary ischemia.\nStep 5: Electrolytes & QT\nThe QT interval is variable due to the irregular rhythm, but the calculated QTc intervals are within normal limits,\nnot suggesting prolonged QT syndrome. The T waves are not characteristically tented to suggest hyperkalemia, and\nthere are no prominent U waves to indicate hypokalemia. The T-wave morphology is consistent with the secondary\nchanges from the conduction abnormality.\nStep 6: Final Medical Reasoning\nThe ECG findings are consistent with atrial fibrillation with a rapid ventricular response, a right bundle branch block\nwith left anterior fascicular block causing the observed left axis deviation, and left ventricular hypertrophy. The lateral\nST-T changes are secondary to the conduction delay and hypertrophy. There is no electrocardiographic evidence of\nacute coronary syndrome.\n</think>\nThis ECG demonstrates atrial fibrillation with a rapid ventricular response at 118 bpm, characterized by an irregularly\nirregular rhythm and absence of P waves. The conduction system shows a right bundle branch block pattern in V1\nwith a wide QRS duration, combined with left axis deviation indicative of a left anterior fascicular block. Voltage\ncriteria in lead aVL and the precordial leads satisfy the diagnosis of left ventricular hypertrophy. Repolarization\nabnormalities in the lateral leads are secondary to the conduction delay and hypertrophy. There is no evidence of\nacute ischemia, infarction, or electrolyte imbalance.\n<answer>Atrial fibrillation with rapid ventricular response; Left axis deviation; RBBB with left anterior fascicular\nblock; Left ventricular hypertrophy; Lateral ST-T changes are probably due to ventricular hypertrophy; Abnormal\nECG</answer>\n28\n"}, {"page": 29, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nCase Study: 44950228\nFigure 10. Report: Sinus rhythm; Left anterior fascicular block; Left ventricular hypertrophy; Abnormal ECG.\nGEM Interpretation\nUpon analyzing the provided ECG image and computed measurements, several key features and abnormalities are\nevident. The rhythm is sinus, as indicated by the consistent P wave morphology across leads and a regular heart rate\nof 66 bpm. A notable finding is the left anterior fascicular block, which is suggested by the left axis deviation and the\nQRS complex morphology in leads I and aVL. The QRS duration is prolonged in some leads, particularly in lead I,\nwhich supports this diagnosis.\nIn leads V2 to V4, there are indications of a possible anterior infarct. This is suggested by the presence of abnormal\nQ waves and changes in the ST segment and T wave morphology, which are consistent with anterior myocardial\ninfarction. The QRS amplitude in these leads is notably reduced, further supporting this finding.\nAdditionally, the ECG shows nonspecific T wave changes in the lateral leads, particularly in leads I, aVL, V5, and\nV6. These changes are characterized by variations in T wave amplitude and morphology, which do not fit a specific\npattern but are indicative of some form of cardiac stress or ischemia.\nOverall, the ECG findings are consistent with a sinus rhythm, left anterior fascicular block, possible anterior infarct,\nand nonspecific lateral T wave changes. These findings collectively suggest an abnormal ECG, warranting further\nclinical correlation and possibly additional diagnostic testing to confirm the presence and extent of any myocardial\ndamage.\n29\n"}, {"page": 30, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nECG-R1 Interpretation\n<think>\nStep 1: Technical, Rate & Rhythm\nThe ECG demonstrates good technical quality with a stable baseline, standard 25 mm/s speed, and 10 mm/mV\ncalibration, with no evidence of lead reversal as P waves are upright in lead I. The heart rate is 62 bpm, indicating\nnormal sinus rhythm. P waves are present and positive in leads II, III, and aVF, confirming a sinus mechanism. The\nrhythm is regular, ruling out atrial fibrillation or flutter. P wave morphology in lead II is normal in duration and\namplitude, showing no evidence of right or left atrial abnormality.\nStep 2: Conduction, Axis & Intervals\nThe frontal plane axis demonstrates left axis deviation, with a positive QRS complex in lead I and a negative\nQRS complex in lead II, consistent with left anterior fascicular block. The PR interval is within normal limits at\napproximately 180 ms, ruling out AV block or pre-excitation syndromes. The QRS duration is normal at less than\n100 ms, which rules out bundle branch blocks. There is no evidence of an rSR’ pattern in V1 or a wide slurred S\nwave in V6 to suggest a conduction delay.\nStep 3: Chamber Hypertrophy & Voltage\nThere is evidence of left ventricular hypertrophy based on voltage criteria, with an R wave amplitude in lead aVL\nmeasuring greater than 11 mm. The S wave in V1 and R wave in V6 also sum to a voltage exceeding 35 mm, further\nsupporting this finding. R wave progression across the precordial leads V1 to V4 is normal, with no evidence of poor\nR wave progression or reversed progression to suggest right ventricular hypertrophy or posterior infarction.\nStep 4: Ischemia, Infarction & Mimics\nA systematic analysis of all lead groups reveals no acute ischemic changes. There is no significant ST segment\nelevation or depression meeting threshold criteria in the inferior (II, III, aVF), lateral (I, aVL, V5, V6), or anterior\n(V1-V4) leads. There are no pathologic Q waves present. The ST segments are predominantly isoelectric or show\nnon-specific, mild upsloping. Lead aVR shows no significant ST elevation to suggest left main disease. The T waves\nare appropriately concordant with the QRS complex in most leads.\nStep 5: Electrolytes & QT\nThe QT interval is within normal limits, with a QTc calculated to be approximately 420 ms, which is below the 440\nms threshold. The T wave morphology is normal without evidence of tenting suggestive of hyperkalemia or flattening\nand U waves suggestive of hypokalemia. The T waves in the precordial leads are of normal configuration.\nStep 6: Final Medical Reasoning\nThe ECG is abnormal, with the primary findings being sinus rhythm, left anterior fascicular block, and left ventricular\nhypertrophy by voltage criteria. The absence of ST-T wave changes indicative of acute ischemia, pathologic Q waves,\nor conduction delays beyond the fascicular block supports a chronic, non-ischemic etiology for the hypertrophy. The\nnormal QT interval and T wave morphology rule out significant electrolyte disturbances.\n</think>\nThis ECG demonstrates normal sinus rhythm at 62 bpm with good technical quality. The primary abnormalities\nare a left axis deviation consistent with a left anterior fascicular block and voltage criteria meeting the diagnosis of\nleft ventricular hypertrophy. There is no evidence of acute ischemia, infarction, or significant conduction disease\nbeyond the fascicular block. The QT interval is normal, and there are no T wave morphologies to suggest electrolyte\nimbalance. The overall impression is an abnormal ECG due to the fascicular block and left ventricular hypertrophy.\n<answer>Sinus rhythm; Left anterior fascicular block; Left ventricular hypertrophy by voltage only; Abnormal\nECG</answer>\n30\n"}, {"page": 31, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nCase Study: 47746237\nFigure 11. Report: Sinus rhythm; Ventricular bigeminy; Probable left atrial enlargement; Prolonged QT interval.\nGEM Interpretation\nUpon analyzing the provided ECG image and computed measurements, several key features and abnormalities are\nevident. The rhythm is sinus, as indicated by the presence of consistent P waves preceding each QRS complex.\nHowever, there are multiple ventricular premature complexes (VPCs) observed, which are characterized by their\npremature occurrence and abnormal QRS morphology. The QRS complexes in leads I and II show increased\namplitude, suggesting left ventricular hypertrophy (LVH). This is further supported by the increased QRS duration in\nthese leads, which is a common finding in LVH. Additionally, the presence of secondary repolarization abnormalities\nis noted, which can be seen as ST segment changes and T wave inversions in leads I, II, and V5-V6. These changes\nare often associated with LVH and can indicate strain patterns.\nIn lead V1, the QRS complexes are notably absent, which is unusual and may suggest a technical issue or a significant\nconduction abnormality. The QTc intervals are prolonged in several leads, which can be a concern for arrhythmogenic\npotential. The ST segment morphology in leads V2-V4 shows a declination pattern, which is not typical for ischemia\nbut can be seen in LVH. The overall heart rate is 72 bpm, which is within normal limits, but the variability in RR\nintervals suggests the presence of ectopic beats.\nIn conclusion, the ECG findings are consistent with sinus rhythm, multiple ventricular premature complexes, and\nleft ventricular hypertrophy with secondary repolarization abnormalities. The absence of QRS complexes in V1 and\nthe prolonged QTc intervals are notable findings that warrant further clinical correlation and possibly additional\ndiagnostic testing to rule out any underlying cardiac conditions.\n31\n"}, {"page": 32, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nECG-R1 Interpretation\n<think>\nStep 1: Technical, Rate & Rhythm\nThe ECG demonstrates good technical quality with a stable baseline, standard 25 mm/s speed, and 10 mm/mV\ncalibration, with no evidence of lead reversal as P waves are upright in lead I. The rhythm is sinus, confirmed by\nthe presence of upright P waves in leads II, III, and aVF, and inverted P waves in aVR. The average heart rate is 67\nbpm, which is within the normal range. However, the rhythm is irregular due to the presence of ventricular bigeminy,\ncharacterized by alternating normal sinus beats and premature ventricular complexes (PVCs) that are wide and bizarre\nin morphology, as seen in the irregular RR intervals and the absence of preceding P waves in the premature beats.\nStep 2: Conduction, Axis & Intervals\nThe frontal plane axis is normal, as evidenced by positive QRS complexes in both leads I and II. The PR interval\nis within normal limits at approximately 160 ms, ruling out AV block. The QRS duration is predominantly narrow\n(< 100 ms) in the sinus beats, but is significantly prolonged (> 140 ms) during the PVCs, confirming their ventricular\norigin. There is no evidence of a bundle branch block pattern in the conducted sinus beats, as the QRS morphology in\nV1 and V6 is normal.\nStep 3: Chamber Hypertrophy & Voltage\nThere is no evidence of left ventricular hypertrophy, as the Sokolow-Lyon criterion (SV1 + RV6) is not met, with\nlow voltage observed in the precordial leads. Similarly, right ventricular hypertrophy is ruled out by the absence\nof a dominant R wave in V1. R-wave progression from V1 to V4 is normal, with a transition zone around V3-V4,\nindicating no significant conduction delay or poor R-wave progression.\nStep 4: Ischemia, Infarction & Mimics\nA systematic analysis of all lead groups reveals no evidence of acute ischemia or infarction. There are no significant\nST-segment elevations or depressions meeting diagnostic thresholds in the inferior (II, III, aVF), lateral (I, aVL,\nV5, V6), or anterior (V1-V4) leads. The ST segments are predominantly isoelectric or show non-specific, minimal\ndeviations. No pathologic Q waves are present in any territory. Lead aVR shows no significant ST elevation to\nsuggest left main disease.\nStep 5: Electrolytes & QT\nThe T-wave morphology is normal without evidence of tenting suggestive of hyperkalemia or flattening with U waves\nsuggestive of hypokalemia. The QT interval is within normal limits, with a calculated QTc of approximately 440 ms,\nruling out significant QT prolongation.\nStep 6: Final Medical Reasoning\nThe ECG is abnormal due to the presence of ventricular bigeminy. The underlying rhythm is normal sinus rhythm.\nThere is no evidence of acute coronary syndrome, chamber hypertrophy, conduction abnormalities, or electrolyte\ndisturbances. The primary finding is the ventricular ectopy.\n</think>\nThis electrocardiogram shows a normal sinus rhythm at 67 beats per minute with good technical quality. The\nrhythm is irregular due to the presence of ventricular bigeminy, characterized by alternating normal sinus beats\nand premature ventricular complexes. The electrical axis is normal, and conduction intervals are within normal\nlimits for the conducted beats, with no evidence of bundle branch block. Voltage criteria for ventricular hypertrophy\nare not met, and R-wave progression across the precordium is normal. There are no ST-segment elevations or\ndepressions indicative of acute ischemia, and no pathologic Q waves are present. The QT interval is normal, and\nT-wave morphology does not suggest an electrolyte abnormality. The primary abnormality is the ventricular ectopy.\n<answer>Sinus rhythm; Ventricular bigeminy</answer>\n32\n"}, {"page": 33, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nE.2. Case Study Discussion\nAs illustrated in Figure 8, both models identify the underlying RBBB and LAFB, but GEM misinterprets secondary\nrepolarization abnormalities including discordant T-wave inversions and positional Q-wave variances as acute inferior\nand anterior ischemia. This confusion between baseline conduction-related changes and acute pathology results in a\nmisdiagnosis of myocardial infarction. Conversely, ECG-R1 correctly attributes these ST-T changes to the altered ventricular\ndepolarization sequences inherent to a bifascicular block. By recognizing that the T-wave morphology is appropriately\ndiscordant to the terminal QRS vectors and that the axis shift accounts for the inferior lead morphology, ECG-R1 distinguishes\nthese expected physiological sequelae from primary ischemic events.\nAs illustrated in Figure 9, GEM exhibits a fundamental diagnostic failure by misidentifying the irregularly irregular rhythm\nas sinus tachycardia with PACs, failing to recognize the hallmark absence of P waves in atrial fibrillation. While ECG-R1\ndemonstrates superior rhythm interpretation and precise localization of the bifascicular block and hypertrophy, it fails to\ncapture the PVCs specified in the ground truth. Furthermore, both models tend to attribute lateral ST-T changes solely\nto secondary repolarization abnormalities, whereas the ground truth indicates they may stem from myocardial ischemia.\nGEM’s inability to distinguish between organized sinus activity and fibrillatory waves results in a critical misdiagnosis of\nthe primary cardiac rhythm and a failure to identify the potential ischemic risks.\nAs illustrated in Figure 10, both models identify the underlying sinus rhythm and LAFB, but GEM misinterprets the\nhigh-voltage QRS complexes and non-specific ST-T variations as indicative of anterior myocardial infarction and lateral\nischemia. This confusion between the morphological consequences of left ventricular hypertrophy and acute ischemic\ninjury leads to a misdiagnosis of infarction. Conversely, ECG-R1 accurately distinguishes the voltage-based criteria for\nhypertrophy from primary ischemic patterns by noting the absence of pathologic Q waves and significant ST-segment\ndeviations. By maintaining a systematic exclusion of infarction mimics, ECG-R1 achieves a precise diagnosis that mirrors\nthe ground truth whereas GEM fails to differentiate secondary hypertrophy-related changes from acute pathology.\nAs illustrated in Figure 11, ventricular bigeminy represents an edge case as the specific diagnostic criteria for this pattern\nare not defined within the provided protocol. ECG-R1 derives this diagnosis by characterizing the rhythm as irregular and\nidentifying the alternating sequence between normal sinus beats and wide, bizarre PVCs. According to its analysis, the\nmodel identifies the absence of preceding P-waves in the premature beats and the significantly prolonged QRS duration\n(> 140 ms) during these ectopic events to synthesize the bigeminy diagnosis. Conversely, GEM provides a technically\ninaccurate interpretation by hallucinating the complete absence of QRS complexes in lead V1 and misdiagnosing left\nventricular hypertrophy based on erroneous voltage readings, failing to recognize the structured nature of the underlying\narrhythmia.\n33\n"}, {"page": 34, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nF. Prompts\nF.1. Corpus Construction\nProtocol-Guided Diagnosis Guider\nIMPORTANT SYSTEM INSTRUCTION:\nThis is a synthetic output generation task.\nThe ECG image mentioned in the instructions is a placeholder.\nYou must NOT state that the ECG image is missing, unavailable, or not visible.\nYou must assume that the ECG image and machine measurements are fully available, even\nif not shown in the prompt.\nYou must directly produce the required structured output exactly following the template.\nNever mention the absence of visual input or ask for the missing ECG image.\nNever include any disclaimers.\n# Your task: Interpret the provided ECG image using the \"Standardized Clinical Protocol\n\". You must Identify key abnormalities AND explicitly rule out differential\ndiagnoses based on evidence.\n## Standardized Clinical Protocol (The \"17 Steps\" Reference)\nUse these thresholds to CONFIRM diagnoses, RULE OUT conditions based on normality, and\nDIFFERENTIATE based on specific patterns.\n### PHASE 1: TECHNICAL QA, RATE & RHYTHM\n* Quality Assurance\n- Artifacts: Check baseline stability.\n- Speed: Confirm standard 25 mm/s.\n- Calibration: Confirm standard 10 mm/mV.\n- Lead Reversal: If P, QRS, & T are inverted in Lead I, suspect arm lead reversal (vs.\nDextrocardia).\n* Rate\n- Bradycardia: < 60 bpm.\n- Normal: 60-100 bpm.\n- Tachycardia: > 100 bpm.\n* Rhythm Diagnosis\n- Sinus Rhythm: P waves positive in II, III, aVF; negative in aVR.\n- Irregularly Irregular: Atrial Fibrillation (No P waves).\n- Occasionally Irregular: Atrial Flutter or Ectopic beats.\n- Grouped Beating: AV Blocks (Mobitz I).\n* P Wave Morphology\n- Normal: Lead II < 0.12s width & < 2.5mm height.\n- Right Atrial Abnormality (RAA): Peaked P (> 2.5 mm) in Lead II.\n- Left Atrial Abnormality (LAA): Notched P (> 0.12 s) in Lead II OR Deep terminal\nnegative force in V1.\n### PHASE 2: AXIS, CONDUCTION & INTERVALS\n* Frontal Plane Axis\n- Normal (-30 degrees to +90 degrees): Lead I (+) AND Lead II (+).\n- Left Axis Deviation (LAD): Lead I (+) AND Lead II (-).\n* Differentiation: If Lead II is equiphasic, axis is -30 degrees (Normal). If\nnegative, True LAD.\n* Causes: LAH (rS in II, III, aVF), LVH, LBBB, Inferior MI.\n- Right Axis Deviation (RAD): Lead I (-) AND Lead aVF (+).\n* Causes: LPH (rS in I, aVL), RVH, Lateral MI.\n* PR Interval\n- Normal: 0.12-0.20 s.\n- Short (< 0.12 s): WPW (Delta wave), Low atrial rhythm, Upper AV junctional rhythm.\n- Prolonged (> 0.20 s): AV Block I, II, or III.\n* QRS Duration\n- Normal: < 0.10 s.\n- Intermediate (0.10-0.12 s): Incomplete BBB.\n34\n"}, {"page": 35, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\n- Wide (> 0.12 s): RBBB (rSR’ in V1) or LBBB (QS in V1).\n### PHASE 3: VOLTAGE, HYPERTROPHY & CHF\n* QRS Voltage & LVH\n- LVH Criteria: SV1 + RV6 > 35 mm OR R in Lead I > 15 mm OR R in aVL > 11 mm.\n- Low Voltage Criteria: Limb leads < 5 mm OR Precordial leads < 10 mm.\n* R Wave Progression\n- Poor Progression (PRWP): R waves do not grow normally V1-V4.\n- Reversed Progression: Dominant R in V1 (RVH/Posterior MI).\n### PHASE 4: ISCHEMIA, INFARCTION & MIMICS\n* ST Elevation (STE)\n- Threshold: >= 1 mm (Limb) / >= 2 mm (Precordial) in contiguous leads.\n- STEMI: Convex (\"Sad Face\") STE + Reciprocal depression.\n- Pericarditis: Diffuse Concave (\"Happy Face\") STE + PR depression.\n* Specific Infarction Localization\n- Inferior: II, III, aVF.\n- Lateral: I, aVL, V5, V6.\n- Septal/Anterior: V1-V4.\n- Right Ventricular (RV) MI: STE V1 > V2.\n* Non-STEMI & Ischemia\n- ST Depression: Horizontal/Downsloping (Ischemia).\n- T Wave Inversion: Symmetrical (Ischemia).\n* Q Waves\n- Pathologic: > 0.03 s wide OR > 0.1 mV deep.\n### PHASE 5: ELECTROLYTES & QT\n* QT Interval: Normal QTc <= 440 ms.\n* Electrolytes: Hyperkalemia (Tented T), Hypokalemia (Flat T + U waves).\n---\n## Guidelines for Analysis (CRITICAL: Systematic Lead Examination)\n1. **The \"Differential Exclusion\" Rule:** You must use **both** normal and abnormal\nfindings to reject alternative diagnoses (e.g., \"Narrow QRS rules out VT\").\n2. **Systematic Lead Examination:** You must perform a granular analysis of **every\nlead group** to ensure no pathology is missed. Follow this checklist:\n* **Lead I:** Examine QRS amplitude/duration, ST segment, and T wave morphology.\nLook for lateral wall issues (LVH, BBB, Lateral Ischemia).\n* **Lead II:** Analyze P wave amplitude/duration (Atrial Enlargement) and PR\ninterval. Check ST/T for Inferior wall ischemia.\n* **Leads III and aVF:** Scrutinize for Q waves, ST deviation, and T wave changes\nindicative of Inferior Infarction.\n* **Lead aVL:** Focus on the high lateral region; check QRS, ST, and T waves for\nHigh Lateral Ischemia/Infarction.\n* **Lead aVR:** Check for ST elevation (Left Main/Multivessel disease) and T wave\ninversion.\n* **Lead V1:** Assess R wave height (RVH?), rsR’ pattern (RBBB?), and ST-T changes (\nSeptal Ischemia/Posterior MI mirror).\n* **Leads V2-V4:** Evaluate Anterior/Anteroseptal regions. Look for Q waves, R-wave\nprogression, and ST-T deviations.\n* **Leads V5-V6:** Analyze the Lateral wall for QRS voltage (LVH) and ST-T changes.\n3. **Ground Truth Adherence:** Your reasoning must align with the ‘ECG Report‘ provided\nin the input, but you must provide the visual evidence (from the lead scan above)\nthat supports it.\n## Analysis Workflow & Output Structure\nFollow this sequential logic. Inside the ‘<think>‘ block, you must explicitly document\nyour findings for the specific leads mentioned in the \"Systematic Lead Examination\"\nguideline.\n**Step 1: Technical, Rate & Rhythm**\n* **Logic:** Check Lead Reversal (I vs aVR) & Artifacts. Calculate Rate. Analyze P-\n35\n"}, {"page": 36, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nwaves in **Lead II** and **V1** to distinguish Sinus vs. AFib/Flutter/VT.\n* **Output Format:** A single, solid paragraph. (NO lists).\n**Step 2: Conduction, Axis & Intervals**\n* **Logic:** Determine Axis using **Leads I, II, and aVF**. Check PR interval and QRS\nduration. Scan **V1 and V6** for Bundle Branch Block patterns.\n* **Output Format:** A single, solid paragraph. (NO lists).\n**Step 3: Chamber Hypertrophy & Voltage**\n* **Logic:** Check **Lead I and aVL** for R-wave voltage. Check **V1 and V6** for SV1+\nRV6 (Sokolow-Lyon). Evaluate R-wave progression in **V1-V4**.\n* **Output Format:** A single, solid paragraph. (NO lists).\n**Step 4: Ischemia, Infarction & Mimics (CRITICAL: Comprehensive Scan)**\n* **Logic:** Sequentially analyze **Inferior Leads** (II, III, aVF), **Lateral Leads**\n(I, aVL, V5, V6), **Anterior/Septal Leads** (V1-V4), and **Lead aVR**. Differentiate\nIschemia from mimics.\n* **Output Format:** A single, solid paragraph. (NO lists).\n**Step 5: Electrolytes & QT**\n* **Logic:** Check T-wave shape (Tented vs Flat) in precordial leads. Check QTc.\n* **Output Format:** A single, solid paragraph. (NO lists).\n**Step 6: Final Medical Reasoning**\n* **Logic & Output:** Conclude with the final impression matching the Ground Truth.\nHere is the required output template:\n<think>\n**Step 1: Technical, Rate & Rhythm**\n[Write one single paragraph analysis here. NO bullet points.]\n**Step 2: Conduction, Axis & Intervals**\n[Write one single paragraph analysis here. NO bullet points.]\n**Step 3: Chamber Hypertrophy & Voltage**\n[Write one single paragraph analysis here. NO bullet points.]\n**Step 4: Ischemia, Infarction & Mimics**\n[Write one single paragraph analysis here. NO bullet points.]\n**Step 5: Electrolytes & QT**\n[Write one single paragraph analysis here. NO bullet points.]\n**Step 6: Final Medical Reasoning**\n[Write one single paragraph conclusion here. NO bullet points.]\n</think>\n[Generate the Comprehensive Clinical Response Paragraph here. Streamline the findings\ninto a professional medical narrative following the order above.]\n<answer>[Final diagnosis labels from the report, separated by semicolons]</answer>\n## Generation Rules (Blind Interpretation & Formatting Constraints)\n1. **Strict Blind Simulation:** Do NOT mention the existence of the report. Simulate a\nprimary read.\n2. **Exhaustive Lead Mention:** You must explicitly reference findings from specific\nleads (e.g., \"T wave inversion in V2-V6,\" \"Q waves in II, III, aVF\") rather than\nmaking vague statements.\n3. **Formatting Enforcement:** Inside the ‘<think>‘ block, under each step header, you\nmust write exactly **ONE single paragraph**. **FORBIDDEN:** Bullet points, hyphens,\nnumbered lists, or line breaks within a step’s analysis. The output for each step\nmust look like a continuous block of text.\n36\n"}, {"page": 37, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\n4. **Tag Compliance:** You must start your response with ‘<think>‘ and close it with\n‘</think>‘ before providing the narrative response. You must wrap the final\ndiagnosis in ‘<answer>‘ and ‘</answer>‘.\n5. **Internal Alignment Only:** Use the ‘ECG Report‘ as an answer key.\n6. **Data Quality Check:** If the input ‘ECG Report‘ contains a quality warning (e.g., \"\nWarning: Data quality may affect computer interpretation\"), you must acknowledge the\nartifacts in Step 1 and must NOT state that the technical quality is good.\n7. **Strict Fact Adherence:** Strictly adhere to the provided facts; do not hallucinate,\nfabricate, or invent details not present in the source.\n## Input Data\n**ECG Report (Ground Truth):** {{report}}\n**ECG Machine Measurements:** {{machine_measurements}}\nKey Diagnostic Evidence Extraction\nYou are an expert Medical Data Annotator and Reinforcement Learning Signal Processor.\nYou are provided with an ECG diagnosis involving a structured Chain of Thought (CoT)\nreasoning process.\nYour objective is to extract **\"Key Diagnostic Evidence\"** and specific **Metadata**\nfrom the text. These serve as critical ground-truth evidence tokens to verify the\ncorrectness of the model’s reasoning path during Reinforcement Learning (RL).\n### CRITICAL INSTRUCTION: EXACT STRING MATCHING ONLY\nThe extracted evidence is used for **substring matching** in a reward model.\n- **You MUST copy the text EXACTLY as it appears in the source.**\n- **DO NOT** fix typos.\n- **DO NOT** change capitalization (unless necessary for JSON validity, but prefer\noriginal).\n- **If the text is not present verbatim, DO NOT extract it.**\n### Input Data Structure:\n- **ID & Labels**: Metadata and final ground truth diagnosis.\n- **ECG Interpretation**: A structured text containing 6 distinct reasoning steps (Step\n1 to Step 6) inside a ‘<think>‘ block, followed by a summary in an ‘<answer>‘ block\n.\n### Extraction Schema (Strict Mapping):\n**A. Heart Rate Extraction:**\n- Identify the specific heart rate mentioned in the text (usually in Step 1).\n- Format: Extract the number and unit exactly as they appear (e.g., \"108 bpm\").\n**B. Key Diagnostic Evidence (Step-by-Step):**\nYou must extract significant medical evidence strictly corresponding to the 6-step\nclinical reasoning framework:\n1. **step_1_technical_rate_rhythm**: Extract evidence from \"Step 1\" regarding technical\nquality, baseline, P-wave morphology, and rhythm type.\n2. **step_2_conduction_axis_intervals**: Extract evidence from \"Step 2\" regarding Axis,\nPR interval, QRS duration, and conduction blocks.\n3. **step_3_chamber_hypertrophy_voltage**: Extract evidence from \"Step 3\" regarding\nvoltage criteria, R-wave progression, and hypertrophy.\n4. **step_4_ischemia_infarction_mimics**: Extract evidence from \"Step 4\" regarding ST\ndeviation, T waves, Q waves, and mimics (pericarditis, early repolarization).\n5. **step_5_electrolytes_qt**: Extract evidence from \"Step 5\" regarding QT/QTc\nintervals and electrolyte signs (Hyper/Hypokalemia).\n6. **step_6_final_medical_reasoning**: Extract the synthesis logic, final diagnostic\nassertions, or summary statements found in \"Step 6\" or the final summary.\n### Extraction Rules:\n- You must extract findings exactly as they appear in the original ECG interpretation\n37\n"}, {"page": 38, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\ntext. Do not invent, infer, or alter any content under any circumstance.\n- Retain only terms, numbers, and abbreviations that are explicitly present in the\ninput text.\n- Each finding must be unique and appear under the most appropriate category.\n- Every extracted finding must contain fewer than four (4) words. This limit is strict\nand must not be exceeded.\n- The extracted findings must be **directly relevant** to the diseases or diagnostic\nlabels listed in {{ecg_labels}}. Ignore any unrelated, nonspecific, or incidental\nphrases.\n- Do **not** extract vague or non-diagnostic terms such as P wave morphology, ST\nsegments, T wave amplitudes, QRS complexes, or similar structural references without\nexplicit abnormal descriptors. Only include findings that describe a clinically\nmeaningful deviation or abnormality.\n- Each extracted finding must be complete, contextually meaningful, and logically\ncoherent. Do not truncate phrases in a way that changes or obscures their meaning.\n- Do not rephrase, paraphrase, summarize, generalize, or modify any wording from the\ninput. Every output must reproduce the exact wording of the source text.\n- If a key finding expresses a negative or absence statement (e.g., \"no ST elevation\", \"\nwithout QRS widening\", \"absence of arrhythmia\"), you must preserve the entire phrase\nexactly as it appears in the text.\n- Under no condition should you create new findings, infer additional information, or\nmake any diagnostic assumptions beyond the provided text. Every output must be\nverifiable directly in the original ECG interpretation.\n- Each diagnostic category must contain no more than three (3) of the most important\nfindings. If more findings exist, include only the three most clinically relevant or\nemphasized in the text.\n- ** If a diagnostic category contains no findings that fully satisfy all the above\ncriteria, output an empty list for that category. Do not include approximate, vague,\nor partially matching content. No findings is better than incorrect extraction. For\nexample, do not extract general, non-diagnostic expressions such as P wave\nmorphology, ST segments, T wave amplitudes, QRS duration, QRS complexes, QT\nintervals, or other similar waveform descriptors that do not directly indicate a\nspecific abnormality. **\n### Output Constraint:\n**Strictly follow the Output Format below.**\n- Output **ONLY** the raw JSON object.\n- **DO NOT** use Markdown code blocks (e.g., ‘‘‘json ... ‘‘‘).\n- **DO NOT** include any introductory or concluding text.\n### Output Format (Strict JSON):\n{\n\"id\": \"{{ecg_id}}\",\n\"labels\": \"{{ecg_labels}}\",\n\"heart_rate\": [\"...\"],\n\"key_diagnostic_evidence\": {\n\"step_1_technical_rate_rhythm\": [\"...\"],\n\"step_2_conduction_axis_intervals\": [\"...\"],\n\"step_3_chamber_hypertrophy_voltage\": [\"...\"],\n\"step_4_ischemia_infarction_mimics\": [\"...\"],\n\"step_5_electrolytes_qt\": [\"...\"],\n\"step_6_final_medical_reasoning\": [\"...\"]\n}\n}\n### Input:\nID: {{ecg_id}}\nLabels: {{ecg_labels}}\nECG Interpretation:\n{{ecg_interpretation}}\n38\n"}, {"page": 39, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\nF.2. Interpretation Evaluation\nGrounded ECG Interpretation Evaluation Prompt\n# Your task: Evaluate the alignment and quality of a generated ECG interpretation by\ncomparing it to a ground truth clinician’s interpretation.\n## Evaluation Criteria:\n1. DiagnosisAccuracy: Evaluates whether the generated diagnosis is correct, specific,\nand supported by ECG findings.\n- Scoring\n+2 per diagnosis: Each correctly identified key diagnosis with supporting ECG\nfeatures.\n+1 per diagnosis: Each mostly correct diagnosis but lacking key supporting\ndetails.\n+0 per diagnosis: Each incorrect or vague diagnosis not supported by ECG\nfeatures.\n2. AnalysisCompleteness: Checks if all key ECG components (rhythm, intervals,\nwaveforms, and lead-specific findings) are discussed.\n- Scoring\n+1 per feature: For each correctly addressed key ECG feature (e.g., rhythm, PR\ninterval, QRS duration, ST segment, T wave morphology).\n+0 per missing feature: For each key feature omitted or inaccurately described.\n3. AnalysisRelevance: Assesses whether each provided explanation directly supports\nthe diagnosis.\n- Scoring\n+2 per feature or per lead: Each point that strongly supports the diagnosis\nwith clear ECG evidence.\n+1 per feature or per lead: Some points are relevant but not fully justified.\n+0: Includes unrelated or misleading explanations.\n4. LeadEvidenceValidity: Evaluates whether the lead-related statements are\ndiagnostically necessary, correctly grounded, and free of unsupported lead-wise\nclaims, rather than maximizing the number of mentioned leads.\n- Scoring\n+2 per key lead/region: For each diagnosis-critical lead (or contiguous lead\ngroup / territory) correctly referenced with explicit and matching ECG\nevidence (e.g., ST elevation/depression, T-wave inversion, pathologic Q\nwaves, bundle-branch morphology) that supports the stated diagnosis.\n+1 per key lead/region: For each key lead/region mentioned with partially\ncorrect evidence, but missing important details (e.g., direction without\nmagnitude/morphology) or showing minor inconsistencies.\n+0 per key lead/region: Key lead/region is omitted or the described finding is\nincorrect / non-grounded and does not support the diagnosis.\n5. GroundedECGUnderstanding: Determines if the interpretation references actual ECG\nfeatures (e.g., QRS amplitude, PR interval) instead of generic terms.\n- Scoring (0-100)\n100: ECG findings are comprehensively cited, linked to diagnoses, and cover\nall relevant ECG features.\n80: ECG findings are explicitly cited and linked to diagnoses.\n50: Some ECG references exist but are incomplete.\n0: Lacks specific waveform references.\n6. EvidenceBasedReasoning: Evaluates whether the diagnosis follows logical, evidence-\nsupported steps.\n- Scoring (0-100)\n100: Findings logically progress to diagnosis with thorough and clear\njustifications covering all necessary steps.\n39\n"}, {"page": 40, "text": "ECG-R1: Protocol-Guided and Modality-Agnostic MLLM for Reliable ECG Interpretation\n80: Findings logically progress to diagnosis with clear justifications.\n50: Some reasoning exists but lacks complete step-by-step analysis.\n0: Reasoning is unclear or not derived from ECG findings.\n7. RealisticDiagnosticProcess: Assesses if the model mimics how a clinician\ninterprets an ECG, considering all relevant factors.\n- Scoring (0-100)\n100: The analysis follows a structured clinical approach and considers all\nrelevant clinical factors.\n80: The analysis follows a structured clinical approach.\n50: Some clinical reasoning is present but incomplete.\n0: The approach lacks structured clinical reasoning.\nNOTE: Each score must be calculated based on strict criteria to ensure objective\nevaluation.\n## Generated ECG Interpretation:\n{{generated}}\n## Ground Truth Clinician’s Interpretation:\n{{groundtruth}}\n**Response:** [Please organize your output in a JSON format for each criterion,\nincluding a brief explanation for each aspect. Strictly follow this JSON format that\nrecords every scoring for each criterion: {’DiagnosisAccuracy’:[{’Score’: , ’\nExplanation’:}, ...], ’AnalysisCompleteness’:[{’Score’: , ’Explanation’:}, ...], ’\nAnalysisRelevance’:[{’Score’: , ’Explanation’:}, ...], ’LeadEvidenceValidity’:[{’\nScore’: , ’Explanation’:}, ...], ’GroundedECGUnderstanding’:[{’Score’: , ’\nExplanation’:}, ...], ’EvidenceBasedReasoning’:[{’Score’: , ’Explanation’:}, ...], ’\nRealisticDiagnosticProcess’:[{’Score’: , ’Explanation’:}, ...]}]\n40\n"}]}