{"doc_id": "arxiv:2511.09895", "source": "arxiv", "lang": "en", "pdf_path": "data/raw/arxiv/pdf/2511.09895.pdf", "meta": {"doc_id": "arxiv:2511.09895", "source": "arxiv", "arxiv_id": "2511.09895", "title": "Simulator and Experience Enhanced Diffusion Model for Comprehensive ECG Generation", "authors": ["Xiaoda Wang", "Kaiqiao Han", "Yuhao Xu", "Xiao Luo", "Yizhou Sun", "Wei Wang", "Carl Yang"], "published": "2025-11-13T02:57:10Z", "updated": "2025-11-13T02:57:10Z", "summary": "Cardiovascular disease (CVD) is a leading cause of mortality worldwide. Electrocardiograms (ECGs) are the most widely used non-invasive tool for cardiac assessment, yet large, well-annotated ECG corpora are scarce due to cost, privacy, and workflow constraints. Generating ECGs can be beneficial for the mechanistic understanding of cardiac electrical activity, enable the construction of large, heterogeneous, and unbiased datasets, and facilitate privacy-preserving data sharing. Generating realistic ECG signals from clinical context is important yet underexplored. Recent work has leveraged diffusion models for text-to-ECG generation, but two challenges remain: (i) existing methods often overlook the physiological simulator knowledge of cardiac activity; and (ii) they ignore broader, experience-based clinical knowledge grounded in real-world practice. To address these gaps, we propose SE-Diff, a novel physiological simulator and experience enhanced diffusion model for comprehensive ECG generation. SE-Diff integrates a lightweight ordinary differential equation (ODE)-based ECG simulator into the diffusion process via a beat decoder and simulator-consistent constraints, injecting mechanistic priors that promote physiologically plausible waveforms. In parallel, we design an LLM-powered experience retrieval-augmented strategy to inject clinical knowledge, providing more guidance for ECG generation. Extensive experiments on real-world ECG datasets demonstrate that SE-Diff improves both signal fidelity and text-ECG semantic alignment over baselines, proving its superiority for text-to-ECG generation. We further show that the simulator-based and experience-based knowledge also benefit downstream ECG classification.", "query": "(cat:cs.CL OR cat:cs.LG) AND (all:\"large language model\" OR all:LLM) AND (all:medical OR all:clinical OR all:healthcare)", "url_abs": "http://arxiv.org/abs/2511.09895v1", "url_pdf": "https://arxiv.org/pdf/2511.09895.pdf", "meta_path": "data/raw/arxiv/meta/2511.09895.json", "sha256": "11845ddc9ddd890630b0465e32b38eb472b2d6f51ff7e98f11cc0dbe0891a7ac", "status": "ok", "fetched_at": "2026-02-18T02:27:18.633243+00:00"}, "pages": [{"page": 1, "text": "Preprint\nSIMULATOR AND EXPERIENCE ENHANCED DIFFUSION\nMODEL FOR COMPREHENSIVE ECG GENERATION\nXiaoda Wang∗, Kaiqiao Han†, Yuhao Xu∗, Xiao Luo‡, Yizhou Sun†, Wei Wang†, Carl Yang∗\n∗Emory University\n†University of California, Los Angeles\n‡University of Wisconsin–Madison\n{xiaoda.wang,j.carlyang}@emory.edu\nxiao.luo@wisc.edu\n{kqhan,yzsun,weiwang}@cs.ucla.edu\nABSTRACT\nCardiovascular disease (CVD) is a leading cause of mortality worldwide. Elec-\ntrocardiograms (ECGs) are the most widely used non-invasive tool for cardiac\nassessment, yet large, well-annotated ECG corpora are scarce due to cost, privacy,\nand workflow constraints. Generating ECGs can be beneficial for the mechanistic\nunderstanding of cardiac electrical activity, enable the construction of large, het-\nerogeneous, and unbiased datasets, and facilitate privacy-preserving data sharing.\nGenerating realistic ECG signals from clinical context is important yet underex-\nplored. Recent work has leveraged diffusion models for text-to-ECG generation,\nbut two challenges remain: (i) existing methods often overlook the physiological\nsimulator knowledge of cardiac activity; and (ii) they ignore broader, experience-\nbased clinical knowledge grounded in real-world practice. To address these gaps,\nwe propose SE-Diff, a novel physiological simulator and experience enhanced dif-\nfusion model for comprehensive ECG generation. SE-Diff integrates a lightweight\nordinary differential equation (ODE)-based ECG simulator into the diffusion pro-\ncess via a beat decoder and simulator-consistent constraints, injecting mechanistic\npriors that promote physiologically plausible waveforms. In parallel, we design an\nLLM-powered experience retrieval-augmented strategy to inject clinical knowl-\nedge, providing more guidance for ECG generation. Extensive experiments on\nreal-world ECG datasets demonstrate that SE-Diff improves both signal fidelity\nand text–ECG semantic alignment over baselines, proving its superiority for text-\nto-ECG generation. We further show that the simulator-based and experience-\nbased knowledge also benefit downstream ECG classification.\n1\nINTRODUCTION\nCardiovascular disease (CVD) remains a leading cause of global mortality and morbidity (Roth et al.,\n2020). In clinical workflows, the 12-lead electrocardiogram (ECG)—the standard setup using 10\nelectrodes to derive 12 voltage traces-is ubiquitous, non-invasive, and low-cost for screening, triage,\nand longitudinal monitoring (Kligfield et al., 2007). While machine learning (ML) has advanced\nECG interpretation, progress is constrained by limited access to large, well-annotated corpora, strin-\ngent privacy considerations around sharing protected health information, and the expense of expert\nlabeling (Johnson et al., 2023; Goldberger et al., 2000). ECG generation provides a principled way\nto mitigate these barriers by expanding training data, enabling controlled curation, and decoupling\nmodel development from directly identifiable records (Zanchi et al., 2025). Concurrently, denoising\ndiffusion probabilistic models (DDPMs) and score-based methods have established strong fidelity\nand coverage across modalities (Ho et al., 2020; Song et al., 2021), motivating their adaptation to\nmedical time series and, specifically, text-conditioned ECG generation (Lai et al., 2025a).\nDespite these advances, there are still two gaps limit the practical adoption of text-to-ECG gener-\nation. (i) Missing physiological simulator knowledge. Most diffusion models for ECG learn mor-\nphology and timing purely from data, with minimal incorporation of known cardiac physiological\ndynamics. Decades of physiological modeling have produced compact ordinary differential equation\n(ODE) simulators that yield realistic P–QRS–T morphologies and heartrate variability under con-\ntrollable parameters (McSharry et al., 2003; Malik, 1996). Yet these simulators are rarely integrated\nas priors or constraints during diffusion training, leaving a disconnect between statistical generation\n1\narXiv:2511.09895v1  [cs.LG]  13 Nov 2025\n"}, {"page": 2, "text": "Preprint\nand mechanistic plausibility. (ii) Under-use of experience-based knowledge at scale. Prior text-\nto-ECG works often condition on narrow patient metadata, but do not leverage broader experience\nknowledge—case-based regularities distributed across large electronic health record (EHR) corpora.\nRetrieval-augmented generation (RAG) offers a principled means to inject such non-parametric\nknowledge to generators(Lewis et al., 2020), including via lexical retrieval schemes, yet its potential\nfor conditioning medical time-series generation remains underexplored.\nTo address these challenges, we introduce SE-Diff, a conditional latent-diffusion framework that\nsynthesizes comprehensive ECG waveforms from natural-language clinical descriptions. SE-Diff\ncouples a lightweight ODE-based ECG simulator to the denoising dynamics through a beat de-\ncoder—reconstructing a QRS-aligned single cycle from the latent code—and simulator-consistent\nspectral and rate constraints, thereby injecting mechanistic priors that steer generation toward phys-\niologically plausible signals. In parallel, an LLM-powered retrieval pipeline identifies clinically\nsimilar patients from EHRs, retrieves their ECG diagnoses and measurements, and distills them into\na concise, physiologically grounded description that is fused with available metadata for condition-\ning. In summary, our main contributions are as follows:\n❶Problem Identification. We identify the problem of generating realistic 10,s, 12-lead ECG wave-\nforms directly from natural-language clinical descriptions. We propose SE-Diff, which can incorpo-\nrate various patient metadata (age, sex, heart rate, rhythm/conduction) as soft clinical constraints to\nsteer morphology toward clinically meaningful generation.\n❷Simulator–Informed Diffusion. SE-Diff is the first to integrate a lightweight ODE-based ECG\nsimulator with latent diffusion. We introduce a beat decoder that reconstructs a single-cycle beat\nfrom the latent representation, injecting simulator-consistent mechanistic priors that guide the de-\nnoising process toward physiologically plausible waveforms.\n❸Experience Retrieval–Augmented Conditioning.\nWe design an LLM-powered retrieval\npipeline that identifies clinically similar patients based on EHR data and retrieves ECG diagnoses\nand measurements. The LLM generates a concise, physiologically grounded description, which is\nfused with available metadata to form the conditioning context.\n❹Experimental Validation. Across real-world ECG datasets, SE-Diff surpasses baselines in both\nsignal fidelity and text–ECG semantic alignment. Ablations quantify the contribution of simulator-\nbased and experience-based knowledge conditioning. We further show that SE-Diff improves down-\nstream ECG classification when used for augmentation.\n2\nPRELIMINARIES\n2.1\nDENOISING DIFFUSION PROBABILISTIC MODELS\nDenoising Diffusion Probabilistic Models (DDPMs) (Sohl-Dickstein et al., 2015; Ho et al., 2020)\ndefine a fixed forward Markov noising process that maps a clean sample x0 ∼q(x0) to Gaussian\nnoise over T steps, and a parametric reverse process that approximately inverts it. With variance\nschedule {βt}T\nt=1 ⊂(0, 1), set αt = 1 −βt and ¯αt = Qt\ns=1 αs. The forward chain is\nq(x1:T | x0) =\nT\nY\nt=1\nq(xt | xt−1),\n(1)\nwhere q(xt | xt−1) := N\n\u0000√αt xt−1, βt I\n\u0001\n. This implies the closed form xt = √¯αt x0+√1 −¯αt ϵt,\nwith ϵt ∼N(0, I). The exact reverse-time posterior q(xt−1 | xt) is intractable, so DDPMs approx-\nimate it with a Gaussian transition pθ(xt−1 | xt)\n:=\nN\n\u0000µθ(xt, t), Σθ(xt, t)\n\u0001\n, where a neural\nnetwork predicts either the forward noise ϵ, the clean signal x0, or the velocity v. Under the com-\nmon noise-prediction parameterization with ϵθ(xt, t), the mean is\nµθ(xt, t) =\n1\n√αt\n\u0012\nxt −\nβt\n√1 −¯αt\nϵθ(xt, t)\n\u0013\n,\n(2)\nand we set Σθ(xt, t)\n∈\n{βtI, σ2\nt I}. Training maximizes a variational lower bound on\nlog pθ(x0) (Sohl-Dickstein et al., 2015), which in practice reduces to the simple loss (Ho et al.,\n2\n"}, {"page": 3, "text": "Preprint\n2020) with optional step-dependent weights wt:\nLsimple(θ) = Et∼U{1...T }, x0∼q, ϵ∼N\nh\nwt\n\r\rϵ −ϵθ\n\u0000√¯αtx0 +\n√\n1 −¯αt ϵ, t\n\u0001\r\r2\n2\ni\n.\n(3)\n2.2\nTHE ECG PHYSIOLOGICAL SIMULATOR\nIn a resting heart, the ECG follows the P–QRS–T sequence. To reproduce this morphology, Mc-\nSharry et al. (2003) proposed a three–ODE “ECG simulator” that generates realistic P–QRS–T\nwaves while allowing control of heart-rate statistics and HRV spectrum (Malik & Camm, 1990).\nThe model evolves a 3D state (x(t), y(t), z(t)): (x, y) traverse a unit-radius limit cycle whose angle\nencodes cardiac phase (one revolution per beat), and z(t) is the ECG voltage given by excursions\nabout this cycle. The governing ODEs are:\ndx\ndt = α(x, y) x −ω y,\ndy\ndt\n= α(x, y) y + ω x .\n(4)\ndz\ndt = −\nX\nβ∈{P,Q,R,S,T }\naβ ∆θβ(x, y) exp\n\u0010\n−∆θβ(x, y)2\n2 b2\nβ\n\u0011\n−\n\u0002\nz −z0(t)\n\u0003\n.\n(5)\nwhere α(x, y) = 1 −\np\nx2 + y2 drives (x, y) toward the unit limit cycle, θ(x, y) = atan2(y, x) ∈\n[−π, π] is the phase, and ∆θβ(x, y) = (θ(x, y)−θβ) mod 2π is the phase offset to landmark β ∈B\nwith B = {P, Q, R, S, T}. The parameter ω controls angular velocity (thus average heart rate), and\nz0(t) is a slow baseline (e.g., respiratory wander modeled as z0(t) = A sin(2πfrespt) with small\namplitude A (S¨ornmo & Laguna, 2005)). All morphology parameters are collected as\nη =\n\b\nθP , θQ, θR, θS, θT , aP , aQ, aR, aS, aT , bP , bQ, bR, bS, bT\n\t\n,\n(6)\nwhere these parameters—phase landmarks θβ, amplitude coefficients aβ, and width coefficients bβ\nfor each β ∈{P, Q, R, S, T}—govern the ECG morphology. When the (x, y) state passes the phase\nθβ, the Gaussian-shaped term aβ ∆θβ exp\n\u0000−∆θ2\nβ/(2b2\nβ)\n\u0001\nin 5 transiently perturbs z away from\nbaseline, producing the corresponding P/QRS/T deflection. The sign of aβ sets polarity (upward\nfor aβ > 0, downward for aβ < 0); |aβ| controls peak amplitude; and bβ sets the temporal spread\n(wave duration). The restoring term −[z −z0(t)] then pulls the signal back toward baseline. Unless\notherwise specified, we adopt the parameter values recommended by McSharry et al. (2003).\nThe Euler Method. To simulate the synthetic ECG z(t), we numerically solve the ODE system\nwith a fixed-step explicit Euler method (the first-order Runge–Kutta scheme) (Butcher & Butcher,\n1987; S¨uli & Mayers, 2003). We choose the step size ∆t = 1/fs to match the desired sampling\nfrequency (e.g., fs = 500 Hz). Using the finite-difference approximation(Milne-Thomson, 2000):\ndu\ndt (t) ≈\nu(t + ∆t) −u(t)\n∆t\n,\n(7)\nwhich leads to the update rule u(t + ∆t) = u(t) + v(t) ∆t , for an ODE of the form du/dt = v(t).\nStarting from initial conditions (x0, y0, z0), we iterate this update for each time step. At the ℓ-th\nstep (time tℓ= ℓ∆t), let vℓ\n=\n\u0000fx(xℓ, yℓ; η),\nfy(xℓ, yℓ; η),\nfz(xℓ, yℓ, zℓ, tℓ; η)\n\u0001\ndenote the\nright-hand side of Equation 4 and 5. The state is then advanced as:\nxℓ+1 = xℓ+ fx(xℓ, yℓ; η) ∆t ,\n(8)\nyℓ+1 = yℓ+ fy(xℓ, yℓ; η) ∆t ,\n(9)\nzℓ+1 = zℓ+ fz(xℓ, yℓ, zℓ, tℓ; η) ∆t ,\n(10)\nand this process is repeated for ℓ= 0, 1, 2, . . . up to the desired number of samples L. In other\nwords, each iteration uses the derivatives fx, fy, fz at the current state to step the solution forward\nby ∆t. This simple explicit scheme is computationally efficient and sufficient for our purposes,\nthough higher-order integration methods could be used for greater accuracy if needed.\n3\nMETHOD: SE-DIFF\nWe present SE-Diff, a conditional latent-diffusion framework that synthesizes 10s, 12-lead ECGs\nfrom clinical text. Diffusion operates in the VAE latent space (Sec. 2.1). To make physiology-\naware supervision tractable, we attach a lightweight Beat Decoder that predicts a single QRS-aligned\n3\n"}, {"page": 4, "text": "Preprint\ncardiac cycle from the latent; its output drives simulator-informed regularizers derived from the ECG\nphysiology model in Sec. 2.2. To strengthen conditioning, SE-Diff also incorporates experience\nknowledge retrieved based on EHRs (Sec. 3.4). In inference, we sample in latent space and decode\nwith the full VAE.\nProblem Formulation. Each ECG record is a multivariate sequence x ∈R12×L representing a\n10 s, 12-lead waveform sampled at fs. Our goal is to learn a conditional generator p(x | c; ϕ, ϑ, θ)\nthat uses c throughout denoising to produce physiologically plausible ECGs. The conditioning is\nc = (t, m, r), comprising original diagnoses t, basic metadata m (age, sex, optionally heart rate),\nand retrieve-augmented report r. Concretely, we first train a VAE (Eϕ, Dθ) together with a Beat\nDecoder Dbeat\nψ\n; the encoder maps a full recording to a latent sequence z0 = Eϕ(x) ∈Rd×T ,\nwhere T = L/S and S is the VAE temporal stride, and Dbeat\nψ\nmaps z0 to a single-cycle prediction\nh ∈R12×Lc. We then freeze Eϕ, Dθ, and Dbeat\nψ\nand train a DDPM in latent space using a U-Net\ndenoiser ϵϑ(zt, t, c) with cross-attention to c. During diffusion training, simulator-guided penalties\n(Sec. 3.3) are applied to the Beat Decoder output Dbeat\nψ\n(z0), while experience–knowledge features\naugment the text pathway (Sec. 3.4). At test time, we run the reverse process to obtain ˆz0 and decode\nˆx = Dθ(ˆz0) (Sec. 3.5).\nECG\nForward Diffusion\nSimulator\nTraining\n𝒕= 𝟎\n𝒕= 𝑻\n𝒕= 𝑻\n𝒕= 𝟎\n{𝑷, 𝑸, 𝑹, 𝑺, 𝑻}\n𝜼 𝒑𝒂𝒓𝒂𝒎𝒆𝒕𝒆𝒓𝒔\n𝑳𝑽𝑨𝑬= 𝑳𝒇𝒖𝒍𝒍+ 𝜷𝑲𝑳𝑳𝑲𝑳\n+𝑳𝒃𝒆𝒂𝒕+ 𝜶𝒔𝒑𝒆𝒄𝑳𝒔𝒑𝒆𝒄\nEHR\nDiagnosis\nDiagnoses\nLLM\nReport\nConditions\nInference\nEncoder\n(a)\n𝐱\nො𝐱\n𝐳𝟎\n𝐳𝐓\nො𝐳0\nBeat\nDecoder\n𝐡\n𝐳𝐓\nDenoising U-Net\nRandom Noise\n(b)\n𝑳𝑺𝒊𝒎𝒖𝒍𝒂𝒕𝒐𝒓\n= 𝑳𝑬𝒖𝒍𝒆𝒓\n+𝑳𝒊𝒏𝒕𝒆𝒓−𝒍𝒆𝒂𝒅\n(c)\nU-Net\nRandom Noise\nDecoder\nECG\nWaveform \n(e)\n𝑻𝒐𝒑\n−𝒌\nMetadata\n(d)\nDecoder\n𝑳𝑫𝑫𝑷𝑴\nFigure 1: Overview Framework of SE-Diff. (a) Variational Autoencoder: encoder–decoder with a\nlightweight beat decoder for a single QRS-aligned cycle. (b) Conditional latent diffusion: U-Net de-\nnoiser with cross-attention to text, metadata, and retrieved report. (c) Simulator-informed diffusion:\nEuler and inter-lead constraints on the beat decoder output. (d) Experience retrieval–augmented\nConditioning: tri-view EHR similarity with LLM distillation into a concise report. (e) Inference:\nreverse diffusion and decoding to a 10,s, 12-lead ECG.\n3.1\nVARIATIONAL AUTOENCODER\nWe learn a latent representation for 12-lead ECGs with a variational autoencoder (VAE). Given a\nfull recording x ∈R12×L, the encoder Eϕ parameterizes a diagonal Gaussian posterior\nqϕ(z | x) = N\n\u0000z; µϕ(x), diag(σ2\nϕ(x))\n\u0001\n,\nz0 = µϕ(x) + σϕ(x) ⊙ϵ, ϵ ∼N(0, I),\n(11)\nwhere z0 ∈Rd×T with T = L/S and S the VAE temporal stride. The decoder Dθ reconstructs the\nsignal ˆx = Dθ(z0) ∈R12×L. To expose morphology at the beat scale, we attach a lightweight Beat\nDecoder: Dbeat\nψ\n: Rd×T →R12×Lc to get the single cycle signal: h = Dbeat\nψ\n(z0).\nTraining. Let r0 denote the first R-peak index at sampling rate fs (Golany et al., 2020b); define\nC(x) = x[:, r0 −0.2 fs : r0 + 0.4 fs] and Lc = 0.2 fs + 0.4 fs. We train the encoder, decoder and\nBeat Decoder with length-normalized mean-squared errors (MSE) and a single KL term:\nLfull =\n1\n12L ∥x −Dθ(Eϕ(x))∥2\nF ,\nLKL = KL(qϕ(z | x) ∥N(0, I)) ,\n(12)\nLbeat =\n1\n12Lc\n\r\rC(x) −Dbeat\nψ\n(Eϕ(x))\n\r\r2\nF .\n(13)\n4\n"}, {"page": 5, "text": "Preprint\nThe Beat Decoder’s single beat should also reflect the statistics of all beats in the 10 s window.\nRather than tiling h to length L, we detect all R-peaks within the window, {rj}J\nj=1 (with J de-\ntermined by the number of detected beats), and extract per-beat crops of identical length Lc:\nCj(x) = x[:, rj −0.2 fs : rj + 0.4 fs] ∈R12×Lc, j = 1, . . . , J. Let the Beat Decoder output\nbe h = Dbeat\nψ\n(z0) ∈R12×Lc. For each lead ℓand each cycle j, we remove the mean and compute\nthe one-sided log-magnitude spectrum (real FFT of length Lc) up to fmax:\nS(j)\nℓ[k] = log\n\u0000ε+\n\f\frFFT(Cj(x)ℓ−Cj(x)ℓ)\n\f\f[k]\n\u0001\n,\nˆSℓ[k] = log\n\u0000ε+\n\f\frFFT(hℓ−¯hℓ)\n\f\f[k]\n\u0003\n, (14)\nwith ε > 0 small and frequencies fk =\nk\nLc fs.\nThe spectral loss averages the (optionally\nband-weighted) squared discrepancy between the Beat Decoder’s spectrum and the spectrum of\neach observed cycle:\nLspec =\n1\n12JK\n12\nX\nℓ=1\nJ\nX\nj=1\nX\nk: fk≤fmax\nw(fk)\n\u0000 ˆSℓ[k] −S(j)\nℓ[k]\n\u00012,\n(15)\nwhere K = |{k : fk ≤fmax}| and w(f) can emphasize physiologically salient bands (e.g., higher\nweights on 0.5–3 Hz for heart rate). We jointly optimize the encoder, the full decoder, and the beat\ndecoder with:\nLVAE = Lfull + βKL LKL + Lbeat + αspec Lspec ,\n(16)\nwhere αspec > 0. Length normalization makes Lfull and Lbeat commensurate; Lspec incorporates\nfull-window frequency statistics into the single-cycle prediction.\n3.2\nCONDITIONAL LATENT DIFFUSION\nWe train the diffusion in the VAE latent space. Given a latent sequence z0 = Eϕ(x) ∈Rd×T , the\nforward process follows Sec. 2.1 with xt 7→zt: zt = √¯αt z0 + √1 −¯αt ϵ, and ϵ ∼N(0, I). We\ntrain a conditional denoiser ϵϑ(zt, t, c) with the standard objective\nLDDPM = Et, z0, ϵ\nh\r\rϵ −ϵϑ(zt, t, c)\n\r\r2\n2\ni\n.\n(17)\nThe denoiser is a 1D U-Net (Ronneberger et al., 2015) that treats the latent as a sequence zt ∈Rd×T\n(channels d, length T). Conditioning enters via cross-attention to a context representation C built\nfrom c = (t, m, r) (Rombach et al., 2022; Vaswani et al., 2017); a final 1×1 convolution maps fea-\ntures to ϵϑ. Timestep and context embeddings modulate intermediate features through FiLM-style\naffine transformations (Perez et al., 2018). At sampling, we use standard DDPM transitions with\nclassifier-free guidance (Ho & Salimans, 2022) and common improvements such as cosine sched-\nules and optional learned variances (Nichol & Dhariwal, 2021); further architectural and training\ndetails are provided in the appendix.\n3.3\nSIMULATOR-INFORMED DIFFUSION\nWe estimate class-specific parameters ηclass offline by fitting the simulator to representative real\nbeats using an explicit Euler integrator, together with lightweight stabilizers and morphology priors\nthat improve convergence and preserve physiological plausibility (details in Appendix A.3). For\neach training sample, we obtain a single-cycle waveform h = Dbeat\nψ\n(z0) ∈R12×Lc from the Beat\nDecoder (Sec. 3.1). This beat is used to enforce mechanistic plausibility via an ODE-based ECG\nsimulator (Sec. 2.2). The simulator’s morphology parameters η = {θβ, aβ, bβ}β∈{P,Q,R,S,T } enter\nthe right-hand side fz(· ; η) of Eq. 5, which defines fz. During diffusion training, the simulator\nprovides two complementary regularizers:\nSimulator-guided Euler Loss. Given the single-cycle waveform h ∈R12×Lc, we integrate the\nsimulator with parameters η and fixed initials (x0, y0) to obtain a reference trajectory (xt, yt) at\nt = ℓ∆t. We penalize per-lead deviations from the ODE and the simulator-guided Euler loss is:\nLEuler =\n1\n12(Lc −1)\nX\nlead\nLc−1\nX\nℓ=1\n\u0012hℓ+1 −hℓ\n∆t\n−fz\n\u0000xℓ, yℓ, hℓ, tℓ; η\n\u0001\u00132\n.\n(18)\n5\n"}, {"page": 6, "text": "Preprint\nInter-lead dependency constraint. Realistic 12-lead synthesis requires not only accurate per-lead\nmorphology but also correct physiological interdependencies among leads. We therefore enforce the\nclassical frontal-plane identities implied by the standard ECG configuration (Einthoven’s triangle\nand Goldberger’s central terminal), constraining the generated limb and augmented leads to remain\nmutually consistent:\nI = II −III,\naV R = −1\n2(I + II),\naV L = 1\n2(I −III),\nII = I + III,\naV F = 1\n2(II + III),\nIII = II −I.\n(19)\nLet Lfrontal = {I, II, III, aV R, aV L, aV F} be the frontal-plane leads (a subset of the 12 leads).\nFor any identity of the form y = β p + γ q with y, p, q ∈Lfrontal, we treat y as the child lead and\np, q as its parent leads. Denote by hL\nℓthe sample at index ℓof lead L from the predicted 12-lead\nbeat h ∈R12×Lc. We obtain parent simulator states (xp\nℓ, yp\nℓ) and (xq\nℓ, yq\nℓ) by integrating the sim-\nulator with class-specific parameters ηp, ηq. Defining C = {(I, II, III, 1, −1), (II, I, III, 1, 1),\n(III, II, I, 1, −1), (aV R, I, II, −1\n2, −1\n2), (aV L, I, III, 1\n2, −1\n2), (aV F, II, III, 1\n2, 1\n2)} and the\nloss aggregates the six constraints over time:\nLinter-lead =\nX\n(y,p,q,β,γ)∈C\nLc−1\nX\nℓ=1\n \nhy\nℓ+1 −hy\nℓ\n∆t\n−β fz(xp\nℓ, yp\nℓ, hp\nℓ, tℓ; ηp) −γ fz(xq\nℓ, yq\nℓ, hq\nℓ, tℓ; ηq)\n!2\n.\n(20)\nHere y, p, q are specific leads (elements of the 12-lead set), and C enumerates each frontal-plane\nidentity as a tuple (y, p, q, β, γ). This construction directly matches the child’s discrete derivative to\nthe corresponding linear combination of the parents’ simulator derivatives, enforcing physiologically\ngrounded inter-lead consistency.\n3.4\nEXPERIENCE RETRIEVAL–AUGMENTED CONDITIONING\nWe augment text conditioning with clinical experience retrieved from electronic health records\n(EHR). Specifically, we link MIMIC-IV-ECG (Gow et al., 2023) to MIMIC-IV-CLINICAL (John-\nson et al., 2023), build a compact tri-view profile (diagnoses, medications, procedures) (Ou et al.,\n2025), and retrieve the top-k clinically similar admissions. For an index admission u, let EDiag\nu\n,\nEMed\nu\n, and EProc\nu\ndenote the sets of diagnosis, medication, and procedure codes, respectively.\nGiven another admission u′, we compute set similarities using the Jaccard index J(A, B) for\nX ∈{Diag, Med, Proc}:\nτX(u, u′) = J\n\u0000EX\nu , EX\nu′\n\u0001\n.\n(21)\nThese similarities are aggregated with nonnegative weights λ1, λ2, λ3 to yield a single similarity:\nτ(u, u′) = λ1τDiag(u, u′) + λ2τMed(u, u′) + λ3τProc(u, u′).\n(22)\nWe retrieve the diagnoses of the top-k most similar admissions. An LLM then distills this into a\nphysiologically grounded report r. Finally, the conditioning input is c = (t, m, r), where t denotes\nthe original diagnoses and m encodes basic metadata (age, sex, optionally heart rate); the combined\ncontext is injected into the denoiser via cross-attention.\n3.5\nTRAINING AND INFERENCE\nTraining objective. We combine the latent-space diffusion loss with simulator-based regularizers:\nLtotal = LDDPM + λ LEuler + γ Linter-lead,\nλ, γ > 0.\n(23)\nWe first train the VAE using Eq. 16 and then freeze Eϕ, Dθ, and Dbeat\nψ\n. During diffusion training,\nwe optimize only the denoiser ϵϑ; the Beat Decoder appears only through these regularizers—we\nuse Dbeat\nψ\nto produce h = Dbeat\nψ\n(z0) for LEuler and Linter-lead. All simulator-driven terms are\ntraining-only and do not modify the reverse process.\nInference. Given conditioning c, we draw zT ∼N(0, I) and apply the learned reverse diffusion\nfrom t = T to 1 with the standard DDPM parameterization (variance schedule {βt}, αt = 1 −βt,\n¯αt = Qt\ns=1 αs):\nˆz0(zt, t, c) = zt −√1 −¯αt ϵϑ(zt, t, c)\n√¯αt\n,\n(24)\n6\n"}, {"page": 7, "text": "Preprint\nµϑ(zt, t, c) =\n1\n√αt\n\u0012\nzt −\nβt\n√1 −¯αt\nϵϑ(zt, t, c)\n\u0013\n.\n(25)\nWe set ˜βt = 1−¯αt−1\n1−¯αt βt and sample zt−1 = µϑ(zt, t, c) +\nq\n˜βt ξt with ξt ∼N(0, I). After the final\nstep, we decode to the signal domain, ˆx = Dθ(ˆz0), optionally using classifier-free guidance during\nsampling.\n4\nEXPERIMENTS\nDataset and Preprocessing. We train on MIMIC-IV-ECG (Gow et al., 2023; Johnson et al.,\n2023), which contains 800,035 de-identified 12-lead, 10 s ECGs sampled at 500 Hz. Heart rate\n(HR) is taken from metadata when available; otherwise it is re-estimated via QRS detection (WFDB\nXQRS). Waveforms are encoded by a VAE into 4 × 128 latents that serve as inputs to the diffusion\nmodel. We use the MIMIC-IV-Clinical (Johnson et al., 2023) to obtain each patient’s EHR for\nexperience knowledge conditioning.\nBaselines. We compare against DiffuSETS (Lai et al., 2025a), to our knowledge the only prior\nmethod that generates 12-lead, 10 s ECGs from clinical text. To quantify the contribution of each\ncomponent of SE-Diff, we report ablations trained under identical schedules and seeds: (i) SE-\nDiff w/o Sim (removing the Euler consistency term LEuler); (ii) SE-Diff w/o InterLead (dropping\nLinter-lead); (iii) SE-Diff w/o Exp (disabling EHR retrieval and LLM distillation so conditioning\nuses only text+metadata).\n4.1\nECG GENERATION RESULTS\nWe evaluate SE-Diff at three clinically aligned levels: signal-level stability, feature-level physiology,\nand diagnostic/semantic alignment. At each level we define the metrics and report aggregate results.\nSignal-level Stability. Given matched real and generated ECGs (x, ˆx) under the same condition c,\nwe compute per-lead mean absolute error (MAE), normalized root mean squared error (NRMSE),\nand Pearson correlation r to assess waveform fidelity and temporal consistency.\nFeature-level Physiology. To evaluate preservation of basic physiology, we compare heart rate (HR)\nestimated from ˆx and x via the absolute error MAEHR.\nDiagnostic Alignment. We adopt a CLIP-style evaluation for ECG–text pairs: an ECG encoder\nfecg(·) and a text encoder ftext(·) produce ℓ2-normalized embeddings; cosine similarity quantifies\nalignment, s(x, text) = ⟨fecg(x), ftext(text)⟩. To control encoder bias, we report the relative CLIP\nscore and the relative Fr´echet distance:\nrCLIP = s(ˆx, text)\ns(x, text)\nrFID\n=\nFID( ˆ\nX, Xr)\nFID(X (1)\nr\n, X (2)\nr\n)\n.\n(26)\nDistributional coverage/quality is measured with the Fr´echet distance in the ECG embedding space,\nFID = ∥µr −µg∥2\n2+Tr\n\u0000Σr +Σg −2(ΣrΣg)1/2\u0001\n, where (µr, Σr) and (µg, Σg) denote the mean and\ncovariance of real and generated ECG embeddings, ˆ\nX denotes generated samples, and X (1)\nr\n, X (2)\nr\nare disjoint splits of the real set.\nTable 1: ECG generation performance.\nModel\nMAE ↓\nNRMSE ↓\nMAEHR ↓\nrCLIP Score ↑\nrFID Score ↑\nDiffuSETS\n0.1092\n0.0851\n13.29\n0.9309\n0.9209\nSE-Diff (ours)\n0.0923\n0.0714\n8.43\n0.9470\n0.9509\nSE-Diff w/o Exp\n0.0926\n0.0730\n15.06\n0.9099\n0.9032\nSE-Diff w/o InterLead\n0.0934\n0.0733\n19.21\n0.9216\n0.9128\nSE-Diff w/o Sim\n0.0965\n0.0768\n14.28\n0.9303\n0.9138\n7\n"}, {"page": 8, "text": "Preprint\n4.2\nDOWNSTREAM ECG CLASSIFICATION\nWe evaluate whether SE-Diff mitigates severe class imbalance in downstream ECG classification by\naugmenting minority classes with model-generated ECGs. Training distributions are intentionally\nskewed; evaluation uses a fixed, class-balanced test set. We compare four regimes: (i) Unbalanced\n(real-only, skewed), (ii) Balanced (real-only, fully balanced; reference upper bound), (iii) DiffuSETS\naugmentation, and (iv) SE-Diff. Metrics include F1, accuracy (Acc.), and AUROC (AUC).\nImbalanced Gender Classification. We train a binary classifier to predict sex (Female vs. Male).\nAs shown in Table 2, latent-space minority synthesis substantially recovers performance lost to sex\nimbalance, even when only 10% of real Male samples are available. SE-Diff narrows the gap to the\nBalanced upper bound and consistently outperforms DiffuSETS under the same skew.\nRare-disease Classification. We train a classifier to distinguish Sinus rhythm from supraventricular\ntachycardia (SVT), treating SVT as the minority class. Table 2 shows larger relative gains on SVT,\nindicating that synthetic augmentation is particularly effective when physiological heterogeneity is\nhigh and labeled minority examples are scarce.\nTable 2: Downstream ECG classification under severe class imbalance.\nModel\nMale = 10% Female\nSVT = 10% Sinus\nF1 (%, ↑)\nAcc. (%, ↑)\nAUC (%, ↑)\nF1 (%, ↑)\nAcc. (%, ↑)\nAUC (%, ↑)\nDiffuSETS\n44\n54\n54\n70\n68\n84\nSE-Diff (ours)\n58\n58\n58\n72\n71\n85\nUnbalanced\n42\n54\n46\n56\n62\n80\nBalanced\n62\n62\n62\n79\n80\n93\n4.3\nMECHANISTIC ANALYSIS OF SE-DIFF\nNoise Scheduling Analysis. Figure 2 summarizes the forward process under our linear noise sched-\nule. Panel (a) shows the per-step noise increment increasing steadily, while (b) displays the corre-\nsponding signal retention factor decreasing slightly each step. The cumulative signal fraction in (c)\ndrops smoothly from near one to near zero, and the accumulated noise in (d) rises monotonically\nand saturates in late timesteps. This profile yields a gradual, well-conditioned reverse trajectory:\nearly steps recover global rhythm and cross-lead coherence, and later steps refine P/QRS/T mor-\nphology and suppress residual artifacts. We therefore adopt this schedule for SE-Diff as it offers an\ninterpretable progression and stable behavior across sampling budgets.\n(a) Beta Schedule βt\n(b) Alpha Schedule αt\n(c) Alpha Cumprod ¯αt\n(d) Noise Level 1 −¯αt\nFigure 2: Noise scheduling analysis showing the progression of noise and signal factors throughout\nthe diffusion process.\nCase Study for ECG Simulator. To visualize the simulator’s morphology, Fig. 3 presents four\nrandom single-cycle templates (one lead per label): (A) Sinus rhythm, Lead I. Upright P wave, nar-\nrow QRS complex, and concordant T wave provide a clean normal reference for comparison. (B)\nVentricular pacing, Lead V1. A wide, predominantly negative QRS complex (QS/deep S), reflect-\ning pacing/LBBB-like activation, clearly departs from normal conduction. (C) Sinus rhythm with\nfirst-degree AV block, Lead II. A P wave followed by an elongated isoelectric segment before the\nQRS complex qualitatively indicates PR-interval prolongation. (D) Consider acute ST-elevation MI,\nLead V3. Convex ST-segment elevation after the J point is characteristic of anteroseptal involve-\nment. The simulator serves as a morphology prior and qualitative oracle within SE-Diff, enabling\n8\n"}, {"page": 9, "text": "Preprint\nclear visual audits and morphology-aware ablations without confounding rhythm variability, and\nproviding guidance to the diffusion model.\n(a) Lead I\n(b) Lead V1\n(c) Lead II\n(d) Lead V3\nFigure 3: Representative single-cycle ECG waveforms generated from our simulator. Panel A: sinus\nrhythm (Lead I). Panel B: ventricular pacing (Lead V1). Panel C: sinus rhythm with first-degree AV\nblock (Lead II). Panel D: consider acute ST-elevation MI (Lead V3).\nCase Study for ECG Generation. Figure 4 compares a 10 s, 12-lead ECG generated by SE-Diff\nwith its paired reference for a case conditioned on “Sinus rhythm” (male, 65 y, HR 94 bpm). The\ngeneration preserves canonical sinus morphology—each P wave preceding a narrow QRS com-\nplex with an appropriate PR interval—and shows coherent R-wave progression across the precordial\nleads, with R–R intervals consistent with the target rate. Clinically, the SE-Diff tracing appears\ncleaner than the reference: baseline wander and high-frequency artifacts are attenuated, yielding\ncrisper ST segments and T-wave contours without distorting morphology. This qualitative finding\naligns with the model’s design: simulator-informed constraints and experience-augmented condi-\ntioning steer the diffusion process toward physiologically plausible, low-noise signals.\n(a) SE-Diff ECG.\n(b) Real ECG.\nFigure 4: Case Study for ECG Generation.\n5\nCONCLUSION\nWe introduced SE-Diff, a conditional latent-diffusion framework for 10,s, 12-lead ECG synthe-\nsis that couples a VAE latent space with a Beat Decoder and simulator-informed regularizers, and\nstrengthens conditioning via experience retrieval from EHRs. Across benchmarks, SE-Diff improves\nsignal fidelity, preserves inter-lead physiology, and achieves tighter diagnostic/semantic alignment,\nwhile also enhancing downstream classification when used for data augmentation. Ablations con-\nfirm that both the ODE-based guidance (Euler and inter-lead constraints) and retrieval-augmented\nconditioning contribute materially to performance. Future work will extend SE-Diff to more clin-\nically meaningful applications (e.g., arrhythmia risk stratification, therapy response modeling, and\nlong-term ambulatory ECG) and evaluate robustness across institutions and rare presentations. We\nbelieve SE-Diff offers a principled step toward physiologically grounded, clinically aligned genera-\ntive modeling of ECGs.\n9\n"}, {"page": 10, "text": "Preprint\n6\nETHICS STATEMENT\nThis study uses only de-identified data from MIMIC-IV-ECG (Gow et al., 2023; Johnson et al.,\n2023) and associated de-identified records from MIMIC-IV-CLINICAL (Johnson et al., 2023) un-\nder the applicable Data Use Agreements and credentialed-access requirements. No direct interac-\ntion with human subjects occurred; no personally identifiable information (PII/PHI) was accessed\nor released, and we made no attempt at re-identification. Heart-rate estimation (WFDB XQRS), re-\nsampling, and VAE-based encoding were performed on the de-identified waveforms; EHR linkage\nrelied only on the dataset’s de-identified subject and admission keys within documented admission\nwindows. This work is for research purposes only and is not a medical device. No conflicts of\ninterest or sensitive sponsorships are present.\n7\nREPRODUCIBILITY STATEMENT\nAll information necessary to reproduce our results is documented in Appendix A.4, including dataset\ncuration and preprocessing, model architectures, training and inference hyperparameters and sched-\nules, and so on.\nREFERENCES\nValtino X Afonso, Willis J Tompkins, Truong Q Nguyen, and Shen Luo. Ecg beat detection using\nfilter banks. IEEE transactions on biomedical engineering, 46(2):192–202, 1999.\nVitalii Bondar, Serhii Semenov, Vira Babenko, and Dmytro Holovniak. Flowecg: Using flow match-\ning to create a more efficient ecg signal generator. arXiv preprint arXiv:2509.10491, 2025. URL\nhttps://arxiv.org/abs/2509.10491. To appear in Sensors, Devices and Systems –\n2025 Proceedings.\nJohn Charles Butcher and JC Butcher. The numerical analysis of ordinary differential equations:\nRunge-Kutta and general linear methods, volume 512. Wiley New York, 1987.\nRicky T. Q. Chen, Yulia Rubanova, Jesse Bettencourt, and David Duvenaud. Neural ordinary dif-\nferential equations. In Advances in Neural Information Processing Systems (NeurIPS), 2018.\nPhilip De Chazal, Maria O’Dwyer, and Richard B Reilly. Automatic classification of heartbeats\nusing ecg morphology and heartbeat interval features. IEEE transactions on biomedical engi-\nneering, 51(7):1196–1206, 2004.\nTomer Golany, Gal Lavee, Shai Tejman Yarden, and Kira Radinsky. Improving ecg classification\nusing generative adversarial networks. In Proceedings of the AAAI Conference on Artificial Intel-\nligence, 2020a.\nTomer Golany, Kira Radinsky, and Daniel Freedman. Simgans: Simulator-based generative adver-\nsarial networks for ecg synthesis to improve deep ecg classification. In International Conference\non Machine Learning, pp. 3597–3606. PMLR, 2020b.\nTomer Golany, Daniel Freedman, and Kira Radinsky. ECG ODE-GAN: Learning ordinary differen-\ntial equations of ECG dynamics via generative adversarial learning. In Proceedings of the AAAI\nConference on Artificial Intelligence, volume 35, pp. 134–141, 2021. doi: 10.1609/aaai.v35i1.\n16086.\nAry L. Goldberger, Luis A. N. Amaral, Leon Glass, Jeffrey M. Hausdorff, Plamen Ch. Ivanov,\nRoger G. Mark, Joseph E. Mietus, George B. Moody, Chung-Kang Peng, and H. Eugene Stanley.\nPhysiobank, physiotoolkit, and physionet: Components of a new research resource for complex\nphysiologic signals. Circulation, 101(23):e215–e220, 2000. doi: 10.1161/01.CIR.101.23.e215.\nBrian Gow, Benjamin Moody, Lucas Bulgarelli, Alistair E. W. Johnson, Li-wei H. Lehman, and\nRoger G. Mark. Mimic-iv-ecg: A publicly available database of real-world 12-lead ecgs. Phys-\nioNet, 2023.\n10\n"}, {"page": 11, "text": "Preprint\nKaiqiao Han, Yi Yang, Zijie Huang, Xuan Kan, Ying Guo, Yang Yang, Lifang He, Liang Zhan,\nYizhou Sun, Wei Wang, et al. Brainode: Dynamic brain signal analysis via graph-aided neural\nordinary differential equations. In 2024 IEEE EMBS International Conference on Biomedical and\nHealth Informatics (BHI), pp. 1–8. IEEE, 2024.\nTae-Seong Han, Jae-Wook Heo, Hakseung Kim, Cheol-Hui Lee, Hyub Huh, Eue-Keun Choi,\nHye Jin Kim, and Dong-Joo Kim. Diffusion-based electrocardiography noise quantification via\nanomaly detection. arXiv preprint arXiv:2506.11815, 2025.\nTiankai Hang, Shuyang Gu, Chen Li, Jianmin Bao, Dong Chen, Han Hu, Xin Geng, and Baining\nGuo. Efficient diffusion training via min-snr weighting strategy. In Proceedings of the IEEE/CVF\ninternational conference on computer vision, pp. 7441–7451, 2023.\nAwni Y Hannun, Pranav Rajpurkar, Masoumeh Haghpanahi, Geoffrey H Tison, Cody Bourn,\nMintu P Turakhia, and Andrew Y Ng. Cardiologist-level arrhythmia detection and classifica-\ntion in ambulatory electrocardiograms using a deep neural network. Nature Medicine, 25(1):\n65–69, 2019. doi: 10.1038/s41591-018-0268-3.\nJonathan Ho and Tim Salimans. Classifier-free diffusion guidance, 2022.\nJonathan Ho, Ajay Jain, and Pieter Abbeel. Denoising diffusion probabilistic models. In Advances\nin Neural Information Processing Systems (NeurIPS), 2020.\nAlistair E. W. Johnson, Lucas Bulgarelli, Lu Shen, Alvin Gayles, Ayad Shammout, Steven Horng,\nTom J. Pollard, Sicheng Hao, Benjamin Moody, Brian Gow, Li-wei H. Lehman, Leo A. Celi, and\nRoger G. Mark. Mimic-iv, a freely accessible electronic health record dataset. Scientific Data, 10\n(1):1, 2023. doi: 10.1038/s41597-022-01899-x.\nMohammad Kachuee, Shayan Fazeli, and Majid Sarrafzadeh. Ecg heartbeat classification: A deep\ntransferable representation. In 2018 IEEE International Conference on Healthcare Informatics\n(ICHI), pp. 443–444. IEEE, 2018.\nPaul Kligfield, Leonard S Gettes, James J Bailey, Rory Childers, Barbara J Deal, E. William\nHancock, Gerard van Herpen, Jan A Kors, Peter Macfarlane, David M Mirvis, and et al.\nRecommendations for the standardization and interpretation of the electrocardiogram:\nPart\ni: The electrocardiogram and its technology.\nCirculation, 115(10):1306–1324, 2007.\ndoi:\n10.1161/CIRCULATIONAHA.106.180200.\nYongfan Lai, Jiabo Chen, Qinghao Zhao, Deyun Zhang, Yue Wang, Shijia Geng, Hongyan Li, and\nShenda Hong. Diffusets: 12-lead ecg generation conditioned on clinical text reports and patient-\nspecific information. Patterns, 2025a.\nYongfan Lai, Bo Liu, Xinyan Guan, Qinghao Zhao, Hongyan Li, and Shenda Hong. Ecgtwin: Per-\nsonalized ecg generation using controllable diffusion model. arXiv preprint arXiv:2508.02720,\n2025b.\nByeong Tak Lee, Yong-Yeon Jo, and Joon-Myoung Kwon. Optimizing neural network scale for ecg\nclassification. arXiv preprint arXiv:2308.12492, 2023.\nPatrick Lewis, Ethan Perez, Aleksandra Piktus, Fabio Petroni, Vladimir Karpukhin, Naman Goyal,\nHeinrich K¨uttler, Mike Lewis, Wen-tau Yih, Tim Rockt¨aschel, Sebastian Riedel, and Douwe\nKiela. Retrieval-augmented generation for knowledge-intensive NLP tasks. In Advances in Neural\nInformation Processing Systems (NeurIPS), volume 33, pp. 9459–9474, 2020.\nDawei Li, Tienan Chen, Cong Liu, Liqi Liao, Shaoping Chen, Yongqiang Cui, Li Zhang, Yiyu Shi,\nand Xiaowei Xu. Semi-supervised gan for enhancing electrocardiogram time series diagnostics.\nBiomedical Signal Processing and Control, 110:108058, 2025.\nZewen Liu, Xiaoda Wang, Bohan Wang, Zijie Huang, Carl Yang, and Wei Jin. Graph odes and be-\nyond: A comprehensive survey on integrating differential equations with graph neural networks.\nIn Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining\nV. 2, pp. 6118–6128, 2025.\n11\n"}, {"page": 12, "text": "Preprint\nJuan Miguel Lopez Alcaraz and Nils Strodthoff. Diffusion-based conditional ECG generation with\nstructured state space models. Computers in Biology and Medicine, 163:107115, 2023. doi:\n10.1016/j.compbiomed.2023.107115.\nMarek Malik. Heart rate variability: Standards of measurement, physiological interpretation, and\nclinical use: Task force of the european society of cardiology and the north american society for\npacing and electrophysiology. Annals of Noninvasive Electrocardiology, 1(2):151–181, 1996.\nMarek Malik and A John Camm. Heart rate variability. Clinical cardiology, 13(8):570–576, 1990.\nSamira Mavaddati. Ecg arrhythmias classification based on deep learning methods and transfer\nlearning technique. Biomedical Signal Processing and Control, 101:107236, 2025.\nPatrick E McSharry, Gari D Clifford, Lionel Tarassenko, and Leonard A Smith. A dynamical model\nfor generating synthetic electrocardiogram signals. IEEE transactions on biomedical engineering,\n50(3):289–294, 2003.\nLouis Melville Milne-Thomson. The calculus of finite differences. American Mathematical Soc.,\n2000.\nVolodymyr Mnih, Koray Kavukcuoglu, David Silver, Alex Graves, Ioannis Antonoglou, Daan Wier-\nstra, and Martin Riedmiller.\nPlaying atari with deep reinforcement learning.\narXiv preprint\narXiv:1312.5602, 2013.\nNasser M Nasrabadi. Pattern recognition and machine learning. Journal of electronic imaging, 16\n(4):049901, 2007.\nNour Neifar, Achraf Ben-Hamadou, Afef Mdhaffar, and Mohamed Jmaiel. DiffECG: A versatile\nprobabilistic diffusion model for ECG signals synthesis, 2023. Accepted at IEEE SERA 2024.\nAlexander Quinn Nichol and Prafulla Dhariwal. Improved denoising diffusion probabilistic models.\nIn Proceedings of the 38th International Conference on Machine Learning (ICML), volume 139\nof Proceedings of Machine Learning Research, pp. 8162–8171. PMLR, 2021.\nJustice Ou, Tinglin Huang, Yilun Zhao, Ziyang Yu, Peiqing Lu, and Rex Ying. Experience retrieval-\naugmentation with electronic health records enables accurate discharge qa.\narXiv preprint\narXiv:2503.17933, 2025.\nEthan Perez, Florian Strub, Harm de Vries, Vincent Dumoulin, and Aaron Courville. Film: Visual\nreasoning with a general conditioning layer. In Proceedings of the AAAI Conference on Artificial\nIntelligence, volume 32, 2018.\nChristopher Rackauckas, Yingbo Ma, Julius Martensen, Collin Warner, Kirill Zubov, Rohit Supekar,\nDominic Skinner, and Ali Ramadhan.\nUniversal differential equations for scientific machine\nlearning. Proceedings of the National Academy of Sciences, 118(46):e210702118, 2021. doi:\n10.1073/pnas.210702118.\nPranav Rajpurkar, Awni Y. Hannun, Masoumeh Haghpanahi, Codie Bourn, and Andrew Y. Ng.\nCardiologist-level arrhythmia detection with convolutional neural networks. CoRR, 2017.\nRobin Rombach, Andreas Blattmann, Dominik Lorenz, Patrick Esser, and Bj¨orn Ommer. High-\nresolution image synthesis with latent diffusion models. In Proceedings of the IEEE/CVF Con-\nference on Computer Vision and Pattern Recognition (CVPR), pp. 10684–10695, 2022.\nOlaf Ronneberger, Philipp Fischer, and Thomas Brox. U-net: Convolutional networks for biomed-\nical image segmentation. In Medical Image Computing and Computer-Assisted Intervention –\nMICCAI 2015, volume 9351 of Lecture Notes in Computer Science, pp. 234–241. Springer, 2015.\ndoi: 10.1007/978-3-319-24574-4 28.\nGregory A Roth, George A Mensah, Catherine O Johnson, and et al. Global burden of cardiovascular\ndiseases and risk factors, 1990–2019. Journal of the American College of Cardiology, 76(25):\n2982–3021, 2020. doi: 10.1016/j.jacc.2020.11.010.\n12\n"}, {"page": 13, "text": "Preprint\nYuling Sang, Abhirup Banerjee, Marcel Beetz, and Vicente Grau. Deep conditional generative model\nfor personalization of 12-lead electrocardiograms and cardiovascular risk prediction. Frontiers in\nDigital Health, 7:1558589, 2025.\nAshish Shrivastava, Tomas Pfister, Oncel Tuzel, Joshua Susskind, Wenda Wang, and Russell Webb.\nLearning from simulated and unsupervised images through adversarial training. In Proceedings\nof the IEEE conference on computer vision and pattern recognition, pp. 2107–2116, 2017.\nJascha Sohl-Dickstein, Eric A. Weiss, Niru Maheswaranathan, and Surya Ganguli. Deep unsuper-\nvised learning using nonequilibrium thermodynamics. In Proceedings of the 32nd International\nConference on Machine Learning (ICML), volume 37 of Proceedings of Machine Learning Re-\nsearch, pp. 2256–2265. PMLR, 2015.\nYang Song, Jascha Sohl-Dickstein, Diederik P. Kingma, Abhishek Kumar, Stefano Ermon, and Ben\nPoole. Score-based generative modeling through stochastic differential equations. In Interna-\ntional Conference on Learning Representations (ICLR), 2021.\nLeif S¨ornmo and Pablo Laguna. Bioelectrical signal processing in cardiac and neurological appli-\ncations, volume 8. Academic Press, 2005.\nEndre S¨uli and David F Mayers. An introduction to numerical analysis. Cambridge university press,\n2003.\nTask Force of the European Society of Cardiology and the North American Society of Pacing and\nElectrophysiology. Heart rate variability: Standards of measurement, physiological interpretation,\nand clinical use. Circulation, 93(5):1043–1065, 1996. doi: 10.1161/01.CIR.93.5.1043.\nVineeth Thambawita, Jonas L Isaksen, Steven Hicks, Jonas Ghouse, Gustav Ahlberg, Allan Lin-\nneberg, Niels Grarup, Christina Ellervik, Morten S Olesen, Tobias Hansen, Claus Graff, et al.\nDeepfake electrocardiograms using generative adversarial networks are the beginning of the\nend for privacy issues in medicine.\nScientific Reports, 11(1):21896, 2021.\ndoi: 10.1038/\ns41598-021-01295-2.\nAshish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N. Gomez,\nŁukasz Kaiser, and Illia Polosukhin. Attention is all you need. In Advances in Neural Infor-\nmation Processing Systems (NeurIPS), volume 30, 2017.\nPatrick Wagner, Nils Strodthoff, Ralf-Dieter Bousseljot, David Kreiseler, Felix I Lunze, Wojciech\nSamek, and Tobias Schaeffter. PTB-XL, a large publicly available electrocardiography dataset.\nScientific Data, 7(1):154, 2020. doi: 10.1038/s41597-020-0495-6.\nChuanjiang Wang, Junhao Ma, Guohui Wei, and Xiujuan Sun. Analysis of cardiac arrhythmias\nbased on resnet-icbam-2dcnn dual-channel feature fusion. Sensors, 25(3):661, 2025a.\nXiaoda Wang, Yuji Zhao, Kaiqiao Han, Xiao Luo, Sanne van Rooij, Jennifer Stevens, Lifang He,\nLiang Zhan, Yizhou Sun, Wei Wang, et al. Conditional neural ode for longitudinal parkinson’s\ndisease progression forecasting. In Abstract in the Organization for Human Brain Mapping An-\nnual Meeting, 2025b.\nXiaoda Wang, Yuji Zhao, Kaiqiao Han, Xiao Luo, Sanne van Rooij, Jennifer Stevens, Lifang He,\nLiang Zhan, Yizhou Sun, Wei Wang, et al.\nConditional neural ode for longitudinal parkin-\nson’s disease progression forecasting. In IEEE International Conference on Bioinformatics and\nBiomedicine (BIBM), 2025c.\nDean Zadok, Tom Hirshberg, Amir Biran, Kira Radinsky, and Ashish Kapoor. Explorations and\nlessons learned in building an autonomous formula sae car from simulations.\nSIMULTECH,\n2019.\nMd Haider Zama and Friedhelm Schwenker. Ecg synthesis via diffusion-based state space aug-\nmented transformer. Sensors, 23(19):8328, 2023. doi: 10.3390/s23198328.\nBeatrice Zanchi, Giuliana Monachino, Luigi Fiorillo, Giulio Conte, Angelo Auricchio, Athina Tzo-\nvara, and Francesca D Faraci. Synthetic ecg signals generation: A scoping review. Computers in\nBiology and Medicine, 184:109453, 2025.\n13\n"}, {"page": 14, "text": "Preprint\nA\nAPPENDIX\nA.1\nUSE OF LARGE LANGUAGE MODELS\nWe used a large language model (LLM) solely for writing assistance—specifically, to correct gram-\nmar, improve wording, and enhance clarity. The LLM did not contribute to research design, data\nanalysis, modeling, experiments, or interpretation of results. All technical content and conclusions\nwere authored and verified by the authors, who take full responsibility for the manuscript.\nA.2\nRELATED WORK\nA.2.1\nGENERATIVE MODELS FOR ECG\nSimulation has repeatedly improved data efficiency in sequential decision making—both in imita-\ntion learning and in reinforcement learning—by narrowing the gap between training and deployment\n(Zadok et al., 2019; Mnih et al., 2013). In parallel, generative models have been used to expand train-\ning corpora: in vision, SimGAN refines synthetic images with unlabeled real data (Shrivastava et al.,\n2017); in cardiology, augmenting classifiers with GAN-generated heartbeats improves performance\n(Golany et al., 2020a). Beyond beat-level augmentation, adversarial models have produced realistic\nmulti-lead “DeepFake” ECGs for privacy and data scarcity mitigation (Thambawita et al., 2021),\nand mechanism-aware variants embed ordinary differential equations to better capture depolariza-\ntion–repolarization dynamics (Golany et al., 2021). However, GANs can be unstable and prone\nto mode collapse in multi-lead, multi-label regimes. Denoising diffusion and score-based models\noffer a likelihood-grounded alternative with strong mode coverage and stable training (Ho et al.,\n2020; Song et al., 2021). Recent ECG adaptations include conditional diffusion with structured\nstate-space backbones (SSSD-ECG) (Lopez Alcaraz & Strodthoff, 2023), generalized diffusion for\ngeneration/imputation/forecasting (Neifar et al., 2023), state-space/transformer hybrids (Zama &\nSchwenker, 2023), and text/metadata-conditioned synthesis (DiffuSETS) (Lai et al., 2025a). The\nfield is also trending toward personalization and physiological consistency: conditional models in-\ncorporate patient metadata or anatomy to produce more plausible 12-lead signals (Sang et al., 2025),\nand diffusion frameworks create patient “digital twins” (Lai et al., 2025b). Hybrid uses couple gen-\nerative modeling with signal-quality assessment and anomaly detection (Han et al., 2025), while\nsemi-supervised GANs aim to better capture temporal dynamics (Li et al., 2025). Very recent work\nexplores flow-matching as a faster alternative to iterative diffusion for ECG synthesis, reducing\nsampling cost while targeting comparable fidelity (Bondar et al., 2025).\nA.2.2\nPHYSIOLOGICAL ECG SIMULATORS\nCompact physiological simulators capture stereotyped P–QRS–T morphology with low-dimensional\ndifferential equations. The canonical ECGSYN model uses a three-dimensional limit-cycle oscil-\nlator whose phase-locked Gaussian components generate P, QRS, and T deflections, while stochas-\ntic control of instantaneous heart rate reproduces realistic RR patterns and HRV statistics (e.g.,\nmean/SD of RR, low- and high-frequency spectral peaks) (McSharry et al., 2003; Task Force of the\nEuropean Society of Cardiology and the North American Society of Pacing and Electrophysiology,\n1996). Open implementations (e.g., PhysioNet ECGSYN) enable reproducible waveform synthesis\nand stress-testing (Goldberger et al., 2000). However, globally fixed morphology templates and lin-\near lead projections limit expressivity under rhythm changes, conduction abnormalities, and nonsta-\ntionary repolarization. Hybrid approaches mitigate these issues by coupling mechanistic priors with\nlearnable components—via neural ODEs or universal differential equations—to preserve physical\nstructure while fitting data Wang et al. (2025b;c); Liu et al. (2025); Han et al. (2024); conditioning\non anatomy further improves inter-lead realism (Chen et al., 2018; Rackauckas et al., 2021; Sang\net al., 2025).\nA.2.3\nECG CLASSIFICATION\nClassical ECG pipelines segment signals into beats with robust QRS detectors (e.g., Pan–Tompkins;\nAfonso et al.) and derive interval/morphology descriptors before applying shallow classifiers such as\nlinear discriminants or SVMs (Afonso et al., 1999; De Chazal et al., 2004; Nasrabadi, 2007). With\ndeep learning, end-to-end models on raw waveforms supplanted hand-crafted features and reached\n14\n"}, {"page": 15, "text": "Preprint\ncardiologist-level performance in single- and ambulatory-lead arrhythmia detection (Rajpurkar et al.,\n2017; Hannun et al., 2019); at the beat level, residual CNNs are particularly effective, and large\nmulti-lead corpora such as PTB-XL have enabled high-capacity models and rigorous multi-label\nbenchmarking (Kachuee et al., 2018; Wagner et al., 2020). Recent work refines architectures and\ntraining regimes—dual-channel networks that fuse ResNet-ICBAM with 2D-CNN features empha-\nsize region-of-interest cues (Wang et al., 2025a), ECG-specific scaling laws suggest shallower but\nwider networks outperform vision-oriented designs (Lee et al., 2023), and transfer learning on trans-\nformed signals improves performance under class imbalance (Mavaddati, 2025). Synthetic data from\nGANs and diffusion models is now routinely used for augmentation, with semi-supervised variants\nfurther boosting diagnostic accuracy (Li et al., 2025). In our experiments, we adopt a strong ResNet\nheartbeat classifier and evaluate whether simulator-enhanced diffusion synthesis (SE-Diff) improves\ngeneralization under class imbalance and limited labels by augmenting training with physiologically\nplausible, label-consistent synthetic beats.\nA.3\nECG SIMULATOR CALIBRATION WITH STABILIZERS AND MORPHOLOGY PRIORS\nMotivation. Naive least-squares calibration of the ODE-based simulator (Sec. 2.2) often fits the\nsharp QRS complex yet drifts later in the window and may flip polarity. The main causes are\nsmall baseline trends and scale mismatches between simulated and observed signals, and an under-\nconstrained morphology (especially T-wave width). We introduce lightweight, differentiable sta-\nbilizers that improve convergence and yield physiologically plausible parameters without altering\nsimulator dynamics.\nTrend-aware alignment and fidelity. Let zη(t) denote the simulated voltage with parameters η.\nRather than compare zη directly to the observation y(t), align via a three-parameter affine–trend\nmodel with scale s, offset c, and linear trend b:\nˆy(t) = c + s zη(t) + b\n\u0000t −¯t\n\u0001\n,\n¯t = 1\nT\nT\nX\nt=1\nt.\n(27)\nAt each iteration (c, s, b) are obtained by least squares and are differentiable in zη. The fidelity term\nis\nLmse(η) = 1\nT\nT\nX\nt=1\n\u0000ˆy(t) −y(t)\n\u00012,\n(28)\naugmented by a small scale regularizer to prevent rare runaway gains:\nLs(η) = λs s2,\nλs ∈[10−6, 10−5].\n(29)\nMorphology priors (widths and amplitudes). Using the McSharry parameterization, each deflec-\ntion β ∈{P, Q, R, S, T} has amplitude aβ, width bβ > 0, and phase θβ. Enforce positivity with\nbβ = softplus(˜bβ) + ε (ε = 10−3) and shrink widths toward physiological targets b⋆\nβ:\nLwidth(η) = λb\nX\nβ\nwβ\n\u0000bβ −b⋆\nβ\n\u00012,\n(b⋆\nP , b⋆\nQ, b⋆\nR, b⋆\nS, b⋆\nT ) = (0.20, 0.08, 0.10, 0.08, 0.32),\n(30)\nwith wT = 2 and wβ = 1 otherwise to prevent absorbing baseline drift via an overly broad T wave.\nA mild amplitude penalty\nLamp(η) = λa\nX\nβ\na2\nβ\n(31)\ndiscourages attributing variability solely to the global scale s in Eq. 27.\nPhase ordering. To preserve the physiological ordering of {P, Q, R, S, T} on the unit circle, in-\ntroduce a global phase shift ∆θ and wrap phases as θβ ←wrap(˜θβ + ∆θ). A hinge penalty with\nmargin m enforces monotonicity:\nLord(η) = λord\n4\nX\ni=1\nmax\n\b\n0, θi −θi+1 + m\n\t\n,\nm ≈0.05 rad.\n(32)\nThis term typically decays after a few epochs and can be disabled once ordering stabilizes.\n15\n"}, {"page": 16, "text": "Preprint\nObjective and optimization. The calibration loss is\nL(η) = Lmse + Ls + Lwidth + Lamp + Lord.\n(33)\nOptimize with AdamW (cosine decay with warmup), followed by a brief L-BFGS refinement. The\nsame Euler sub-stepping and burn-in used at inference are applied during training to maintain inte-\ngrator consistency.\nPolarity canonicalization (post hoc). Because lead inversions are common, canonicalize polar-\nity after fitting: re-simulate zη, re-estimate ˆy(t) = c + s zη(t) (no slope), and, if s < 0, flip all\namplitudes {aβ} once. This step is outside the loss and standardizes reported parameters.\nDefault hyperparameters. Unless specified otherwise, use λb = 5×10−3 (with wT =2), λa =\n4×10−4, λord = 10−4, λs = 10−6, m = 0.05, and ε = 10−3. These values are deliberately\nweak—sufficient to avoid the systematic drifts above without overriding the data.\nTrend-aware alignment absorbs baseline wander, width priors (especially for T) prevent compen-\nsatory morphology stretching, the small scale penalty stabilizes gain, and the optional ordering term\nremoves rare phase crossings. Together, these stabilizers reduce late-window drift and polarity mis-\nmatches while preserving interpretable parameters {aβ, bβ, θβ}.\nA.4\nIMPLEMENTATION DETAILS.\nAll models are trained in PyTorch with AMP on a single NVIDIA H200 using AdamW (lr 1 × 10−4\nwith cosine decay to 1 × 10−5), gradient clipping/accumulation (global batch 4096), for 200\nepochs with early stopping. Diffusion uses T=1000 steps, linear βt ∈[8.5×10−4, 1.2×10−2]\n(DDPMScheduler), and classifier-free guidance.\nThe VAE has 4 latent channels; the en-\ncoder/decoder are multi-resolution with residual blocks, attention, and skip connections; training\nuses LMSE + LKL (λKL=1). A lightweight mini-decoder predicts the first beat (Lc=300 at 500 Hz;\nR-peaks via NeuroKit2). The denoiser is a 7-stage 1D U-Net (kernel 7) with self/cross-attention\n(8 heads, width 16–64) consuming text embeddings (1536-d) plus metadata (age, sex, heart rate).\nPhysiology-aware training adds the Euler simulator loss (λ=3×10−3) and the inter-lead constraint\n(γ=5×10−2); class-wise simulator parameters η are prefit from 200 beats/label. Waveforms are en-\ncoded to 4-channel latents of length 128; experiments use MIMIC-IV-ECG with simplified rhythm\nlabels.\nWe use MIMIC-IV-ECG with simplified rhythm labels.\nFree-text diagnostic reports are\ncleaned and normalized,\nthen mapped to a compact multi-label taxonomy (e.g.,\nsinus\nrhythm/brady/tachy, atrial fibrillation/flutter, PAC/PVC, bundle-branch block, LVH/RVH, prolonged\nQT, ST/T abnormalities, ischemia/infarct). Reports are embedded with a pretrained text encoder\n(text-embedding-ada-002). For simulator-informed diffusion, we pre-compute class-wise\nsimulator parameters for the top-20 ECG categories and use them during training. For ECG genera-\ntion, we sample 100 waveforms per setting and compute standard signal- and text-alignment metrics.\nFor downstream ECG classification, we form balanced subsets with 200 samples per class from the\nVAE latents (4×128) and train a lightweight MLP that flattens latents (512-d) and applies two fully\nconnected layers (128→64) with BatchNorm, ReLU, and Dropout (0.5), followed by a linear output;\noptimization uses cross-entropy with AdamW and early stopping.\nA.5\nPROMPT EXAMPLE\nThe prompt example in our SE-Diff can be shown in Figure 5.\nA.6\nCONDITIONAL LATENT DIFFUSION—IMPLEMENTATION DETAILS\nContext construction. The context c concatenates (i) token embeddings from the clinical report\nEtext ∈Rm×dc (from a frozen clinical text encoder) and (ii) a single metadata token emeta ∈R1×dc\nformed by projecting age/sex/etc. to dc. We set C = [Etext; emeta] ∈R(m+1)×dc and feed C to\ncross-attention at the bottleneck and (optionally) the two highest-resolution decoder blocks.\nU-Net blocks. Each block consists of Conv(k=3) →GroupNorm →SiLU →Conv(k=3) with a\nresidual connection. Self-attention (multi-head) follows normalization at lower resolutions. Down-\nsampling uses stride-2 convolutions; upsampling uses nearest-neighbor followed by Conv(k=3).\n16\n"}, {"page": 17, "text": "Preprint\n=== DATA PROMPT ===\nOriginal machine-generated diagnosis (most important first): Sinus tachycardia | Normal ECG except for rate\nHeart rate (bpm): 100\nAge (years): 52\nGender: F\nRetrieved similar patients' diagnoses: Sinus rhythm | Normal ECG | Possible ectopic atrial tachycardia \n=== SYSTEM PROMPT ===\nYou are a cardiology-focused language model. Your job is to convert structured inputs into a \nconcise, clinically accurate narrative suitable for a cardiology note. You must not invent findings \nand you must not provide treatment recommendations. You should prioritize the current \npatient's measurements and observations over any retrieved examples from similar patients.\nThe report you generate will serve as the conditioning text for a downstream text-to-ECG \nsynthesis model. Therefore, the narrative must be internally consistent, and physiologically \ngrounded so that it can guide waveform generation.\nYou will receive (1) current patient context, (2) the original machine generated diagnosis, and (3) \nretrieval diagnosis from clinically similar patients. Based on these inputs, you will produce exactly \none paragraph of 60-120 words. Your language should be precise and use standard ECG \nterminology and units so the downstream generator can align text with waveform features.\nFigure 5: Prompt examples.\nWe use K resolution levels (e.g., K=4) and N blocks per level (e.g., N=2); channel width doubles\non downsampling and halves on upsampling.\nAttention. Cross-/self-attention are multi-head with head dimension da (e.g., 8 heads). Queries at\nthe bottleneck attend to keys/values derived from C; text tokens use sinusoidal positional encodings.\nMetadata is represented as a single learned token.\nTime embedding and FiLM. The timestep embedding uses exponentially spaced sinusoids and a two-\nlayer MLP (SiLU) to produce (γt, βt) per block. A small MLP on Pool(C) (token average) yields\n(γc, βc). FiLM is applied after normalization to every residual block.\nTraining setup. We use a cosine noise schedule and optional learned variance (Nichol & Dhari-\nwal, 2021), AdamW with EMA, and classifier-free guidance with unconditional dropout puncond ∈\n[0.1, 0.2] and tuned guidance scale. Min-SNR-γ weighting (Hang et al., 2023) is optional for stabi-\nlizing early and late timesteps. Simulator losses are computed on h = Dbeat\nψ\n(z0) and removed at\ninference.\n17\n"}]}