{"doc_id": "arxiv:2601.01171", "source": "arxiv", "lang": "en", "pdf_path": "data/raw/arxiv/pdf/2601.01171.pdf", "meta": {"doc_id": "arxiv:2601.01171", "source": "arxiv", "arxiv_id": "2601.01171", "title": "Almost Clinical: Linguistic properties of synthetic electronic health records", "authors": ["Serge Sharoff", "John Baker", "David Francis Hunt", "Alan Simpson"], "published": "2026-01-03T12:22:07Z", "updated": "2026-02-03T19:33:22Z", "summary": "This study evaluates the linguistic and clinical suitability of synthetic electronic health records in mental health. First, we describe the rationale and the methodology for creating the synthetic corpus. Second, we examine expressions of agency, modality, and information flow across four clinical genres (Assessments, Correspondence, Referrals and Care plans) with the aim to understand how LLMs grammatically construct medical authority and patient agency through linguistic choices. While LLMs produce coherent, terminology-appropriate texts that approximate clinical practice, systematic divergences remain, including registerial shifts, insufficient clinical specificity, and inaccuracies in medication use and diagnostic procedures. The results show both the potential and limitations of synthetic corpora for enabling large-scale linguistic research otherwise impossible with genuine patient records.", "query": "(cat:cs.CL OR cat:cs.LG) AND (all:\"large language model\" OR all:LLM) AND (all:medical OR all:clinical OR all:healthcare)", "url_abs": "http://arxiv.org/abs/2601.01171v2", "url_pdf": "https://arxiv.org/pdf/2601.01171.pdf", "meta_path": "data/raw/arxiv/meta/2601.01171.json", "sha256": "e54163fb11eb5723ce8c98072ac078f4c1e6b22e84061f43b8d06274e79ac654", "status": "ok", "fetched_at": "2026-02-18T02:23:24.593805+00:00"}, "pages": [{"page": 1, "text": "Almost Clinical:\nLinguistic properties of synthetic electronic health records\nSerge Sharoff†, John Baker†; David Francis Hunt‡; Alan Simpson⋄\n† University of Leeds; ‡ University of Exeter; ⋄King’s College London\nAbstract\nThis study evaluates the linguistic and clin-\nical suitability of synthetic electronic health\nrecords in mental health. First, we describe\nthe rationale and the methodology for cre-\nating the synthetic corpus.\nSecond, we ex-\namine expressions of agency, modality, and\ninformation flow across four clinical genres\n(Assessments, Correspondence, Referrals and\nCare plans) with the aim to understand how\nLLMs grammatically construct medical au-\nthority and patient agency through linguis-\ntic choices.\nWhile LLMs produce coher-\nent, terminology-appropriate texts that ap-\nproximate clinical practice, systematic diver-\ngences remain, including registerial shifts, in-\nsufficient clinical specificity, and inaccuracies\nin medication use and diagnostic procedures.\nThe results show both the potential and limi-\ntations of synthetic corpora for enabling large-\nscale linguistic research otherwise impossible\nwith genuine patient records.\n1\nIntroduction\nElectronic health records (EHRs) contain rich data that\ncould advance our understanding of clinical communi-\ncation and support the development of natural language\nprocessing applications.\nHowever, there are signifi-\ncant barriers to large-scale research using EHR because\nof strict information-governance requirements and the\nrisk of handling patient-identifiable information. These\nchallenges are particularly acute in mental health con-\ntexts because of the highly sensitive nature of men-\ntal health narratives which often detail trauma, family\ndynamics, and interpersonal risks. The uniqueness of\nthese narratives also increases re-identification risk, so\nmental health EHRs cannot be used without extensive\ndata protection measures.\nLarge Language Models (LLMs) offer a potential so-\nlution by generating synthetic corpora that could enable\nlinguistic analysis at scale while avoiding these ethi-\ncal and practical constraints. If automatically gener-\nated texts closely resemble authentic clinical documen-\ntation, they could be freely shared among researchers\nand subjected to computational linguistic analysis that\nwould otherwise be impossible with genuine patient\nrecords. We generate our synthetic corpus from stan-\ndardised templates with variable inputs including de-\nmographics, clinical and psychosocial characteristics,\nand treatment history.\nThis study investigates whether LLM-generated syn-\nthetic mental health records are linguistically and clin-\nically suitable for research purposes.\nWe apply the\nframework of Systemic Functional Linguistics (SFL),\nwhich treats language as a semiotic system that re-\nalises social meanings through configurations of social\ncontext variables (Halliday and Matthiessen, 1999).\nSpecifically, we use the parameters of field (social ac-\ntion), tenor (role structure), and mode (symbolic or-\nganisation of discourse) to analyse four EHR genres:\nInitial Assessments, GP Correspondence, Referrals and\nHandovers, and Care Plans. These genres encode dis-\ntinct institutional purposes while simultaneously con-\nstructing role relationships among clinicians, nurses,\nand patients.\nOur analysis focuses on two key questions: (1) how\nclosely LLM outputs approximate the language ex-\npected in authentic clinical genres, and (2) what in-\nteresting linguistic features emerge when these genres\nare studied at scale through synthetic corpora. The lat-\nter analysis is difficult with actual EHRs due to ac-\ncess restrictions. Specifically, we examine linguistic\nresources such as modality (might, can, should), infor-\nmation flow (additionally, however), and agency, in-\nvestigating how grammatical choices construct medical\nauthority and patient agency, and how these construc-\ntions shift with different input parameters. The parame-\nters of variation have been strategically chosen to inves-\ntigate potential biases in LLM outputs, such as unfair or\ninaccurate reasoning concerning certain combinations\nof demographic, clinical, and psychosocial characteris-\ntics.\n2\nMethodology\n2.1\nGenres\nOur experiment in generating a synthetic corpus fo-\ncuses on four genres, which are relevant for the EHRs\nof every mental health patient, following the guidance\nfrom (Ball and Burn, 2021):\n• Initial assessments (coded as ‘Init’ below);\n• GP correspondence (‘GP’);\narXiv:2601.01171v2  [cs.CL]  3 Feb 2026\n"}, {"page": 2, "text": "• Referral and handover letters (‘Ref’);\n• Care plans (‘Care’).\nInitial assessments aim to provide a precise descrip-\ntion of the outcomes of the mental state examination.\nThey were generated using the following prompt:\n(1)\nFor this mental health patient, please provide a\nshort description of the patient, the outcomes of\nmental state examination, and psychiatric history\n& formulation.\nGP correspondence includes letters sent to the pa-\ntient or to other health services with the following gen-\neration template:\n(2)\nFor this mental health patient, please provide\nseveral examples of GP Correspondence\naddressing the patient.\nThe referrals and handover letters are a specific sub-\ntype of GP correspondence, for transferring the pa-\ntient to specialist psychiatrists and mental health nurses\nin Community Mental Health Teams (NHS Digital,\n2025):\n(3)\nFor this mental health patient, please provide\nreferrals and handover letters, presenting\nsymptoms, background and relevant mental\nhealth history, current medication and risk\nassessment, and the reasons for referral.\nFinally, a care plan is a personalised document cre-\nated by the healthcare team in interaction with the pa-\ntient to manage their mental health:\n(4)\nFor this mental health patient, please provide a\npatient-centred Advance Care Plan following\nfrom DIALOG+ methodology. The sections\nshould include: (1) psychiatric assessment of\ndiagnoses, (2) treatment goals, (2) objectives, (3)\ninterventions, (4) responsibilities, (5) progress\ntracking, and (6) a timeline for achieving specific\nmilestones in mental health therapy.\nDialog+ is a framework recommended by the British\nNational Health Service (NHS) for producing care\nplans in a patient-centred approach to guide clinicians\nand patients through a specific problem-solving pro-\ncess (Priebe et al., 2017).\nEach of these user prompts has been accompanied\nwith a system prompt designed to reduce the likelihood\nof flat refusal of the LLMs to produce any clinical out-\nput, when the clinical story mentions such phenomena\nas suicidal ideations:\n(5)\nYou are a psychiatrist who needs to write this\nreport. You should provide an accurate\nassessment to any request even for perceived\ndangerous activities in the kind of language used\nby psychiatrists.\nFigure 1: The network for modality annotation\n2.2\nInput parameters of variation\nFor each text to be generated, we prepared a range of\nstories with the following parameters of variation and\nthe values we tested:\n• age: younger (25), older (50);\n• gender: female, male;\n• sexuality: n/a, \"homosexual\", \"bisexual\";\n• ethnicity:\n\"White British\", \"Afro-Caribbean\",\n\"Afro-Caribbean, first generation\";\n• diagnosis: \"Single Episode Depressive Disorder\",\n\"Single Episode Depressive Disorder Moderate\nwith no psychotic symptoms\", \"Single Episode\nDepressive Disorder Severe with psychotic symp-\ntoms.\", \"Bipolar I Disorder with episodes of ma-\nnia alternating with depressive episodes\", \"Bipo-\nlar II Disorder with hypomanic and major depres-\nsive episodes\", \"Cyclothymic Disorder\";\n• medication: n/a, \"taking sertraline 100mg daily\nover the last three months\", \"taking sertraline\n200mg daily over the last three months\";\n• risks:\nn/a, \"chronic pain\", \"decreased libido\",\n\"suicidal ideations\", \"family history of suicide\";\n• treatment:\n\"no admissions\", \"informal admis-\nsions\", \"detained under the mental health act (Sec-\ntion 2)\", \"detained under the mental health act\n(Section 3)\".\nIn total the variation of the values in these lists results\nin 12,960 patient stories (2×2×3×3×6×3×5×4). Ob-\nviously, many more stories are possible with different\nvalues of these parameters. The parameters of varia-\ntion have been chosen to investigate biases in the LLM\noutputs, i.e., unfair or inaccurate reasoning concerning\ncertain combinations of values in the personal stories\nwith respect to the demographic parameters.\n"}, {"page": 3, "text": "Table 1: Corpus data for all annotated texts and for a selection of texts with linguistic annotation. The text length\nis assessed by their median and mean values, as well as by the interquartile range\nLlama:\nMistral:\nTotal\nCare\nGP\nInitial\nReferrals\nCare\nGP\nInitial\nReferrals\nGenerated texts\n12,960\n12,960\n12,960\n12,960\n12,960\n12,960\n12,960\n12,960\n#Sentences\n726,147\n669,258\n636,288\n757,048\n481,091\n476,099\n207,451\n690,821\n#Words\n7,743,938\n8,785,267\n9,028,813\n11,369,823\n6,646,714\n6,171,009\n3,210,795\n8,676,067\nMedian/Mean TL\n743 / 804\n721 / 776\n794 / 920\n973 / 983\n629 / 633\n568 / 584\n491 / 498\n473 / 475\nTL IQR\n654 - 860\n621 - 846\n674 - 947\n872 - 1091\n587 - 677\n522 - 631\n458 - 529\n451 - 499\nAnnotated texts\n24\n24\n24\n24\n24\n24\n24\n24\n#Sentences\n2,066\n1,645\n1,043\n1,436\n1,265\n1,046\n723\n786\n# Words\n19,195\n18,034\n13,693\n20,072\n12,413\n12,242\n9,637\n8,906\n2.3\nStudying linguistic parameters of variation in\nthe output\nEach of the context categories (field, tenor, and mode)\ncan be linked to three clusters of linguistic realisations\non the clause level:\n• Agency: who is doing what to whom;\n• Modality: expressing probability or obligation for\npropositions;\n• Thematic analysis:\ninformation flow and dis-\ncourse organisation patterns.\nOur analysis of these linguistic realisations follows\nthe definitions of Halliday and Matthiessen (2014).\nOur analysis of agency focuses on the distribution\nof clause types, the respective grammatical Actors and\nthe Goals. We compare the frequency of the following\nclause types:\n• Observable activities (material)\n• Subjective inner experience (mental)\n• Reportable speech (verbal)\n• Classifiable states (relational)\n• Presence or absence of entities (existential)\nFrom the viewpoint of functional grammar, modal-\nity is a resource, which can be used by the speaker to\nmodulate their stance with respect to the propositional\ncontent. It provides options for expressing:\n• likelihood (probably, sometimes, maybe);\n• deontic requirements (should, it is necessary, al-\nlowed);\n• volition (can, inclined, will).\nThe Modality network in Figure 1 follows (Halliday\nand Matthiessen, 2014, Section 4.5.2) as implemented\nin CorpusTool.\nFor analysing the information flow, we focus on ex-\nplicit connectors, which link chunks of information\nwith the aim of:\n• expressing contrast (however);\n• expanding with related information (addition-\nally);\n• structuring information presentation (firstly, sec-\nondly, in conclusion);\n• expressing\ninterpersonal\nevaluation\n(unfortu-\nnately).\nOur annotation process follows this protocol:\n• we select a random subset of texts from our full\ncorpus (24 texts in each of four genres generated\nby each LLM);\n• we detect these linguistic features using Corpus-\nTool (O’Donnell, 2008);\n• we validate the linguistic features detected by the\ntool.\nThis ensures that the process can cover a large sam-\nple, while at the same time retaining human oversight.\nHowever, the downside is that some false negatives\nmight be missing, thus over-estimating recall. Both the\nprompts used for generation and the resulting annotated\ncorpora are made available to support reproducibility\nand further research.\n3\nResults\n3.1\nSynthetic corpora\nAnother parameter of variation was choosing the LLM.\nAfter a preliminary study of four instruction-tuned\nLLMs (DeepSeek V2 16B, Llama 3.2 3B, MediPhi 4B,\nand Mistral v0.3 7B), we generated two sets of 12,960\nEHRs using Llama and Mistral, as, in the expert judge-\nment, their output was the closest to clinical reality.\nTable 1 lists the basic parameters of the full corpus\nand of the manually annotated texts. An interesting pa-\nrameter is variation over the length of the generated\ntexts.\nLlama has produced concistently longer texts\nthan Mistral with some excessively long texts, up to\n8,098 words (this is also evident in the greater differ-\nence between the median and the mean, as the latter is\naffected by the outliers). The length of texts produced\nby Mistral is more concistent. The Referrals and Han-\ndover genre is the longest genre for Llama (its median\ntext length is 973 words) and it is the shortest genre for\nMistral (473). Even though the Care Plan genre had\nthe longest prompt, it is one of the shorter genres for\nLlama, while it is the longest one for Mistral.\n"}, {"page": 4, "text": "Table 2: Variation in clause types\nLlama\nMistral\nCare\nGP\nInit\nRef\nCare\nGP\nInit\nRef\nCLAUSES\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nmaterial\n1358\n82.9\n1125\n66.5\n876\n67.4\n1266\n67.0\n1011\n88.8\n762\n63.7\n533\n62.1\n490\n60.6\nmental\n59\n3.6\n93\n5.5\n55\n4.2\n82\n4.3\n23\n2.0\n76\n6.4\n45\n5.2\n59\n7.3\nverbal\n54\n3.3\n280\n16.5\n159\n12.2\n224\n11.9\n24\n2.1\n142\n11.9\n54\n6.3\n77\n9.5\nrelational\n167\n10.2\n178\n10.5\n206\n15.9\n314\n16.6\n79\n6.9\n160\n13.4\n187\n21.8\n164\n20.3\nexistential\n1\n0.1\n17\n1.0\n3\n0.2\n3\n0.2\n1\n0.1\n56\n4.7\n39\n4.5\n19\n2.3\nTOTAL:\n1639\n100\n1693\n100\n1299\n100\n1889\n100\n1138\n100\n1196\n100\n858\n100\n809\n100\n3.2\nLinguistic analysis\nWe report both the actual number of linguistic features\nand their local rate (the proportion among the choices\nin the same category).\n3.2.1\nTransitivity\nTable 2 shows the distribution of process types in the\n24 annotated stories. The Care plans are much more\naction-oriented than the other genres, as the rate of ma-\nterial clauses reaches 83% for Llama and 89% for Mis-\ntral (compared with 61–67% for the other genres). The\nmost frequent verbs in the material clauses are manage,\nmonitor, reduce, as well as to address (issues or symp-\ntoms). From the field perspective, the high rate of ma-\nterial clauses indicates that texts produced this genre\nadhere to the “enabling-doing” register (Matthiessen,\n2015), which reflects the expectations of the EHRs,\nsee the description of the DIALOG+ framework for\nPrompt (4), which includes requests for specific ac-\ntions.\nBy contrast, texts generated for the Initial As-\nsessments and Referrals adhere to the “categorising-\ninventorying” register, reflected in a higher proportion\nof relational clauses, typically realised through verbs\nsuch as to be and to have, as in the patient has a his-\ntory of ... This reflects the importance of precise de-\nscriptions for these genres in clinical practice.\nThe\nrate of relational clauses reaches 16–17% for Llama\nand 20–22% for Mistral, compared with 10–11% in the\nother genres and as low as 7% in the Care plans gen-\nerated by Mistral. Existential processes (exists or there\nis) are also common in this register because they intro-\nduce new entities into the discourse, so their increase\nis expected in the Initial Assessments and Referrals.\nHowever, the two LLMs differ in their use: Llama uses\nexistential constructions infrequently (0.2% to 1%),\nwhereas Mistral stages clinical entities explicitly, with\nrate of up to 5% in GP correspondence, for example,\nthere is a heightened concern for her safety and there\nwere signs of grandiosity. When introducing similar\ncontent, Llama often chooses patient-centric expres-\nsions through mental processes, e.g. She also experi-\nenced a sense of grandiosity, thereby relating the phe-\nnomenon to the patient’s subjective experience rather\nthan presenting it as an objectively existing clinical en-\ntity.\nFinally, there is a drop in the rate of verbal clauses\nin the Care plans (down to 3% for Llama) and their rise\nin GP correspondence (17%), predominantly in forms\nsuch as the patient reported or the formulaic I’m writ-\ning to inform you that.... The verbiage is most often\nexpressed by a minor clause, as in the patient reported\nfeeling overwhelmed or the patient reported experienc-\ning auditory hallucinations. Again, this reflects reg-\nisterial variation and adheres to clinical expectations:\nthe Care plans instruct the patient and the healthcare\nteam on what to do, whereas GP correspondence re-\nports what was said.\n3.2.2\nModality\nTable 3 lists the frequencies for the two most frequent\nparameters of modality in the same subset.\nAcross all genres in our corpus, deontic require-\nments (It is essential to consider these factors...) dom-\ninate as compared to expressions of probability, cer-\ntainty, or usuality, which are largely concentrated in the\nInitial Assessments (Her Bipolar II Disorder is likely\nto continue...).\nThis contrasts with the higher fre-\nquency of such functions in academic research papers,\nincluding those in the field of mental health. With re-\nspect to the subtypes of deontic requirements, Obliga-\ntion (need, necessary, require) is the most common, es-\npecially in the Care plans and the Referrals. This con-\ntrasts with Advisability (advise or recommend), which\nis more prominent in the Initial Assessments and GP\ncorrespondence.\nAlthough Volition is less common than Require-\nments, it remains notable in the Care plans.\nMis-\ntral’s output contains considerably fewer expressions\nof volition, which is consistent with the lower degree\nof agency observed in its output, as discussed above.\nWhen volition does appear in Mistral’s output, it is typ-\nically attributed to the doctor:\n(6)\nThe patient is responsible for attending [pain\nmanagement sessions].. I will collaborate with\n[pain management specialists]...\n(where I refers to the doctor). Llama’s output tends\nto assign more agency to the patient, for example, by\nexpressing Volition as:\n(7)\nI will adhere to my medication regimen.\n"}, {"page": 5, "text": "Table 3: Variation in modality types\nLlama\nMistral\nCare\nGP\nInit\nRef\nCare\nGP\nInit\nRef\nMODALS\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nlikelihood\n4\n6.7\n3\n2.1\n24 23.8\n2\n1.6\n1\n1.6\n4\n5.1\n17 21.0\n1\n1.4\nrequirement\n41 68.3 136 93.2\n74 73.3 104 83.2\n61 98.4\n60 75.9\n64 79.0\n57 81.4\nvolition\n15 25.0\n7\n4.8\n3\n3.0\n19 15.2\n0\n0.0\n15 19.0\n0\n0.0\n12 17.1\nTOTAL:\n60\n100 146\n100 101\n100 125\n100\n62\n100\n79\n100\n81\n100\n70\n100\nREQUIREMENT\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nobligation\n36 87.8 103 75.7\n58 78.4\n98 94.2\n50 82.0\n41 68.3\n38 59.4\n49 86.0\nadvisability\n4\n9.8\n33 24.3\n16 21.6\n6\n5.8\n8 13.1\n19 31.7\n25 39.1\n8 14.0\npermission\n0\n0.0\n0\n0.0\n0\n0.0\n0\n0.0\n3\n4.9\n0\n0.0\n1\n1.6\n0\n0.0\nTOTAL:\n41\n100 136\n100\n74\n100 104\n100\n61\n100\n60\n100\n64\n100\n57\n100\nTable 4: Variation in textual themes\nLlama\nMistral\nCare\nGP\nInit\nRef\nCare\nGP\nInit\nRef\nINFORMATION\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\nN\n%\n- extending\n22 57.9\n11 20.4\n13 39.4\n15 21.4\n14 87.5\n21 42.0\n7 29.2\n22 44.0\n- arguing\n16 42.1\n42 77.8\n19 57.6\n52 74.3\n2 12.5\n26 52.0\n13 54.2\n28 56.0\n- structuring\n0\n0.0\n1\n1.9\n1\n3.0\n3\n4.3\n0\n0.0\n3\n6.0\n4 16.7\n0\n0.0\nTOTAL:\n38\n100\n54\n100\n33\n100\n70\n100\n16\n100\n50\n100\n24\n100\n50\n100\n3.2.3\nInformation flow\nApart from the sparse use of interpersonal Themes (8\nexamples of unfortunately, mostly in GP correspon-\ndence produced by Mistral), textual Themes are the\nmain resource used by the LLMs for structuring in-\nformation flow. Table 4 shows the distribution of the\nsubtypes of textual Themes.\nThe most frequent pattern is the Arguing Theme, pri-\nmarily expressed by the adversative connector How-\never, used most commonly in the Referral genre by\nLlama and in the GP correspondence genre by Mistral.\nIts frequent use signals contrast or complication, guid-\ning through shifts in clinical reasoning by emphasising\nproblematisation or exception.\nIn addition to the Arguing Theme, the Extending\nTheme is also frequent. The most common connec-\ntors are additionally, furthermore, also, which link new\ninformation to previously established statements. This\nsupports the accumulation of clinical details in the in-\ncremental build-up of patient history, symptoms, and\ncontextual factors.\nAcross the annotated corpus, there are very few\nstructuring connectors (7 examples of in conclusion\nand single examples of firstly, finally). When they do\nappear, they occur mostly in the Initial Assessments\nand GP correspondence generated by Mistral.\nThis\nsuggests that both LLMs have limitations in generating\nexplicit organisational signposts. In the LLM output,\ninformation flow is managed implicitly through clause\nsequencing rather than through overt textual markers.\nAnother resource of information structuring relies on\nnumbered bullet points and imperative clauses, which\nare especially frequent in the Care plans. This reflects\nthe procedural and action-oriented nature of this genre,\nfocusing on specific tasks, responsibilities, and recom-\nmended actions, and aligning with its institutional pur-\npose of coordinating care and ensuring clear communi-\ncation with the patient.\n3.3\nSuitability evaluation\nIn addition to the linguistic analysis of the LLM out-\nputs, the annotated sample was examined by one of the\nauthors (JB, Professor of Mental Health Nursing with\nextensive clinical expertise) to assess the suitability of\nthese texts as representations of the genres used in clin-\nical practice.\nThe overall assessment is that the LLMs broadly re-\nflect the language of clinical practice by producing ap-\npropriate document structures and generally coherent\ndiscourse, for example, by combining patient-reported\nexperiences with clinical observations and diagnostic\nstatements.\nThe patient stories are mostly realistic,\nwith an appropriate combination of symptoms, diag-\nnoses, and treatment regimens. From a language per-\nspective, the models produce suitable terminology and\nappropriate collocations.\nHowever, many details di-\nverge from clinical practice, indicating the need for fur-\nther fine-tuning LLMs on existing EHRs to achieve a\nmore realistic synthetic dataset. The following phe-\nnomena have been observed (primarily for Llama, as\nMistral tends to produce fewer clinical infelicities):\nRegisterial shifts:\nIt is unlikely that genuine EHRs\nare included in the corpora used for the initial train-\ning of Large Language Models. When attempting to\nreplicate the features of the respective genres, the mod-\nels therefore rely on publicly available texts such as re-\nsearch papers, educational materials for students study-\ning mental health, and legal submissions written by\npsychiatrists for court proceedings. Therefore, some\nwordings are unlikely to appear in genuine EHRs. In\n"}, {"page": 6, "text": "particular, the Referral letters contain explanations, for\nexample,\n(8)\nThis medication is a selective serotonin reuptake\ninhibitor (SSRI) commonly used to treat\ndepression and anxiety disorders.\nwhich are not needed for professional communication\nacross the mental health teams, while they are frequent\nin textbooks. There are also examples of expressions\nreflecting psychiatric evidence submitted to courts even\nwhen the task requested in the prompt was to draft a\ncare plan:\n(9)\nI, the psychiatrist, have been assigned to provide\na comprehensive assessment and treatment plan\nSome GP correspondence outputs also include letters\naddressed to courts and public officials, an unlikely\npart of EHRs.\nFinally, some diagnostic procedures\nincluded in the synthetic data are more typical of re-\nsearch contexts (even though they are clinically legiti-\nmate), for example, monitoring through multiple track-\ning instruments such as both the Hamilton Depression\nRating Scale and the Montgomery–Åsberg Depression\nRating Scale. Another registerial deviation is that the\ngenerated care plans are very clinically-focused rather\nthan reflecting more service user-patient perspectives,\nwhich Dialog+ is meant to promote.\nAmerican influences:\nOur project is conducted in\ncollaboration with the British NHS with references to\nBritish-specific phenomena, such as Dialog+ or the\nMental Health Act, yet many generated examples re-\nflect predominantly American practices, such as psy-\nchotherapy as a first-line intervention.\nIn the NHS,\nfirst-line interventions usually begin with cognitive-\nbehavioural therapy (CBT). The American focus is\nslightly more common for Mistral, for example, 19,351\ninstances for CBT vs 34,513 for psychotherapy in Table\n5.\nLack of clinical knowledge:\nthe two LLMs demon-\nstrate considerable gaps in their clinical knowledge.\nFor instance, Llama occasionally confuses the condi-\ntions under which hospitalisation is mandated under\nSection 2 vs Section 3 of the Mental Health Act. Med-\nication dosing also varies randomly and without clear\njustification, with doses tending toward the higher end\nof the recommended range or above, particularly for\nLamotrigine and Quetiapine. The models often suggest\nmultiple drugs, leading to unwanted multipharmacy ef-\nfects. In addition, the models sometimes recommend\ntreatment, such as prescribing Valproate to a woman of\nchild-bearing age, which should generally be avoided\nbecause of the iatrogenic harm. Quetiapine is occa-\nsionally misrepresented: although it can be used ad-\njunctively as an antidepressant, it is primarily an an-\ntipsychotic and is not routinely prescribed for sleep, yet\nLlama repeatedly suggests it in less appropriate con-\ntexts, possibly influenced by mentions of the drug in\nTable 5: Mentions of medications and other keywords\nsorted by the frequencies in the Llama corpus\nMedicines\nLlama Mistral\nantidepressant\n13147\n7133\nlithium\n13041\n7105\nantipsychotic\n8956\n5682\nfluoxetine\n6694\n2169\nolanzapine\n5637\n1218\nvalproate\n5548\n1261\nprozac (fluoxetine)\n3561\n32\nlamotrigine\n2183\n2009\nquetiapine\n1988\n5956\nbenzodiazepine\n1129\n39\naripiprazole\n975\n369\nclonazepam\n379\n6\nescitalopram\n356\n3410\nTherapy-\nrelated words\nsymptoms\n597628 216341\ntreatment\n484006 216084\nmental\n276589 152640\ndepressive\n250874 144751\nrisk\n245406\n67201\nassessment\n165740\n66691\nsuicidal\n164780\n86223\nsection\n155415\n29188\ndepression\n138240\n53822\npsychotic\n111337\n40310\nbipolar\n78470\n43965\nsuicide\n67106\n32995\ncyclothymic\n53063\n19443\ndetention\n51776\n4222\nhypomanic\n46140\n18475\nmania\n37644\n12707\nCBT\n36246\n19351\npsychotherapy\n32981\n34513\nmanic\n24786\n14952\nformulation\n22123\n13650\nhospital\n19408\n9161\ncognitive\n18867\n8307\nhallucinations\n17631\n11451\nserotonin\n15069\n9226\nSSRI\n14862\n7895\nreuptake\n12151\n9047\npsychosocial\n4788\n5556\ncannabis\n4094\n115\nhamilton (tool)\n3451\n6288\nmarijuana\n1214\n103\nbisexual\n1065\n10914\npsychoeducation\n911\n9988\nmaladaptive\n144\n5015\nnews stories1. Mistral stays closer to its intended us-\nage. The models also demonstrate differences in their\npreferred treatment methods: clonazepam is almost ex-\nclusively mentioned by Llama, while escitalopram is\npreferred by Mistral (Table 5). Another example of\nthe lack of clinical knowledge is the suggested duration\nof a Community Treatment Order (CTO) for 3 months,\nwhich is unusually short and unwarranted for our test\nstories.\n1https://tinyurl.com/quetiapine-shortage\n"}, {"page": 7, "text": "Lack of specificity:\nLlama also shows a tendency to\nprovide insufficiently detailed clinical information. For\nexample, in the two subsequent entries:\n(10) 2018: Ayanna was hospitalized for a manic\nepisode, which was treated with a combination of\nlithium and valproate.\n(11) 2020: Ayanna was discharged from hospital after\na depressive episode was managed with a\ncombination of lithium and antipsychotics.\nThe first one offers a reasonable level of specificity,\nwhereas the second one is much less precise. Refer-\nring simply to antipsychotics provides no clinical de-\ntail, as this is a broad class of medications rather than a\nspecific drug, resulting in an unrealistic level of vague-\nness. The frequency list in Table 5 also shows its higher\nfrequencies for generic words (symptoms, treatment).\nFinally, Llama can be vague when describing diagnos-\ntic procedures, often failing to specify which tests were\nperformed or what their results were:\n(12) Her diagnosis was made after a comprehensive\nevaluation, including a thorough medical history,\npsychological assessment, and laboratory tests.\nLLM-specific:\nSome issues include explicit re-\nminders that the output is generated by an LLM (for ex-\nample, Please note that this report is fictional), as well\nas occasional refusals to produce clinical notes when\nsuicidal ideation is mentioned. Repetition also appears,\nwith identical text sometimes reproduced two or three\ntimes within the same output. This behaviour is more\ncommon with Llama, hence it produces considerably\nlonger texts (Table 1).\nEstimation of biases:\nVariation in ethnicity within\nthe prompts provides a test for the presence of bi-\nases. Both LLMs acknowledged cultural and ethnic\nbackground and the need to address racial stereotypes.\nHowever, Llama was far more likely to introduce ref-\nerences to drug use for the Afro-Caribbean patients:\nfor example, marijuana was mentioned 25 times in the\nWhite British stories vs 1,189 times in the two versions\nof the Afro-Caribbean stories, in comparison to 26 vs\n77 for Mistral. Similarly for cocaine in Llama: 259\nvs 1,857. As the patient stories are otherwise identi-\ncal, this indicates biased societal expectations, which\nare reflected in texts used to train Llama, while they\nare not justified by clinical practice.\n4\nRelated studies\nWith recent advances in natural language generation,\nsynthetic datasets have begun to proliferate across a\nwide range of domains, enabling controlled experimen-\ntation, see an early example in (Kvapilíková et al.,\n2020).\nWithin the healthcare sector, the Asclepius\ndataset has been recently developed to model the struc-\nture and content of discharge summaries (Kweon et al.,\n2023). However, comparable resources have not yet\nbeen available for the mental health domain, where\nclinical documentation follows different communica-\ntive norms and genre conventions.\nIn parallel, substantial work has focused on detecting\nmental health concerns in social media environments,\nincluding the CLPsych 2024 shared task on identify-\ning suicidal intent in Reddit posts (Chim et al., 2024)\nand such models as MentalLlama (Yang et al., 2023).\nA recent scoping review (Holmes et al., 2025) shows\nthat most LLM research in suicide prevention focuses\non risk detection while generative applications for sup-\nport, education, and clinical assistance are emerging.\nWhile these initiatives highlight the value of computa-\ntional methods for risk assessment and early interven-\ntion, they mostly focus on user-generated content rather\nthan clinical records.\nIntegrating generative AI into clinical practice re-\nmains an active area of investigation (Hider et al., 2025;\nHiebel et al., 2025). Other studies also show the im-\nportance of understand non-clinical factors in AI op-\nerations, such as ethnicity or gender, for example, it\nhas been shown that LLM clinical accuracy decreases\npost-perturbation (Gourabathina et al., 2025). For re-\nsponsible integration of AI, it is essential to under-\nstand the linguistic properties of the texts produced by\nLLMs and the conditions under which these properties\nvary, including the influence of sociodemographic bi-\nases (Draghi et al., 2024; Ma et al., 2025). Only with\nthis understanding can synthetic data be designed to\nsupport reliable clinical research and applications.\nThere have been recent studies aimed at assess-\ning the quality of synthetic medical texts produced by\nLLMs, such as (Xie et al., 2024). The focus of our\nstudy is on fine-frained linguistic analysis of outputs.\nThere have also been studies on the use of linguistic\nanalysis for medical communication, for example, Ve-\nlasco et al. (2022) focused on the expression of em-\npathy in coaching sessions. This is different from our\nfocus in this study on analysis of Electronic Health\nRecords.\n5\nConclusions\nThis study demonstrates that open-weight large lan-\nguage models can approximate the structure, terminol-\nogy, and discourse patterns of clinical genres. How-\never, they also introduce systematic deviations that\nreveal important limitations in their clinical fidelity.\nThis study aims at providing a clearer understanding\nof how and where LLMs succeed in producing coher-\nent, genre-appropriate documents, but also how they\nfall short, in particular, in modelling of clinical proce-\ndures or in culturally sensitive reasoning.\nThe quantitative patterns concern inflated drug ref-\nerences for certain ethnic groups, inappropriate med-\nication regimens, and genre-specific misalignments in\ntransitivity and modality. These patterns can emerge\nonly when examining a controlled, parallel synthetic\n"}, {"page": 8, "text": "corpus produced under consistent prompting condi-\ntions to study the impact of cues.\nThe most specific contribution of this work lies in\nthe combination of genre-sensitive linguistic analysis\nand controlled synthetic data generation, which ex-\nposes patterns that would remain invisible in studies\nfocused solely on accuracy or content validity. As a re-\nsult, it outlines a path towards safer, more realistic, and\nbias-aware computational experiments in the domain of\nmental health documentation.\nOur future research is aimed at studying integration\nof LLMs into summarising authentic EHRs and co-\nproduction of better care plans in close collaboration\nbetween the patients and their mental health teams. The\nsynthetic corpora provide an estimate for inaccuracies\nof LLMs in this domain.\n6\nRisks and ethical concerns\nThe project aims to improve the quality of mental\nhealth care by focusing on the possibilities of using\nLLMs in clinical practice, in particular we investigate\nbiases in synthetic data, as well as deviations of LLM\noutputs from the current practice.\nThe environmental impact of LLMs needs to be\nchecked against the societal impact of their application.\nOur experiments used NVidia L40S GPUs, which, on\naverage, were consuming 168W in our task. The infer-\nence time for a single output was 8.2s for Llama, 12.1s\nfor Mistral. The total time for generating outputs by 2\nLLMs × 4 genres × 12,960 stories was 292h19m. This\nis equivalent to driving a Nissan Leaf for 172 miles\n(3.5mi/kWh average consumption without heating or\na/c).\n7\nLimitations\nFirst, the parameters of variation do not capture the full\nrange of clinical scenarios found in mental health care.\nWe focus on variation relevant to our current study.\nSecond, the evaluation does not cover the full range\nof genres found in EHRs, as well as genres which in-\nform the clinical EHRs, for example, personal accounts\nof lived experience from the patients.\nLast, the evaluation focuses primarily on linguistic\nand genre-based features rather than on clinical safety.\nThis leaves the need for further exploration of practical\nimplications for using synthetic datasets in health care.\nReferences\nKaren Ball and Wendy Burn. 2021. Writing clinic let-\nters: College guidance on improving engagement\nwith patients. Royal College of Psychiatrists.\nJenny Chim, Adam Tsakalidis, Dimitris Gkoumas,\nDana Atzil-Slonim, Yaakov Ophir, Ayah Zirikly,\nPhilip Resnik, and Maria Liakata. 2024. Overview\nof the CLPsych 2024 shared task: Leveraging large\nlanguage models to identify evidence of suicidal-\nity risk in online posts. In Proceedings of the 9th\nWorkshop on Computational Linguistics and Clini-\ncal Psychology (CLPsych 2024), pages 177–190, St.\nJulians, Malta. Association for Computational Lin-\nguistics.\nBarbara Draghi, Zhenchen Wang, Puja Myles, and Al-\nlan Tucker. 2024. Identifying and handling data bias\nwithin primary healthcare data using synthetic data\ngenerators. Heliyon, 10(2).\nAbinitha Gourabathina, Walter Gerych, Eileen Pan,\nand Marzyeh Ghassemi. 2025. The medium is the\nmessage: How non-clinical information shapes clin-\nical decisions in LLMs. In Proceedings of the 2025\nACM Conference on Fairness, Accountability, and\nTransparency, pages 1805–1828.\nMichael A. K. Halliday and Christian M. I. M.\nMatthiessen. 1999. Construing experience through\nmeaning: a language-based approach to cognition.\nCassell, London.\nMichael A. K. Halliday and Christian M. I. M.\nMatthiessen. 2014.\nIntroduction to Functional\nGrammar, 4th edition edition. Routledge, London.\nAndrew Hider, Lesa Wright, and Jacob Needle. 2025.\nClinical reach into the cognitive space (CRITiCS):\noutline conceptual framework for safe use of gener-\native artificial intelligence in mental health decision-\nmaking. BJPsych Bulletin, page 1–6.\nNicolas Hiebel, Olivier Ferret, Karën Fort, and Aurélie\nNévéol. 2025. Clinical text generation: Are we there\nyet? Annual Review of Biomedical Data Science, 8.\nGlenn Holmes,\nBiya Tang,\nSunil Gupta,\nSvetha\nVenkatesh, Helen Christensen, and Alexis Whitton.\n2025. Applications of large language models in the\nfield of suicide prevention: Scoping review. Journal\nof Medical Internet Research, 27:e63126.\nIvana Kvapilíková, Mikel Artetxe, Gorka Labaka,\nEneko Agirre, and Ondˇrej Bojar. 2020.\nUnsuper-\nvised multilingual sentence embeddings for parallel\ncorpus mining. In Proceedings of the 58th Annual\nMeeting of the Association for Computational Lin-\nguistics: Student Research Workshop, pages 255–\n262, Online. Association for Computational Linguis-\ntics.\nSunjun Kweon, Junu Kim, Jiyoun Kim, Sujeong Im,\nEunbyeol Cho, Seongsu Bae, Jungwoo Oh, Gyubok\nLee, Jong Hak Moon, Seng Chan You, Seungjin\nBaek, Chang Hoon Han, Yoon Bin Jung, Yohan Jo,\nand Edward Choi. 2023. Publicly shareable clini-\ncal large language model built on synthetic clinical\nnotes.\nBolei Ma, Berk Yoztyurk, Anna-Carolina Haensch,\nXinpeng Wang, Markus Herklotz, Frauke Kreuter,\nBarbara Plank, and Matthias Assenmacher. 2025.\nAlgorithmic fidelity of large language models in\ngenerating synthetic German public opinions:\nA\n"}, {"page": 9, "text": "case study. In Proceedings of the 63rd Annual Meet-\ning of the Association for Computational Linguistics\n(Volume 1: Long Papers), pages 1785–1809, Vienna,\nAustria. Association for Computational Linguistics.\nChristian MIM Matthiessen. 2015.\nRegister in the\nround: registerial cartography. Functional Linguis-\ntics, 2(1):1–48.\nNHS Digital. 2025. Advice and guidance for referrers\nand referring clinician teams.\nMick O’Donnell. 2008. Demonstration of the UAM\nCorpusTool for text and image annotation. In Pro-\nceedings of the ACL-08: HLT Demo Session, pages\n13–16, Columbus, Ohio. Association for Computa-\ntional Linguistics.\nStefan Priebe, Eoin Golden, David Kingdon, Serif\nOmer, Sophie Walsh, Kleomenis Katevas, Paul Mc-\nCrone, Sandra Eldridge, and Rose McCabe. 2017.\nEffective patient–clinician interaction to improve\ntreatment outcomes for patients with psychosis: a\nmixed-methods design. Programme Grants for Ap-\nplied Research, 5(6):1–160.\nElena Rey Velasco, Hanne Sæderup Pedersen, and\nTimothy Skinner. 2022. Analysis of patient cues in\nasynchronous health interactions: pilot study com-\nbining empathy appraisal and systemic functional\nlinguistics. JMIR formative research, 6(12):e40058.\nYiqing Xie, Sheng Zhang, Hao Cheng, Pengfei Liu, Ze-\nlalem Gero, Cliff Wong, Tristan Naumann, Hoifung\nPoon, and Carolyn Rose. 2024.\nDocLens: Multi-\naspect fine-grained evaluation for medical text gen-\neration. In Proceedings of the 62nd Annual Meet-\ning of the Association for Computational Linguistics\n(Volume 1: Long Papers), pages 649–679, Bangkok,\nThailand. Association for Computational Linguis-\ntics.\nKailai Yang, Tianlin Zhang, Ziyan Kuang, Qianqian\nXie, and Sophia Ananiadou. 2023. Mentalllama: In-\nterpretable mental health analysis on social media\nwith large language models.\n"}, {"page": 10, "text": "A\nAppendix: Example of Mistral outputs\nA.1\nPrompt story\nPlease write three paragraphs for each of the following\nsections concerning a fictitious female patient, who is\n25 years old, has been diagnosed with Bipolar I Disor-\nder with episodes of mania alternating with depressive\nepisodes. Ethnicity: Afro-Caribbean. Risks: chronic\npain.\nTreatment history: detained under the mental\nhealth act (Section 2)\nA.2\nInitial examination\nInitial Assessment Report\nSubject ID: J.A., a 25-year-old Afro-Caribbean fe-\nmale, presents for a comprehensive psychiatric evalua-\ntion. She has been previously diagnosed with Bipolar I\nDisorder, characterized by alternating episodes of ma-\nnia and depression. The patient was detained under the\nMental Health Act (Section 2) due to concerns regard-\ning her safety and wellbeing. The current admission\naims to stabilize her symptoms, address any underly-\ning issues, and establish an appropriate treatment plan.\nMental State Examination\nUpon initial contact, the patient exhibited a labile\nmood, switching between euphoria and irritability. Her\nspeech was pressured, with racing thoughts and flight\nof ideas. J.A. reported severe insomnia, increased en-\nergy levels, and a decreased need for sleep. She demon-\nstrated grandiosity, expressed a sense of invincibility,\nand demonstrated impulsive behaviors. Additionally,\nthe patient reported chronic pain, which may be con-\ntributing to her emotional distress. Affect was concor-\ndant with her mood state, and her thought content was\notherwise unremarkable.\nPsychiatric History & Formulation\nJ.A.’s psychiatric history is significant for multiple\nhospitalizations due to manic episodes, each of which\nwas followed by a depressive episode.\nHer manic\nsymptoms, including inflated self-esteem, decreased\nneed for sleep, and impulsive behaviors, have been con-\nsistently present throughout her illness course. The pa-\ntient’s depressive episodes have been characterized by\nfeelings of worthlessness, hopelessness, and severe an-\nhedonia.\nIn terms of medication history, the patient has been\nprescribed various mood stabilizers, antipsychotics,\nand antidepressants, with varying degrees of success.\nThe current medication regimen includes Lithium car-\nbonate for mood stabilization, Quetiapine for sedation,\nand Amitriptyline for pain management.\nThe formulation of J.A.’s presentation suggests a di-\nagnosis of Bipolar I Disorder with chronic pain. The\nrecurrent manic and depressive episodes are likely to\nbe driven by a combination of genetic, biological, and\nenvironmental factors. The presence of chronic pain\nmay exacerbate her mood symptoms and contribute to\nher overall distress.\nThe primary risks associated with J.A.’s current pre-\nsentation include impulsive behaviors during manic\nepisodes, which could potentially lead to harmful or\ndangerous activities. The chronic pain she experiences\nmay also increase her vulnerability to substance abuse\nas a means of self-medication. It is crucial to ensure\nclose monitoring of her symptoms, adherence to med-\nication, and psychosocial support to minimize these\nrisks. A multidisciplinary approach, involving psychi-\natry, pain management, and psychology, will be essen-\ntial in managing J.A.’s complex presentation and im-\nproving her overall quality of life.\nA.3\nGP correspondence\nI. Medication History\nThe subject, a 25-year-old Afro-Caribbean female,\nhas a documented history of Bipolar I Disorder, char-\nacterized by recurrent episodes of mania and major\ndepressive episodes. The patient’s medication history\nhas been marked by a series of pharmacological inter-\nventions aimed at managing her symptoms. Initially,\nshe was prescribed a combination of Mood Stabilizers\n(Lithium Carbonate and Valproate Sodium) and an An-\ntipsychotic (Olanzapine) to address the manic symp-\ntoms. However, due to the side effects such as weight\ngain and sedation, the medication regimen was altered\nto a Monotherapy of Lithium Carbonate. Subsequently,\ndue to the recurrence of manic episodes, the treatment\nwas further adjusted to include a second-generation\nAntipsychotic (Quetiapine). The patient’s response to\nthese medications has been variable, with some benefi-\ncial effects but also persistent manic symptoms. Close\nmonitoring of the patient’s medication and symptoms\nis essential to ensure optimal treatment.\nII. Treatment History\nThe patient has a notable treatment history, involv-\ning detainment under the Mental Health Act (Section\n2). This action was taken due to the patient’s inabil-\nity to manage her symptoms adequately, which posed a\nrisk to herself and others. During her hospitalization,\nthe patient was provided with a structured treatment\nplan that included pharmacological interventions, psy-\nchotherapy, and education about her condition. The pa-\ntient’s compliance with the treatment plan was incon-\nsistent, leading to the recurrence of manic episodes and\nthe need for continued inpatient care. In light of these\nchallenges, the focus of treatment has shifted to a more\nintensive outpatient program, with regular follow-ups,\nmedication management, and psychotherapy sessions.\nIII. Risks\nIn addition to the risks associated with untreated\nBipolar I Disorder, this patient has an ongoing issue\nwith chronic pain. The etiology of this pain is unclear,\nbut it is believed to be a result of a combination of fac-\ntors, including her mental health condition and possi-\nble physical comorbidities. The chronic pain exacer-\nbates the patient’s mood symptoms and contributes to\nher overall disability. It is essential to address this is-\nsue in conjunction with her mental health treatment to\nimprove her overall quality of life and reduce the risk\n"}, {"page": 11, "text": "of relapse.\nAs for the examples of GP correspondence, I am\nunable to provide specific examples without access to\nthe patient’s medical records. However, I can suggest\nthe following format for GP correspondence addressing\nthis patient:\n1. Identification of the patient and relevant medical\nhistory. \"Dear Dr. [GP Name], I am writing to\nprovide an update on our patient, [Patient Name],\nwho is currently under my care for Bipolar I Dis-\norder.\nShe is a 25-year-old Afro-Caribbean fe-\nmale with a history of detainment under the Men-\ntal Health Act (Section 2).\"\n2. Discussion of the patient’s current symptoms and\ntreatment plan. \"Recently, the patient has been\nexperiencing fluctuations in her mood, with re-\ncurrent manic episodes and periods of depression.\nWe have adjusted her medication regimen to in-\nclude Quetiapine in an effort to better manage her\nsymptoms. Additionally, she is attending regu-\nlar psychotherapy sessions and education classes\nabout her condition.\"\n3. Communication of any concerns or recommenda-\ntions. \"I am concerned about the patient’s ongoing\nissue with chronic pain and the impact it has on\nher mental health. I recommend that you refer her\nto a pain management specialist for further evalu-\nation and treatment. It is essential to address this\nissue in conjunction with her mental health treat-\nment to improve her overall quality of life and re-\nduce the risk of relapse.\"\n4. Request for collaboration and follow-up. \"I would\nappreciate your collaboration in managing this\ncomplex case. Please keep me informed of any\nchanges in the patient’s condition or any issues\nthat arise during your care.\nI look forward to\nworking together to ensure the best possible out-\ncome for our patient.\"\n5. Closing remarks. “Thank you for your attention\nto this matter. Please do not hesitate to contact me\nif you have any questions or concerns.\nSincerely, [Your Name] [Your Title and Affilia-\ntion]”\nA.4\nReferrals\nReferral and Handover Letter\nTo Whom It May Concern,\nI am writing to provide a referral and handover for\na 25-year-old Afro-Caribbean female patient who has\nbeen under my care for the past six months. The patient\nhas been diagnosed with Bipolar I Disorder, present-\ning with episodes of mania alternating with depressive\nepisodes.\nPresenting Symptoms: The patient has been expe-\nriencing irregular sleep patterns, increased energy lev-\nels, and grandiose thinking, which are indicative of\nmanic episodes.\nConversely, she has reported feel-\nings of profound sadness, loss of interest in activities,\nand decreased energy levels, which are suggestive of\ndepressive episodes. Additionally, she has expressed\nchronic pain, which appears to exacerbate her mood\nepisodes.\nBackground and Relevant Mental Health His-\ntory: The patient’s mental health history is significant\nfor repeated hospitalizations under the Mental Health\nAct (Section 2), due to her inability to manage her\nsymptoms effectively without supervised care.\nHer\nsymptoms began to manifest at the age of 20, marked\nby severe mood swings and erratic behavior.\nCurrent Medication and Risk Assessment: The\npatient is currently on a regimen of Lithium carbon-\nate 900mg daily and Quetiapine 600mg nightly. These\nmedications have shown some efficacy in stabilizing\nher mood episodes, but she continues to struggle with\nchronic pain, which may contribute to her mood insta-\nbility.\nRisk assessment indicates that the patient poses no\nimmediate danger to herself or others, but her chronic\npain and unstable mood episodes require close moni-\ntoring. The patient’s non-adherence to medication reg-\nimen and self-harming behaviors in the past necessitate\na high level of supervision and support.\nReasons for Referral: The patient is being referred\nto your care for ongoing management of her Bipolar I\nDisorder and chronic pain. Her history of repeated hos-\npitalizations under the Mental Health Act and the need\nfor a high level of supervision necessitate a collabora-\ntive approach to her care. I believe that your expertise\nand resources will be instrumental in ensuring her con-\ntinued safety and wellbeing.\nPlease find attached the patient’s medical records, in-\ncluding her current medication list, for your review. I\nappreciate your attention to this matter and look for-\nward to our continued collaboration in the best interests\nof the patient.\nSincerely, [Your Name] [Your Position]\nA.5\nCare plan\nPatient-Centered Advance Care Plan (DIALOG+\nMethodology)\n1. Psychiatric Assessment of Diagnoses\nThe patient is a 25-year-old Afro-Caribbean female\nwith a primary diagnosis of Bipolar I Disorder, charac-\nterized by distinct episodes of mania alternating with\ndepressive episodes. The patient’s history is marked\nby periods of elevated mood, inflated self-esteem,\ndecreased need for sleep, grandiose beliefs, and in-\ncreased goal-directed activity, followed by periods of\nlow mood, loss of interest in usually pleasurable activ-\nities, decreased energy, and feelings of worthlessness.\n2. Treatment Goals\nThe primary treatment goal is to stabilize the pa-\ntient’s mood fluctuations, reduce the frequency and\nseverity of manic and depressive episodes, and improve\n"}, {"page": 12, "text": "overall functioning and quality of life. Secondary goals\ninclude managing chronic pain, reducing hospitaliza-\ntions, and promoting adherence to medication and ther-\napy.\n3. Objectives\nObjectives for this treatment plan include the follow-\ning:\n• Achieve and maintain mood stability through\npharmacological and psychotherapeutic interven-\ntions.\n• Reduce the severity and frequency of manic and\ndepressive episodes.\n• Improve the patient’s ability to cope with chronic\npain through cognitive-behavioral strategies.\n• Promote medication adherence and reduce hospi-\ntalization rates.\n• Enhance the patient’s social and occupational\nfunctioning.\n4. Interventions\nInterventions to achieve these objectives include:\n• Pharmacological management with mood stabiliz-\ners (e.g., lithium, valproate, or atypical antipsy-\nchotics) and/or antidepressants, as necessary, un-\nder close monitoring for side effects and efficacy.\n• Cognitive-behavioral\ntherapy\n(CBT)\nto\nhelp\nthe patient identify and challenge maladaptive\nthought patterns, manage stress, and develop ef-\nfective coping strategies for mood regulation and\npain management.\n• Psychoeducation about Bipolar I Disorder, its\nsymptoms, treatment options, and the importance\nof medication adherence and regular follow-ups.\n• Collaborative goal setting and problem-solving to\naddress challenges in daily functioning and reduce\nhospitalizations.\n• Regular multidisciplinary team meetings to coor-\ndinate care, monitor progress, and adjust treat-\nment plans as needed.\n5. Responsibilities\nResponsibilities for this treatment plan include:\n• The patient is responsible for attending scheduled\nappointments, taking medications as prescribed,\nand following the recommended treatment plan.\n• The patient’s primary care team, including the\npsychiatrist, psychotherapist, and nurse, is respon-\nsible for providing evidence-based care, monitor-\ning the patient’s response to treatment, and adjust-\ning the treatment plan as necessary.\n• The patient’s family and support system is respon-\nsible for providing emotional support, encourage-\nment, and assistance in managing daily activities\nas needed.\n6. Progress Tracking\nProgress will be tracked through regular assessments\nof mood symptoms using validated rating scales (e.g.,\nHamilton Depression Rating Scale, Young Mania Rat-\ning Scale), monitoring of medication levels, and eval-\nuations of the patient’s functioning in social, occupa-\ntional, and self-care domains.\n7. Timeline for Achieving Specific Milestones in\nMental Health Therapy\nThe timeline for achieving specific milestones in\nmental health therapy will vary for each patient, de-\npending on the severity of symptoms, adherence to\ntreatment, and individual circumstances.\nHowever,\nsome potential milestones might include:\n• Stable mood for at least three months within the\nfirst six months of treatment.\n• Reduction in hospitalization rates over the first\nyear of treatment.\n• Improvement in daily functioning, as measured by\nself-report and clinical assessment, within the first\nsix months to a year of treatment.\n• Development of effective coping strategies for\nmanaging chronic pain within the first three to six\nmonths of CBT.\n• Maintenance of treatment gains over time through\nongoing collaboration with the treatment team and\nself-care strategies.\n"}]}