{"doc_id": "arxiv:2511.18393", "source": "arxiv", "lang": "en", "pdf_path": "data/raw/arxiv/pdf/2511.18393.pdf", "meta": {"doc_id": "arxiv:2511.18393", "source": "arxiv", "arxiv_id": "2511.18393", "title": "Towards Robust and Fair Next Visit Diagnosis Prediction under Noisy Clinical Notes with Large Language Models", "authors": ["Heejoon Koo"], "published": "2025-11-23T10:40:36Z", "updated": "2025-11-23T10:40:36Z", "summary": "A decade of rapid advances in artificial intelligence (AI) has opened new opportunities for clinical decision support systems (CDSS), with large language models (LLMs) demonstrating strong reasoning abilities on timely medical tasks. However, clinical texts are often degraded by human errors or failures in automated pipelines, raising concerns about the reliability and fairness of AI-assisted decision-making. Yet the impact of such degradations remains under-investigated, particularly regarding how noise-induced shifts can heighten predictive uncertainty and unevenly affect demographic subgroups. We present a systematic study of state-of-the-art LLMs under diverse text corruption scenarios, focusing on robustness and equity in next-visit diagnosis prediction. To address the challenge posed by the large diagnostic label space, we introduce a clinically grounded label-reduction scheme and a hierarchical chain-of-thought (CoT) strategy that emulates clinicians' reasoning. Our approach improves robustness and reduces subgroup instability under degraded inputs, advancing the reliable use of LLMs in CDSS. We release code at https://github.com/heejkoo9/NECHOv3.", "query": "(cat:cs.CL OR cat:cs.LG) AND (all:\"large language model\" OR all:LLM) AND (all:medical OR all:clinical OR all:healthcare)", "url_abs": "http://arxiv.org/abs/2511.18393v1", "url_pdf": "https://arxiv.org/pdf/2511.18393.pdf", "meta_path": "data/raw/arxiv/meta/2511.18393.json", "sha256": "28eed60758a4d9c348ae587f08b4df354ce8e5375eadc04c4c56ae6fc3e03b14", "status": "ok", "fetched_at": "2026-02-18T02:26:28.490419+00:00"}, "pages": [{"page": 1, "text": "Towards Robust and Fair Next Visit Diagnosis Prediction\nunder Noisy Clinical Notes with Large Language Models\nHeejoon Koo\nUniversity College London\nheejoon.koo.17@alumni.ucl.ac.uk\nAbstract\nA decade of rapid advances in artificial intelligence (AI) has\nopened new opportunities for clinical decision support sys-\ntems (CDSS), with large language models (LLMs) demon-\nstrating strong reasoning abilities on timely medical tasks.\nHowever, clinical texts are often degraded by human errors\nor failures in automated pipelines, raising concerns about the\nreliability and fairness of AI-assisted decision-making. Yet\nthe impact of such degradations remains under-investigated,\nparticularly regarding how noise-induced shifts can heighten\npredictive uncertainty and unevenly affect demographic sub-\ngroups. We present a systematic study of state-of-the-art\nLLMs under diverse text corruption scenarios, focusing on ro-\nbustness and equity in next-visit diagnosis prediction. To ad-\ndress the challenge posed by the large diagnostic label space,\nwe introduce a clinically grounded label-reduction scheme\nand a hierarchical chain-of-thought (CoT) strategy that em-\nulates clinicians’ reasoning. Our approach improves robust-\nness and reduces subgroup instability under degraded inputs,\nadvancing the reliable use of LLMs in CDSS. We release code\nat https://github.com/heejkoo9/NECHOv3.\n1\nIntroduction\nCDSS assist clinicians in making evidence-based diagnos-\ntic, prognostic, and therapeutic decisions, improving patient\ncare quality (Sutton et al. 2020). They have shown signifi-\ncant potential to reduce diagnostic errors, improve treatment\nadherence, and streamline clinical workflows. In particular,\nprogress in language technologies has improved the transla-\ntion of unstructured documents into actionable recommen-\ndations, narrowing the gap between complex clinical data\nand point-of-care decision-making (Chen et al. 2023).\nDespite advances, clinical text is often degraded by hu-\nman error, workflow inefficiencies, and operational con-\nstraints (Berndt et al. 2015; Koo and Kim 2023; Koo 2023,\n2025). These degradations take two forms: 1) missingness\ninvolving absent entities or laboratory values from time-\npressured documentation (Kalisch, Landstrom, and Hinshaw\n2009), and 2) perturbations introduced during processing. In\nspecific, Automatic Speech Recognition (ASR) can induce\nhomophone substitutions (e.g., ileum →ilium) (Latif et al.\n2020), and Optical Character Recognition (OCR) can scram-\nble characters (Biondich et al. 2002). While certain forms of\nCopyright © 2026, Association for the Advancement of Artificial\nIntelligence (www.aaai.org). All rights reserved.\ntextual noise can function as an implicit data augmentation\n(Bayer, Kaufhold, and Reuter 2022), it may have detrimen-\ntal effects in high-stakes domains such as healthcare, where\nminor textual distortions may alter clinically relevant cues,\npropagate misinformation, or ultimately degrade the relia-\nbility and safety of downstream decisions.\nParallel to concerns over robustness, fairness has been a\npriority in AI and healthcare (Chen et al. 2023). Ensuring\nequitable performance across demographic subgroups, such\nas race, age, and other socio-economic statuses, is essen-\ntial for trustworthy AI deployment (Rajkomar et al. 2018).\nPrior works have demonstrated that AI systems often exhibit\nbiases, exacerbating health disparities (Chen et al. 2023).\nMoreover, (Bhatt et al. 2021) argue that disparate uncer-\ntainty compounds existing unfairness, disproportionately af-\nfecting marginalised subgroups.\nRecently, LLMs have transformed modern AI with excep-\ntional language understanding, positioning them as promis-\ning tools for CDSS (Bedi et al. 2024). Prior studies indi-\ncate that LLMs exhibit notable robustness to textual cor-\nruptions (Singh, Singh, and Vatsal 2024), while extensive\nresearch has also highlighted their inherent biases and fair-\nness challenges across demographic and linguistic dimen-\nsions (Li et al. 2023).\nHowever, the extent to which textual degradations jointly\naffect both robustness and fairness in LLM-based CDSS re-\nmains under-explored. This gap is particularly consequen-\ntial in high-stakes healthcare, where clinical narratives often\ncontain domain-specific terminology, irregular syntax, and\ndensely packed information. Such characteristics make both\naccurate prediction and equitable model performance espe-\ncially challenging under noisy or imperfect documentation\nconditions and act as a barrier towards reliable deployment.\nTo systematically quantify these challenges, we conduct\na comprehensive evaluation of state-of-the-art LLMs on\nthe publicly available MIMIC-IV dataset (Johnson et al.\n2023). We simulate realistic documentation artifacts com-\nmonly encountered in clinical environments, including lab-\nvalue omission and prior-note duplication, as well as pertur-\nbations inspired by ASR-induced homophone substitutions\nand OCR-style visual confusions. These corruptions serve\nto test model reliability while enabling the assessment of\nfairness disparities across demographic subgroups under de-\ngraded input conditions.\narXiv:2511.18393v1  [cs.CL]  23 Nov 2025\n"}, {"page": 2, "text": "Our primary focus is on next-visit diagnosis prediction,\na foundational task for anticipatory care in intensive care\nunits (ICUs) (Koo 2024, 2025). A key challenge in prior\nwork on LLM-driven diagnosis prediction is the large and\nheterogeneous label space, which undermines zero-shot per-\nformance. To address this, we introduce a novel approach,\nNECHO v3, that integrates 1) a label-reduction mapping\ninformed by clinical ontologies, and 2) Chain-of-Thought\n(CoT) guided hierarchical reasoning, explicitly mirroring\nthe diagnostic reasoning process of clinicians. This design\nimproves both robustness and fairness, providing a struc-\ntured framework for LLM-based clinical prediction in real-\nworld settings.\n2\nRelated Works\n2.1\nAI for Healthcare: from ML to LLM\nClinical predictive models have progressed from feature-\nengineered models on structured EHRs for risk stratifica-\ntion to longitudinal diagnosis prediction models (Koo 2024).\nThis has significantly improved accuracy but requires task-\nspecific modelling (Rajkomar et al. 2018). Recently, LLMs\nshift the paradigm towards general-purpose reasoning over\nclinical text, enabling zero-/few-shot prompting, instruction\ntuning, and tool integration; applications span summarisa-\ntion, triage, clinical QA, alongside ethical and governance\nconsiderations (Bedi et al. 2024).\n2.2\nText Degradation in Clinical Settings\nText degradation, manifested as both missingness and per-\nturbation, is pervasive in clinical documentation and may,\nin some cases, incidentally serve as a form of data aug-\nmentation by increasing textual variability (Shorten, Khosh-\ngoftaar, and Furht 2021). However, in high-stakes clinical\ncontexts, such degradations typically undermine model reli-\nability, interpretability, and ultimately the safety of decision-\nmaking processes (Moradi, Blagec, and Samwald 2021).\nConsequently, previous work has proposed mitigation\nstrategies (Getzen et al. 2023) and evaluated the impact of\nnoise on clinical text modelling tasks (Wu, Schlegel, and\nBatista-Navarro 2025). Recent studies have begun to probe\nLLMs’ robustness under textual corruption (Singh, Singh,\nand Vatsal 2024); however, most analyses lack 1) reflecting\nplausible corruption scenarios in the real-world, and 2) eval-\nuation across subgroups.\n2.3\nFairness in Healthcare\nAI models inherit and amplify societal biases embedded\nin their training data, which can lead to uneven predictive\nperformance across demographic sub-populations (Li et al.\n2023). In healthcare, these disparities trigger biased predic-\ntion risks, reinforcing existing inequities in diagnosis, treat-\nment, and resource allocation (Rajkomar et al. 2018; Zhao\net al. 2024).\nTo address these concerns, the NLP community has devel-\noped benchmarks to quantify bias in LLMs, targeting tasks\nsuch as commonsense reasoning (Shen 2024) and evalua-\ntion in healthcare (Zhang et al. 2024). However, there re-\nmains an absence of studies exploring how text degradation\naffects fairness in medical prediction for subgroup popula-\ntions, underscoring the need for fairness assessments under\nnoisy textual inputs.\nPositioning.\nThe most closely related work to ours is\n(Zhao et al. 2024), which investigates fairness in diagnosis\nprediction using LLMs. We extend this line of research by:\n1) evaluating longitudinal multi-label next visit diagnosis\non the publicly available MIMIC-IV dataset; 2) introducing\na clinically grounded label-reduction and hierarchical CoT\nprompting for diagnosis prediction; 3) simulating corrup-\ntion processes in realistic clinical settings; and 4) systemat-\nically assessing robustness and fairness across demographic\nsubgroups. Thus, this paper enables a more comprehensive\nevaluation of LLMs for real-world CDSS.\n3\nMethodologies\n3.1\nProblem Formulation\nNext Visit Diagnosis Prediction. A patient p has clinical\nrecords, V1, . . . , VT , where each visit Vt contains a clinical\nnote Nt. The objective is to predict the multiple diagnoses\nCT +1 that will appear in the next visit VT +1, based upon the\npatient’s longitudinal clinical data.\n3.2\nPrompt\nWe employ a zero-shot CoT prompting strategy (Wei et al.\n2022) designed to imitate clinicians’ reasoning for next visit\ndiagnosis prediction. LLM is first prompted to hypothesise\nmultiple plausible parental level diagnostic categories, then\nenumerate the most likely target diagnoses within those cat-\negories, inspired by (Koo 2024). Then, it is provided with\nthe complete set of clinical notes of a patient along with ba-\nsic demographic information. Full prompts are provided in\nAppendix 8.\n3.3\nText Degradation\nIn real-world clinical documentation, textual degradation\narises from many uncertain factors (Koo 2025). We organ-\nise degradations into two families of missingness and per-\nturbation to enable systematic evaluation for model robust-\nness. Missingness captures lab-value omissions as well as\nnote-level copy-forward artifacts. Perturbations stem from\nsystem-induced noise from ASR (e.g., homophone substi-\ntutions) and OCR (e.g., character jittering). Although more\ntext degradation scenarios are possible, we restrict our anal-\nysis to the defined scenarios.\nLab-value Omission removes numeric laboratory re-\nsults (e.g., blood glucose, creatinine) from the note, reflect-\ning masking due to privacy or omission in timely settings\n(Kalisch, Landstrom, and Hinshaw 2009).\nPrior-note Duplication inserts a verbatim duplicate of a\nprior note into the current note to model copy-forward arti-\nfacts (O’Donnell et al. 2009).\nHomophone Substitution replaces words with phonet-\nically similar alternatives to mimic ASR mis-recognitions\n(e.g., pain →pane) (Latif et al. 2020).\nOCR Jittering introduces character-level confusions typ-\nical of OCR (e.g., history →h1story; O↔0, l↔1, rn ↔m)\n(Biondich et al. 2002).\n"}, {"page": 3, "text": "Clinical \nDocuments\nDegraded \nClinical \nDocuments\nLLMs\nSub-group \nFairness\nNext Visit \nDiagnosis \nPrediction\nMissingness\nPerturbation\nShe was given 1 dose of diltiazem 10 mg \nIV, which brought her rate down slightly.\nOriginal\nShe was given 1 dose of diltiazem 10 \nmg IV, which brought her rate down \nslightly.\nLab-value \nOmission\nShe was given won dose of diltiazem \n10 mg IV, witch brought her rate down \nslightly.\nHomophone \nSubstitution\nShe was glven l dose of dltltlazem 10 \nmg 1V which brought her rate down \nsl1ghtly\nOCR \nJittering\n1st Note) She was given 1 dose of \ndiltiazem …\n2nd Note) She was given 1 dose of \ndiltiazem …\nPrior-note \nDuplication\nDegradation !\nPerformance \nRobustness\nFigure 1: An Overview of Our LLM Evaluation Pipeline under Various Clinical Note Degradation.\n4\nExperiments\n4.1\nDataset and Preprocessing\nDataset.\nWe conduct experiments on the MIMIC-IV\ndataset (Johnson et al. 2023), a large-scale, de-identified\nEHR repository from Beth Israel Deaconess Medical Center.\nThe corpus comprises structured data (e.g., demographics,\ndiagnosis codes) and unstructured clinical notes authored by\nhealthcare providers. Although the dataset may inherently\ncontain noise, such as inconsistent abbreviations, irregular\nformatting, and typographical errors, we assume that the\ndata is largely clean.\nDataset Pre-processing.\nWe largely follow prior work on\nnext visit diagnosis prediction (Koo 2024, 2025). We strat-\nify the patient population by age into three groups: 18–40,\n41–60, 61+, and by race into six categories: Asian, Black,\nHispanic/Latino, Other, Unknown, and White. Other group\nis for those whose racial identification falls outside pre-\ndefined categories and the Unknown group is for those\nwhose racial information is missing or not obtained.\nFor clinical notes, we use only discharge summaries and\nadopt the pre-processing pipeline by Clinical Longformer\n(Li et al. 2022): removing de-identification placeholders,\nnormalising punctuation and non-alphanumeric symbols,\nlowercasing, and trimming whitespace. We further remove\nsex information for fairness quantification.\nFor diagnosis codes, we map ICD-9-CM diagnoses to the\nHCUP Clinical Classifications Software (CCS) hierarchy:\n17 multi-level diagnostic chapters (multi-level CCS1) and\n295 single-level categories (single-level CCS2). To reduce\ndimensionality while retaining clinical validity, we merge\nsparse or overlapping categories with the aid of ICD ontol-\nogy, thereby yielding 17 parental-level diagnostic systems\nand 46 child-level clinical sub-categories. Each patient re-\nceives an average of 9 diagnoses, with a maximum of 25.\nWe provide this mapping in Appendix 9.\nFinally, we restrict the cohort to patients with at least two\nvisits and consider only their most recent five visits. Also,\nwe do not include records with non-positive lengths of stay.\nText Degradation Simulation.\nWe simulate text corrup-\ntion by: lab-value omission (20–30%), prior-note duplica-\n1https://hcup-us.ahrq.gov/toolssoftware/ccs/AppendixCMultiDX.txt\n2https://hcup-us.ahrq.gov/toolssoftware/ccs/AppendixASingleDX.txt\ntion (30–40%), homophone substitution (5–15%), and OCR\njittering (5–15%). We apply a single degradation per note\nand do not stack multiple degradations.\nSub-population Stratification.\nWe sample 8k patients,\nbalancing API cost while maintaining subgroup distribu-\ntions. Summary statistics are reported in Table 1.\nVariable\nCategory\nCount\nProportion (%)\nRace\nWhite\n5,742\n71.78\nBlack\n1,153\n14.41\nHispanic/Latino\n381\n4.76\nOther\n263\n3.29\nAsian\n240\n3.00\nUnknown\n221\n2.76\nAge Group\n61+\n4,488\n56.10\n41–60\n2,404\n30.05\n18–40\n1,108\n13.85\nSex\nF\n4,035\n50.44\nM\n3,965\n49.56\nTable 1: Demographic Statistics of MIMIC-IV Data Upon\nPre-processing.\n4.2\nEvaluation Protocols\nInference\nsetup.\nWe\nevaluate\ntwo\nLLMs,\nGemini-2.0-Flash\n(Team\net\nal.\n2023)\nand\nGPT-4o-mini (Hurst et al. 2024). under a unified\nprompting framework (identical task description, input\nschema, and output format). Decoding is fixed with\ntemperature=0.0\nand\nmax tokens=1024.\nTheir\ncontext limits are: Gemini-2.0-Flash 1M tokens and\nGPT-4o-mini 128k tokens, thus the full prompt and visit\nnotes fit without truncation.\nPerformance metrics.\nWe report top-k recall and preci-\nsion. Especially, given an average of 9 true diagnoses per\npatient, we set a single fixed k of 10. Next, to assess fairness,\nwe compute True Positive Rate (TPR) and False Positive\nRate (FPR), as these metrics capture disparities in correctly\nidentifying conditions and in generating false alarms across\ngroups. We also report the area under the precision–recall\ncurve (AUPRC) for per-disease performance quantification.\n"}, {"page": 4, "text": "0.34\n0.36\n0.38\n0.40\n0.42\n0.44\n0.46\n0.48\n0.50\n0.470 / 0.021\n0.470 / 0.021\n0.471 / 0.021\n0.473 / 0.020\n0.472 / 0.020\n0.355 / 0.026\n0.355 / 0.023\n0.353 / 0.025\n0.353 / 0.025\n0.356 / 0.024\nRECALL@10 @ WHITE\n0.350\n0.375\n0.400\n0.425\n0.450\n0.475\n0.500\n0.525\n0.504 / 0.044\n0.499 / 0.045\n0.502 / 0.044\n0.503 / 0.048\n0.501 / 0.048\n0.379 / 0.055\n0.380 / 0.055\n0.373 / 0.059\n0.377 / 0.057\n0.380 / 0.057\nRECALL@10 @ BLACK\n0.35\n0.40\n0.45\n0.50\n0.55\n0.517 / 0.085\n0.513 / 0.085\n0.524 / 0.081\n0.518 / 0.079\n0.518 / 0.083\n0.392 / 0.100\n0.398 / 0.097\n0.394 / 0.103\n0.401 / 0.103\n0.392 / 0.103\nRECALL@10 @ HISPANIC_LATINO\n0.35\n0.40\n0.45\n0.50\n0.55\n0.482 / 0.101\n0.483 / 0.102\n0.482 / 0.105\n0.475 / 0.105\n0.492 / 0.102\n0.381 / 0.110\n0.383 / 0.120\n0.380 / 0.124\n0.391 / 0.121\n0.374 / 0.124\nRECALL@10 @ OTHER\n0.35\n0.40\n0.45\n0.50\n0.55\n0.509 / 0.100\n0.507 / 0.107\n0.509 / 0.100\n0.509 / 0.105\n0.521 / 0.101\n0.406 / 0.132\n0.403 / 0.125\n0.398 / 0.129\n0.404 / 0.119\n0.410 / 0.131\nRECALL@10 @ ASIAN\n0.35\n0.40\n0.45\n0.50\n0.476 / 0.111\n0.480 / 0.108\n0.474 / 0.112\n0.483 / 0.119\n0.479 / 0.115\n0.364 / 0.133\n0.365 / 0.138\n0.367 / 0.126\n0.367 / 0.126\n0.367 / 0.130\nRECALL@10 @ UNKNOWN\n0.28\n0.30\n0.32\n0.34\n0.36\n0.38\n0.40\n0.42\n0.394 / 0.025\n0.393 / 0.024\n0.394 / 0.024\n0.396 / 0.024\n0.396 / 0.024\n0.298 / 0.026\n0.296 / 0.025\n0.296 / 0.027\n0.296 / 0.027\n0.298 / 0.027\nPRECISION@10 @ WHITE\n0.26\n0.28\n0.30\n0.32\n0.34\n0.36\n0.38\n0.40\n0.42\n0.397 / 0.055\n0.396 / 0.056\n0.398 / 0.055\n0.399 / 0.057\n0.396 / 0.056\n0.297 / 0.060\n0.299 / 0.061\n0.292 / 0.060\n0.297 / 0.060\n0.296 / 0.059\nPRECISION@10 @ BLACK\n0.250\n0.275\n0.300\n0.325\n0.350\n0.375\n0.400\n0.372 / 0.097\n0.372 / 0.104\n0.379 / 0.099\n0.378 / 0.102\n0.378 / 0.102\n0.280 / 0.107\n0.284 / 0.104\n0.282 / 0.108\n0.286 / 0.114\n0.278 / 0.106\nPRECISION@10 @ HISPANIC_LATINO\n0.250\n0.275\n0.300\n0.325\n0.350\n0.375\n0.400\n0.425\n0.380 / 0.114\n0.378 / 0.115\n0.379 / 0.114\n0.370 / 0.116\n0.387 / 0.112\n0.293 / 0.119\n0.295 / 0.125\n0.293 / 0.124\n0.298 / 0.115\n0.286 / 0.122\nPRECISION@10 @ OTHER\n0.250\n0.275\n0.300\n0.325\n0.350\n0.375\n0.400\n0.425\n0.371 / 0.124\n0.369 / 0.131\n0.370 / 0.132\n0.374 / 0.129\n0.375 / 0.127\n0.293 / 0.143\n0.292 / 0.141\n0.284 / 0.134\n0.293 / 0.139\n0.298 / 0.143\nPRECISION@10 @ ASIAN\n0.250\n0.275\n0.300\n0.325\n0.350\n0.375\n0.400\n0.425\n0.378 / 0.134\n0.383 / 0.131\n0.375 / 0.130\n0.383 / 0.136\n0.379 / 0.139\n0.290 / 0.143\n0.288 / 0.150\n0.293 / 0.141\n0.297 / 0.145\n0.294 / 0.146\nPRECISION@10 @ UNKNOWN\nGemini-2.0-flash Clean\nGemini-2.0-flash Lab Value Erasure\nGemini-2.0-flash Copy and Paste\nGemini-2.0-flash OCR Jittering\nGemini-2.0-flash Homophone Substitution\nGPT-4o-mini Clean\nGPT-4o-mini Lab Value Erasure\nGPT-4o-mini Copy and Paste\nGPT-4o-mini OCR Jittering\nGPT-4o-mini Homophone Substitution\nFigure 2: Performance across Racial Groups under Original and Corruption Settings.\nBootstrapping is used to evaluate the reliability of\nsubgroup-specific estimates. By repeatedly resampling pa-\ntient data, we generate empirical distributions of the met-\nrics of interest. From these, 95% confidence intervals are de-\nrived, whose relative widths indicate the degree of variability\nacross subgroups. This approach quantifies the uncertainty\nin group-wise estimates and reveals potential disparities in\nrobustness and fairness.\n5\nAnalysis and Discussions\n5.1\nOverall Performance under Textual\nDegradation\nModel\nCorruption\nRecall@10\nPrecision@10\nGemini-2.0-Flash\nOriginal\n0.4787\n0.3918\nLab-Value Erasure\n0.4781\n0.3908\nPrior-note Duplication\n0.4799\n0.3924\nOCR Jittering\n0.4808\n0.3939\nHomophone Substitution\n0.4804\n0.3940\nGPT-4o-mini\nOriginal\n0.3629\n0.2961\nLab-Value Erasure\n0.3630\n0.2957\nPrior-note Duplication\n0.3608\n0.2944\nOCR Jittering\n0.3623\n0.2957\nHomophone Substitution\n0.3636\n0.2961\nTable 2: Performance under corruption settings. Mean val-\nues of Recall@10 and Precision@10 are reported.\nThe results in Table 2 indicate that Gemini-2.0-Flash\nconsistently outperforms GPT-4o-mini across both Re-\ncall@10 and Precision@10, demonstrating its superior per-\nformance under varying corruption settings. Interestingly,\nthe different forms of input corruption—such as lab-value\nomission, prior-note duplication, OCR jittering, and homo-\nphone substitution—tend to behave like mild data augmen-\ntation strategies, as they do not substantially degrade the\noverall retrieval performance.\nNevertheless, while metrics convey stability, they do\nnot provide sufficient insight into subgroup-level effects.\nIn particular, the impact of such corruptions on minor-\nity groups remains uncertain, both in terms of perfor-\nmance and fairness. We therefore assess fairness to deter-\nmine whether textual degradations disproportionately affect\nunder-represented populations.\n5.2\nSubgroup Diagnostic Disparities by Race\nNutritional and\nMetabolic Disorders\nHypertensive\nDiseases\nHeart Diseases\nSymptoms and Signs\nRenal and Urinary\nTract Disorders\nEndocrine and\nDiabetic Disorders\nOther Conditions and\nEvents\nAnemia and\nHematologic\nDisorders\nCentral Nervous\nSystem Disorders\nEnvironmental;\nMechanical; and\nIntentional Injuries\n0.00\n0.02\n0.04\n0.06\n0.08\nWHITE\nNutritional and\nMetabolic Disorders\nHypertensive\nDiseases\nEndocrine and\nDiabetic Disorders\nSymptoms and Signs\nHeart Diseases\nRenal and Urinary\nTract Disorders\nCentral Nervous\nSystem Disorders\nAnemia and\nHematologic\nDisorders\nAftercare and Other\nIssues\nOther Conditions and\nEvents\n0.00\n0.02\n0.04\n0.06\n0.08\nHISPANIC_LATINO\nNutritional and\nMetabolic Disorders\nHypertensive\nDiseases\nHeart Diseases\nSymptoms and Signs\nEndocrine and\nDiabetic Disorders\nOther Conditions and\nEvents\nAnemia and\nHematologic\nDisorders\nRenal and Urinary\nTract Disorders\nEnvironmental;\nMechanical; and\nIntentional Injuries\nAftercare and Other\nIssues\n0.00\n0.02\n0.04\n0.06\n0.08\nUNKNOWN\nFigure 3: Top-10 Child-level Clinical Sub-categories across\nRace Groups (for simplicity, we report results for three\ngroups: White, Hispanic/Latino, and Unknown).\nClinical Heterogeneity Across Racial Groups.\nAs pro-\nvided in Figure 3, white patients most often presented with\nnutritional, metabolic, hypertensive, and heart diseases, as\nwell as renal, endocrine, and diabetic disorders. Hispan-\nic/Latino patients showed a similar cardiometabolic pro-\nfile but with heightened representation of mood, anxiety,\nand cognitive disorders. Patients with Unknown race labels\n"}, {"page": 5, "text": "0.045\n0.050\n0.055\n0.060\n0.065\n0.070\n0.075\n0.080\n0.085\n0.078 / 0.028\n0.077 / 0.029\n0.077 / 0.028\n0.078 / 0.029\n0.078 / 0.029\n0.049 / 0.029\n0.049 / 0.027\n0.049 / 0.029\n0.049 / 0.031\n0.049 / 0.029\nTPR @ WHITE\n0.05\n0.06\n0.07\n0.08\n0.09\n0.081 / 0.064\n0.080 / 0.067\n0.080 / 0.065\n0.082 / 0.064\n0.080 / 0.065\n0.050 / 0.064\n0.051 / 0.067\n0.050 / 0.064\n0.050 / 0.065\n0.050 / 0.061\nTPR @ BLACK\n0.04\n0.05\n0.06\n0.07\n0.08\n0.074 / 0.111\n0.075 / 0.118\n0.075 / 0.112\n0.075 / 0.118\n0.075 / 0.117\n0.047 / 0.111\n0.048 / 0.110\n0.047 / 0.121\n0.048 / 0.122\n0.047 / 0.117\nTPR @ HISPANIC_LATINO\n0.04\n0.05\n0.06\n0.07\n0.08\n0.072 / 0.131\n0.072 / 0.134\n0.073 / 0.128\n0.070 / 0.138\n0.074 / 0.125\n0.048 / 0.132\n0.048 / 0.131\n0.048 / 0.131\n0.049 / 0.126\n0.046 / 0.130\nTPR @ OTHER\n0.04\n0.05\n0.06\n0.07\n0.08\n0.073 / 0.146\n0.073 / 0.154\n0.072 / 0.155\n0.073 / 0.150\n0.073 / 0.145\n0.048 / 0.153\n0.049 / 0.155\n0.046 / 0.154\n0.049 / 0.159\n0.049 / 0.160\nTPR @ ASIAN\n0.04\n0.05\n0.06\n0.07\n0.08\n0.071 / 0.147\n0.072 / 0.146\n0.071 / 0.143\n0.073 / 0.148\n0.070 / 0.154\n0.048 / 0.154\n0.047 / 0.164\n0.049 / 0.157\n0.048 / 0.164\n0.048 / 0.163\nTPR @ UNKNOWN\n0.040\n0.045\n0.050\n0.055\n0.060\n0.065\n0.059 / 0.038\n0.059 / 0.038\n0.058 / 0.038\n0.060 / 0.037\n0.059 / 0.036\n0.042 / 0.035\n0.043 / 0.035\n0.043 / 0.035\n0.043 / 0.034\n0.043 / 0.034\nFPR @ WHITE\n0.040\n0.045\n0.050\n0.055\n0.060\n0.065\n0.070\n0.062 / 0.079\n0.062 / 0.084\n0.060 / 0.083\n0.063 / 0.080\n0.063 / 0.080\n0.043 / 0.078\n0.044 / 0.076\n0.044 / 0.077\n0.043 / 0.081\n0.044 / 0.074\nFPR @ BLACK\n0.035\n0.040\n0.045\n0.050\n0.055\n0.060\n0.065\n0.059 / 0.139\n0.059 / 0.143\n0.057 / 0.134\n0.060 / 0.144\n0.060 / 0.139\n0.041 / 0.145\n0.041 / 0.136\n0.043 / 0.132\n0.041 / 0.147\n0.041 / 0.141\nFPR @ HISPANIC_LATINO\n0.035\n0.040\n0.045\n0.050\n0.055\n0.060\n0.065\n0.056 / 0.179\n0.055 / 0.178\n0.054 / 0.180\n0.058 / 0.181\n0.054 / 0.190\n0.042 / 0.159\n0.041 / 0.168\n0.041 / 0.158\n0.041 / 0.165\n0.041 / 0.173\nFPR @ OTHER\n0.035\n0.040\n0.045\n0.050\n0.055\n0.060\n0.065\n0.056 / 0.169\n0.056 / 0.178\n0.054 / 0.169\n0.055 / 0.185\n0.057 / 0.182\n0.042 / 0.168\n0.042 / 0.172\n0.042 / 0.163\n0.043 / 0.169\n0.041 / 0.175\nFPR @ ASIAN\n0.030\n0.035\n0.040\n0.045\n0.050\n0.055\n0.046 / 0.180\n0.045 / 0.199\n0.047 / 0.175\n0.047 / 0.198\n0.044 / 0.197\n0.035 / 0.192\n0.037 / 0.178\n0.037 / 0.188\n0.037 / 0.198\n0.038 / 0.185\nFPR @ UNKNOWN\nGemini-2.0-Flash Clean\nGemini-2.0-Flash Lab Value Erasure\nGemini-2.0-Flash Copy and Paste\nGemini-2.0-Flash OCR Jittering\nGemini-2.0-Flash Homophone Substitution\nGPT-4o-mini Clean\nGPT-4o-mini Lab Value Erasure\nGPT-4o-mini Copy and Paste\nGPT-4o-mini OCR Jittering\nGPT-4o-mini Homophone Substitution\nFigure 4: Fairness across Racial Groups under Original and Corruption Settings.\ndemonstrated comparatively greater frequencies of injury-\nrelated categories and other external causes, coupled with\nsubstantial renal and metabolic conditions, reflecting demo-\ngraphic and documentation disparities in clinical coding.\nPerformance Analysis.\nAs shown in Figure 2, minority\nracial subgroups exhibit heightened volatility in predictive\nmetrics when subjected to textual corruptions. Their re-\ncall@10 and precision@10 values not only fluctuate more\nsubstantially than those observed in the White cohort but\nalso present markedly broader bootstrap uncertainty inter-\nvals. These discrepancies persist even after controlling for\ncohort size, implying that instability is not merely a func-\ntion of smaller representation. Instead, they underscore that\ncurrent models generalise less reliably to minority popula-\ntions, rendering these groups disproportionately susceptible\nto degradation under textual perturbations and amplifying\nconcerns about clinical equity in deployment.\nFairness Analysis.\nFairness metrics corroborate the insta-\nbility observed in predictive performance (Figure 4). True\nPositive Rate (TPR) and False Positive Rate (FPR) vary sub-\nstantially more for minority groups under corruption, with\nboth means and error bars showing greater volatility. This\ninstability cannot be explained away by data scarcity, but\ninstead points to systematic fragility in how errors are dis-\ntributed across subgroups. Such sensitivity implies that mod-\nels which appear equitable under clean conditions may mask\nsignificant disparities under realistic perturbations, under-\nscoring the need to evaluate subgroup stability as a central\naspect of fairness. A detailed version of the table is included\nin the Appendix 10.\n5.3\nSubgroup Diagnostic Disparities by Age\nGroups\nClinical Heterogeneity Across Age Groups.\nYounger\nadults (18–40 years) most frequently presented with mood,\nanxiety, and cognitive disorders, symptoms-based visits, and\ninjury-related diagnoses. Middle-aged groups (41–60 years)\ndisplayed a shift toward metabolic, hypertensive, and en-\ndocrine or diabetic diseases, with emerging renal and cardio-\nvascular comorbidities. In older adults (61+ years), hyper-\ntensive, heart, renal, and metabolic disorders dominated the\ndiagnostic spectrum, emphasising age-dependent progres-\nsion from psychosomatic to chronic systemic conditions. We\nattach the regarding Figure 5.\nSymptoms and Signs\nMood; Anxiety; and\nCognitive Disorders\nNutritional and\nMetabolic Disorders\nOther Conditions and\nEvents\nCentral Nervous\nSystem Disorders\nAnemia and\nHematologic\nDisorders\nEnvironmental;\nMechanical; and\nIntentional Injuries\nPsychotic and\nSubstance Use\nDisorders\nLower\nGastrointestinal and\nAbdominal Disorders\nRenal and Urinary\nTract Disorders\n0.00\n0.02\n0.04\n0.06\n0.08\n18 40\nNutritional and\nMetabolic Disorders\nSymptoms and Signs\nHypertensive\nDiseases\nCentral Nervous\nSystem Disorders\nEndocrine and\nDiabetic Disorders\nHeart Diseases\nAnemia and\nHematologic\nDisorders\nOther Conditions and\nEvents\nRenal and Urinary\nTract Disorders\nMood; Anxiety; and\nCognitive Disorders\n0.00\n0.02\n0.04\n0.06\n0.08\n41 60\nHypertensive\nDiseases\nNutritional and\nMetabolic Disorders\nHeart Diseases\nRenal and Urinary\nTract Disorders\nSymptoms and Signs\nEndocrine and\nDiabetic Disorders\nAnemia and\nHematologic\nDisorders\nOther Conditions and\nEvents\nAftercare and Other\nIssues\nCentral Nervous\nSystem Disorders\n0.00\n0.02\n0.04\n0.06\n0.08\n61+\nFigure 5: Top-10 Child-level Clinical Sub-categories across\nAge Groups (18–40, 41–60, 61+).\nPerformance Analysis.\nPerformance across age groups\nrevealed an expected pattern of robustness. Older patients\n(61+) exhibited greater stability under textual corruptions,\nmaintaining consistent performance with narrower error\nbounds. Their performance remained steady even under se-\nvere perturbations. In contrast, younger patients (18–40)\nshowed notable volatility, with irregular fluctuations and\nwider uncertainty intervals. These trends suggest that insta-\nbility in younger groups likely stems from training data im-\n"}, {"page": 6, "text": "0.41\n0.42\n0.43\n0.44\nPerformance\n0.423 / 0.068\n0.429 / 0.066\n0.425 / 0.065\n0.424 / 0.064\n0.428 / 0.066\n0.423 / 0.068\n0.429 / 0.066\n0.425 / 0.065\n0.424 / 0.064\n0.428 / 0.066\nRECALL@10 @ 18 40\n0.345\n0.350\n0.355\n0.360\n0.365\n0.356 / 0.041\n0.355 / 0.042\n0.352 / 0.041\n0.356 / 0.040\n0.357 / 0.042\n0.356 / 0.041\n0.355 / 0.042\n0.352 / 0.041\n0.356 / 0.040\n0.357 / 0.042\nRECALL@10 @ 41 60\n0.344\n0.346\n0.348\n0.350\n0.352\n0.354\n0.356\n0.358\n0.352 / 0.024\n0.351 / 0.025\n0.349 / 0.025\n0.350 / 0.024\n0.351 / 0.023\n0.352 / 0.024\n0.351 / 0.025\n0.349 / 0.025\n0.350 / 0.024\n0.351 / 0.023\nRECALL@10 @ 61+\n0.215\n0.220\n0.225\n0.230\n0.235\n0.224 / 0.071\n0.227 / 0.070\n0.226 / 0.068\n0.224 / 0.069\n0.222 / 0.067\n0.224 / 0.071\n0.227 / 0.070\n0.226 / 0.068\n0.224 / 0.069\n0.222 / 0.067\nPRECISION@10 @ 18 40\n0.2650\n0.2675\n0.2700\n0.2725\n0.2750\n0.2775\n0.2800\n0.2825\n0.275 / 0.044\n0.273 / 0.044\n0.273 / 0.045\n0.275 / 0.044\n0.276 / 0.044\n0.275 / 0.044\n0.273 / 0.044\n0.273 / 0.045\n0.275 / 0.044\n0.276 / 0.044\nPRECISION@10 @ 41 60\n0.318\n0.320\n0.322\n0.324\n0.326\n0.328\n0.330\n0.332\n0.325 / 0.028\n0.325 / 0.028\n0.323 / 0.029\n0.325 / 0.028\n0.325 / 0.027\n0.325 / 0.028\n0.325 / 0.028\n0.323 / 0.029\n0.325 / 0.028\n0.325 / 0.027\nPRECISION@10 @ 61+\n0.053\n0.054\n0.055\n0.056\n0.057\n0.058\n0.059\nFairness\n0.057 / 0.075\n0.057 / 0.077\n0.056 / 0.076\n0.056 / 0.076\n0.056 / 0.077\n0.057 / 0.075\n0.057 / 0.077\n0.056 / 0.076\n0.056 / 0.076\n0.056 / 0.077\nTPR @ 18 40\n0.072\n0.073\n0.074\n0.075\n0.076\n0.074 / 0.046\n0.074 / 0.044\n0.073 / 0.046\n0.074 / 0.045\n0.074 / 0.046\n0.074 / 0.046\n0.074 / 0.044\n0.073 / 0.046\n0.074 / 0.045\n0.074 / 0.046\nTPR @ 41 60\n0.082\n0.083\n0.084\n0.085\n0.086\n0.087\n0.085 / 0.029\n0.084 / 0.030\n0.084 / 0.029\n0.086 / 0.029\n0.085 / 0.029\n0.085 / 0.029\n0.084 / 0.030\n0.084 / 0.029\n0.086 / 0.029\n0.085 / 0.029\nTPR @ 61+\n0.051\n0.052\n0.053\n0.054\n0.055\n0.056\n0.057\n0.058\n0.059\n0.056 / 0.085\n0.054 / 0.086\n0.054 / 0.083\n0.056 / 0.084\n0.055 / 0.089\n0.056 / 0.085\n0.054 / 0.086\n0.054 / 0.083\n0.056 / 0.084\n0.055 / 0.089\nFPR @ 18 40\n0.055\n0.056\n0.057\n0.058\n0.059\n0.060\n0.061\n0.062\n0.063\n0.059 / 0.056\n0.059 / 0.056\n0.057 / 0.055\n0.060 / 0.057\n0.059 / 0.058\n0.059 / 0.056\n0.059 / 0.056\n0.057 / 0.055\n0.060 / 0.057\n0.059 / 0.058\nFPR @ 41 60\n0.057\n0.058\n0.059\n0.060\n0.061\n0.062\n0.063\n0.060 / 0.044\n0.060 / 0.042\n0.059 / 0.043\n0.061 / 0.043\n0.060 / 0.043\n0.060 / 0.044\n0.060 / 0.042\n0.059 / 0.043\n0.061 / 0.043\n0.060 / 0.043\nFPR @ 61+\nGemini-2.0-flash Clean\nGemini-2.0-flash Lab Value Erasure\nGemini-2.0-flash Copy and Paste\nGemini-2.0-flash OCR Jittering\nGemini-2.0-flash Homophone Substitution\nGPT-4o-mini Clean\nGPT-4o-mini Lab Value Erasure\nGPT-4o-mini Copy and Paste\nGPT-4o-mini OCR Jittering\nGPT-4o-mini Homophone Substitution\nFigure 6: Performance and Fairness across Age Groups under Original and Corruption Settings.\nbalance rather than sample size limitations.\nFairness Analysis.\nFairness metrics echoed this age-\ndependent resilience. Among older patients (61+), TPR and\nFPR remained balanced and stable across corruptions, while\nyounger cohorts (18–40) exhibited greater variability in both\nmetrics. The middle-aged group again fell between these ex-\ntremes. Thus, fairness for older populations appears more\nrobust to corruptions, whereas younger subgroups face dis-\nproportionate degradation, emphasising the need to boost\nsubgroup stability under realistic text perturbations. The\ncomplete table is provided in the Appendix 11.\n5.4\nSub-group Diagnostic Disparities by Sex on\nDiagnosis Prediction\nNutritional and\nMetabolic Disorders\nHypertensive\nDiseases\nSymptoms and Signs\nHeart Diseases\nEndocrine and\nDiabetic Disorders\nRenal and Urinary\nTract Disorders\nAnemia and\nHematologic\nDisorders\nCentral Nervous\nSystem Disorders\nOther Conditions and\nEvents\nMood; Anxiety; and\nCognitive Disorders\n0.00\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\n0.07\nFemale\nNutritional and\nMetabolic Disorders\nHypertensive\nDiseases\nHeart Diseases\nSymptoms and Signs\nRenal and Urinary\nTract Disorders\nEndocrine and\nDiabetic Disorders\nOther Conditions and\nEvents\nAnemia and\nHematologic\nDisorders\nCentral Nervous\nSystem Disorders\nAftercare and Other\nIssues\n0.00\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\n0.07\nMale\nFigure 7: Top-10 Child-level Clinical Sub-categories across\nSex Groups (Female and Male).\nClinical Heterogeneity Across Sex Groups.\nBoth male\nand female patients most commonly exhibited nutritional\nand metabolic disorders, hypertensive and heart diseases, re-\nnal and urinary tract disorders, and endocrine or diabetic\n0.35\n0.40\n0.45\n0.50\nPerformance\n0.476 / 0.025\n0.476 / 0.025\n0.479 / 0.026\n0.481 / 0.024\n0.479 / 0.025\n0.363 / 0.030\n0.364 / 0.030\n0.362 / 0.030\n0.363 / 0.029\n0.363 / 0.031\nRECALL@10 @ F\n0.35\n0.40\n0.45\n0.50\n0.481 / 0.024\n0.480 / 0.025\n0.481 / 0.024\n0.481 / 0.025\n0.482 / 0.024\n0.363 / 0.029\n0.362 / 0.029\n0.360 / 0.028\n0.362 / 0.029\n0.364 / 0.030\nRECALL@10 @ M\n0.30\n0.35\n0.40\n0.386 / 0.030\n0.384 / 0.032\n0.386 / 0.030\n0.389 / 0.030\n0.388 / 0.031\n0.290 / 0.032\n0.291 / 0.033\n0.290 / 0.032\n0.290 / 0.032\n0.290 / 0.032\nPRECISION@10 @ F\n0.30\n0.35\n0.40\n0.398 / 0.029\n0.398 / 0.029\n0.399 / 0.029\n0.399 / 0.029\n0.400 / 0.029\n0.302 / 0.033\n0.301 / 0.032\n0.299 / 0.032\n0.301 / 0.033\n0.302 / 0.033\nPRECISION@10 @ M\n0.06\n0.08\nFairness\n0.076 / 0.036\n0.076 / 0.037\n0.076 / 0.035\n0.077 / 0.035\n0.076 / 0.036\n0.048 / 0.034\n0.048 / 0.035\n0.048 / 0.036\n0.048 / 0.035\n0.048 / 0.035\nTPR @ F\n0.06\n0.08\n0.079 / 0.033\n0.079 / 0.033\n0.079 / 0.033\n0.079 / 0.035\n0.079 / 0.033\n0.050 / 0.034\n0.050 / 0.035\n0.049 / 0.035\n0.050 / 0.035\n0.050 / 0.035\nTPR @ M\n0.04\n0.05\n0.06\n0.059 / 0.046\n0.059 / 0.046\n0.058 / 0.044\n0.061 / 0.046\n0.060 / 0.046\n0.042 / 0.040\n0.042 / 0.041\n0.042 / 0.042\n0.042 / 0.041\n0.043 / 0.040\nFPR @ F\n0.04\n0.05\n0.06\n0.059 / 0.045\n0.058 / 0.045\n0.058 / 0.043\n0.059 / 0.045\n0.059 / 0.044\n0.042 / 0.044\n0.043 / 0.043\n0.043 / 0.041\n0.043 / 0.043\n0.043 / 0.042\nFPR @ M\nGemini-2.0-flash Clean\nGemini-2.0-flash Lab Value Erasure\nGemini-2.0-flash Copy and Paste\nGemini-2.0-flash OCR Jittering\nGemini-2.0-flash Homophone Substitution\nGPT-4o-mini Clean\nGPT-4o-mini Lab Value Erasure\nGPT-4o-mini Copy and Paste\nGPT-4o-mini OCR Jittering\nGPT-4o-mini Homophone Substitution\nFigure 8: Performance and Fairness across Sex Groups un-\nder Original and Corruption Settings.\nconditions. Females showed a relatively higher proportion\nof mood, anxiety, and cognitive disorders, alongside after-\ncare and symptomatic visits. In contrast, males had slightly\ngreater representation in cardiovascular and renal condi-\ntions, reflecting sex-linked variations in cardiometabolic and\nneuropsychiatric disease burden.\nPerformance and Fairness Analysis.\nAcross sex sub-\ngroups, both performance and fairness metrics displayed re-\nmarkable consistency under textual corruption. Female and\nmale patients achieved nearly identical recall@10 and pre-\ncision@10 values with minimal fluctuations and tight con-\nfidence intervals across all perturbation types. Similarly,\nTPR and FPR remained stable and closely aligned between\ngroups, indicating balanced error distributions and robust\ngeneralisation. These results suggest that the model’s behav-\nior is relatively equitable and resilient across sexes, with no\nevident subgroup disproportionately affected by corruption-\ninduced degradation—contrasting with the disparities ob-\nserved along other demographic dimensions.\n"}, {"page": 7, "text": "Group\nSubgroup\nCriteria\nSettings\nNECHO v3 (Full)\nAblation Studies\nComparative Study\nw/o (i)\nw/o (ii)\nw/o (iii)\nParental-level\nOverall\n–\nPerformance\nOriginal\n0.3629\n0.3580\n0.3425\n0.1085\n0.9874\nCorruption\n0.3623\n0.3571\n0.3473\n0.0957\n0.9870\nSubgroup\nUnknown\nPerformance\nOriginal\n0.3637\n0.3597\n0.3534\n0.1016\n0.9865\nCorruption\n0.3673\n0.3606\n0.3529\n0.0942\n0.9861\nFairness\nOriginal\n0.0488\n0.0486\n0.0474\n0.0188\n0.0525\nCorruption\n0.0486\n0.0471\n0.0465\n0.0175\n0.0651\n18–40\nPerformance\nOriginal\n0.4235\n0.4173\n0.4180\n0.1224\n0.9868\nCorruption\n0.4238\n0.4188\n0.4112\n0.1135\n0.9864\nFairness\nOriginal\n0.0365\n0.0354\n0.0343\n0.0163\n0.0528\nCorruption\n0.0365\n0.0357\n0.0351\n0.0151\n0.0650\nTable 3: Ablation and comparative studies on overall and subgroup-specific (Unknown, 18–40) performance and fairness. The\nthree ablations correspond to (i) the hierarchical chain-of-thought (CoT), (ii) demographic information, and (iii) the proposed\nlabel mapping strategy.\nDisease\nOriginal\nOmission\nDuplication\nOCR\nHomophone\nRacial Group: Unknown\nCerebrovascular\nDisorders\n0.1521\n0.1553\n0.1635\n0.1517\n0.1457\nHematologic and\nEndocrine Cancers\n0.1927\n0.1843\n0.1903\n0.1866\n0.1918\nGastrointestinal\nCancers\n0.2024\n0.2218\n0.1977\n0.2173\n0.2057\nAge Group: 18–40\nHematologic and\nEndocrine Cancers\n0.3646\n0.2092\n0.3074\n0.2030\n0.2304\nCancers of\nOther Systems\n0.1342\n0.1001\n0.0903\n0.1772\n0.1137\nPostpartum and\nPuerperal\nComplications\n0.0335\n0.0335\n0.0335\n0.0334\n0.0334\nTable 4: Per-disease AUPRC under different corruption set-\ntings for minority subgroups based on race (Unknown) and\nage (18–40) using GPT-4o-mini.\n5.5\nAblation and Comparative Studies\nTable 3 summarises the ablation results for three key compo-\nnents of our framework: hierarchical CoT, demographic in-\nformation, and label mapping. Using GPT-4o-mini under\nOCR jittering—the most impactful corruption in our eval-\nuations—we observe that the full model consistently out-\nperforms all ablated variants in both accuracy and subgroup\nfairness. Demographic information improves calibration un-\nder noise, whereas removing label mapping markedly de-\ngrades performance. The strong parental-level results fur-\nther support the value of hierarchical CoT. Overall, the three\ncomponents jointly enable robust and equitable modelling.\n5.6\nLong-tailedness for Minority Subgroups\nTable 4 presents the per-disease AUPRC for minor-\nity subgroups under different corruption scenarios using\nGPT-4o-mini. Long-tailed diagnoses (tail classes) such\nas Physical Trauma and Injuries and Reproductive Disor-\nders among the 18–40 age group (AUPRC < 0.20), as well\nas Cerebrovascular Disorders and Gastrointestinal Cancers\namong patients with unknown race (AUPRC < 0.40), ex-\nhibit persistently low predictive performance. These find-\nings suggest that infrequent clinical conditions remain chal-\nlenging to model even under clean inputs, and that textual\ncorruption further amplifies the performance disparities ob-\nserved in under-represented subpopulations.\n6\nConclusion\nWe evaluate LLMs for next-visit diagnosis prediction using\nthe MIMIC-IV dataset, focusing on resilience to textual cor-\nruption. Despite stable overall performance, significant vari-\nability emerges in minority subgroups and tail diagnoses,\nposing fairness risks for clinical deployment. To mitigate\nthese issues, we introduce NECHO v3, which integrates la-\nbel reduction with hierarchical CoT reasoning to enhance\nrobustness and equity under degraded texts.\nOur study has several limitations. First, the analysis relies\non a single dataset, which may not generalise to other clin-\nical settings. Second, we use zero-shot evaluation, whereas\nreal-world systems often incorporate local fine-tuning that\ncould shift performance and fairness outcomes. Third, real-\nworld textual noise typically arises from interacting sources,\nwhile our corruptions are assessed independently. We en-\ncourage future work to address these constraints.\n7\nEthical Considerations\nThis study highlights that textual degradations increase\nLLM uncertainty and may unevenly affect demographic sub-\ngroups, potentially reinforcing existing inequities in clini-\ncal decision support. While our approach mitigates some\nof these risks through improved robustness and fairness,\nresponsible deployment requires ongoing monitoring and\nadherence to institutional governance. LLM-assisted pre-\ndictions should complement—rather than replace—clinical\njudgement, especially where heightened uncertainty could\ndisproportionately impact vulnerable populations.\n"}, {"page": 8, "text": "References\nBayer, M.; Kaufhold, M.-A.; and Reuter, C. 2022. A survey\non data augmentation for text classification. ACM Comput-\ning Surveys, 55(7): 1–39.\nBedi, S.; Liu, Y.; Orr-Ewing, L.; Dash, D.; Koyejo, S.;\nCallahan, A.; Fries, J. A.; Wornow, M.; Swaminathan, A.;\nLehmann, L. S.; et al. 2024. Testing and evaluation of health\ncare applications of large language models: a systematic re-\nview. JAMA.\nBerndt, D. J.; McCart, J. A.; Finch, D. K.; and Luther, S. L.\n2015. A case study of data quality in text mining clinical\nprogress notes. ACM Transactions on Management Infor-\nmation Systems (TMIS), 6(1): 1–21.\nBhatt, U.; Antor´an, J.; Zhang, Y.; Liao, Q. V.; Sattigeri,\nP.; Fogliato, R.; Melanc¸on, G.; Krishnan, R.; Stanley, J.;\nTickoo, O.; et al. 2021.\nUncertainty as a form of trans-\nparency: Measuring, communicating, and using uncertainty.\nIn Proceedings of the 2021 AAAI/ACM Conference on AI,\nEthics, and Society, 401–413.\nBiondich, P. G.; Overhage, J. M.; Dexter, P. R.; Downs,\nS. M.; Lemmon, L.; and McDonald, C. J. 2002. A modern\noptical character recognition system in a real world clinical\nsetting: some accuracy and feasibility observations. In Pro-\nceedings of the AMIA Symposium, 56.\nChen, R. J.; Wang, J. J.; Williamson, D. F.; Chen, T. Y.; Lip-\nkova, J.; Lu, M. Y.; Sahai, S.; and Mahmood, F. 2023. Al-\ngorithmic fairness in artificial intelligence for medicine and\nhealthcare. Nature biomedical engineering, 7(6): 719–742.\nGetzen, E.; Ungar, L.; Mowery, D.; Jiang, X.; and Long, Q.\n2023. Mining for equitable health: Assessing the impact of\nmissing data in electronic health records. Journal of biomed-\nical informatics, 139: 104269.\nHurst, A.; Lerer, A.; Goucher, A. P.; Perelman, A.; Ramesh,\nA.; Clark, A.; Ostrow, A.; Welihinda, A.; Hayes, A.; Rad-\nford, A.; et al. 2024. Gpt-4o system card. arXiv preprint\narXiv:2410.21276.\nJohnson, A. E.; Bulgarelli, L.; Shen, L.; Gayles, A.; Sham-\nmout, A.; Horng, S.; Pollard, T. J.; Hao, S.; Moody, B.; Gow,\nB.; et al. 2023. MIMIC-IV, a freely accessible electronic\nhealth record dataset. Scientific data, 10(1): 1.\nKalisch, B. J.; Landstrom, G. L.; and Hinshaw, A. S. 2009.\nMissed nursing care: a concept analysis.\nJournal of ad-\nvanced nursing, 65(7): 1509–1517.\nKoo, H. 2023. A survey on generative diffusion models for\nstructured data. arXiv preprint arXiv:2306.04139.\nKoo, H. 2024. Next Visit Diagnosis Prediction via Medical\nCode-Centric Multimodal Contrastive EHR Modelling with\nHierarchical Regularisation. In Findings of the Association\nfor Computational Linguistics: EACL 2024, 41–55.\nKoo, H. 2025.\nOvercoming Uncertain Incompleteness\nfor Robust Multimodal Sequential Diagnosis Prediction via\nCurriculum Data Erasing Guided Knowledge Distillation.\nIn ICASSP 2025-2025 IEEE International Conference on\nAcoustics, Speech and Signal Processing (ICASSP), 1–5.\nKoo, H.; and Kim, T. E. 2023.\nA comprehensive survey\non generative diffusion models for structured data. arXiv\npreprint arXiv:2306.04139.\nLatif, S.; Qadir, J.; Qayyum, A.; Usama, M.; and Younis,\nS. 2020. Speech technology for healthcare: Opportunities,\nchallenges, and state of the art. IEEE Reviews in Biomedical\nEngineering, 14: 342–356.\nLi, Y.; Du, M.; Song, R.; Wang, X.; and Wang, Y. 2023. A\nsurvey on fairness in large language models. arXiv preprint\narXiv:2308.10149.\nLi, Y.; Wehbe, R. M.; Ahmad, F. S.; Wang, H.; and\nLuo, Y. 2022.\nClinical-longformer and clinical-bigbird:\nTransformers for long clinical sequences.\narXiv preprint\narXiv:2201.11838.\nMoradi, M.; Blagec, K.; and Samwald, M. 2021. Deep learn-\ning models are not robust against noise in clinical text. arXiv\npreprint arXiv:2108.12242.\nO’Donnell, H. C.; Kaushal, R.; Barr´on, Y.; Callahan, M. A.;\nAdelman, R. D.; and Siegler, E. L. 2009. Physicians’ atti-\ntudes towards copy and pasting in electronic note writing.\nJournal of general internal medicine, 24(1): 63–68.\nRajkomar, A.; Hardt, M.; Howell, M. D.; Corrado, G.; and\nChin, M. H. 2018. Ensuring fairness in machine learning to\nadvance health equity. Annals of internal medicine, 169(12):\n866–872.\nShen, K. 2024.\nThe generalization and robustness of\ntransformer-based language models on commonsense rea-\nsoning. In Proceedings of the AAAI Conference on Artificial\nIntelligence, volume 38, 23419–23420.\nShorten, C.; Khoshgoftaar, T. M.; and Furht, B. 2021. Text\ndata augmentation for deep learning. Journal of big Data,\n8(1): 101.\nSingh, A.; Singh, N.; and Vatsal, S. 2024. Robustness of llms\nto perturbations in text. arXiv preprint arXiv:2407.08989.\nSutton, R. T.; Pincock, D.; Baumgart, D. C.; Sadowski,\nD. C.; Fedorak, R. N.; and Kroeker, K. I. 2020. An overview\nof clinical decision support systems: benefits, risks, and\nstrategies for success. NPJ digital medicine, 3(1): 17.\nTeam, G.; Anil, R.; Borgeaud, S.; Alayrac, J.-B.; Yu, J.; Sori-\ncut, R.; Schalkwyk, J.; Dai, A. M.; Hauth, A.; Millican, K.;\net al. 2023. Gemini: a family of highly capable multimodal\nmodels. arXiv preprint arXiv:2312.11805.\nWei, J.; Wang, X.; Schuurmans, D.; Bosma, M.; Xia, F.;\nChi, E.; Le, Q. V.; Zhou, D.; et al. 2022.\nChain-of-\nthought prompting elicits reasoning in large language mod-\nels. Advances in neural information processing systems, 35:\n24824–24837.\nWu, Y.; Schlegel, V.; and Batista-Navarro, R. 2025.\nPay\nAttention to Real World Perturbations! Natural Robustness\nEvaluation in Machine Reading Comprehension.\narXiv\npreprint arXiv:2502.16523.\nZhang, Y.; Hou, S.; Ma, M. D.; Wang, W.; Chen, M.; and\nZhao, J. 2024. Climb: A benchmark of clinical bias in large\nlanguage models. arXiv preprint arXiv:2407.05250.\nZhao, Y.; Wang, H.; Liu, Y.; Suhuang, W.; Wu, X.; and\nZheng, Y. 2024. Can LLMs Replace Clinical Doctors? Ex-\nploring Bias in Disease Diagnosis by Large Language Mod-\nels. In Findings of the Association for Computational Lin-\nguistics: EMNLP 2024, 13914–13935.\n"}, {"page": 9, "text": "8\nPrompt\nAn example of a complete prompt template for next visit diagnosis prediction\nYou are an experienced critical care physician working in an Intensive Care Unit (ICU). You are skilled in interpreting ICU discharge\nsummaries of patients, and predicting clinical outcomes based on the patient’s status at the time of discharge and their overall\nhospital course.\nYour primary task is to assess the patient’s complete longitudinal ICU record—**all prior and current ICU discharge summaries\ntogether with basic demographic information**—to predict which diagnosis categories (from the predefined candidate set) are most\nlikely to be coded at the patient’s next hospital visit.\nThe diagnostic taxonomy is hierarchical. Use the following structure:\n**Parent diagnostic systems** (e.g., ”Diseases of the Circulatory System”)\n→**Child-level clinical subcategories** (e.g., ”Cardiac Conditions”, ”Cerebrovascular Disorders”)\nUse the following clinical features to guide your prediction:\n- Longitudinal comorbidities (e.g., CHF, diabetes, COPD)\n- Acute-on-chronic exacerbations and organ failure\n- New or recurrent infections\n- ICU interventions (e.g., ventilation, dialysis, vasopressors)\n- Functional decline or unresolved complications at discharge\n- Trends in labs, imaging, or organ support\n- Discharge disposition (e.g., home, rehab, hospice)\n—\n### Candidate Parent Diagnostic Systems\n- Perinatal and Congenital Conditions\n- Diseases of the Blood and Immune System\n- Diseases of the Circulatory System\n- Diseases of the Respiratory System\n- Diseases of the Digestive System\n- Diseases of the Genitourinary System\n- Pregnancy; Childbirth; and Postpartum Complications\n- Diseases of the Musculoskeletal and Connective Tissue\n- Diseases of the Nervous System and Sense Organs\n- Endocrine; Nutritional; and Metabolic Diseases\n- Infectious and Parasitic Diseases\n- Diseases of the Skin and Subcutaneous Tissue\n- Injury; Poisoning; and External Causes\n- Symptoms, Signs, and Other Conditions\n- Mental; Behavioral; and Neurodevelopmental Disorder\n- Neoplasms\n- External Causes of Morbidity (E-Codes)\n—\n### Allowed Child Subcategories\nYou must select one or more child-level subcategories **only** from this predefined mapping:\n{\n”Perinatal and Congenital Conditions”: [\n”Neonatal Trauma and Injury”,\n”Other Perinatal Conditions”,\n”Congenital Anomalies”\n],\n”Diseases of the Blood and Immune System”: [\n”Anemia and Hematologic Disorders”,\n”Immunologic Disorders”\n],\n... (Omitted for brevity)\n}\n"}, {"page": 10, "text": "For each selected **parent-level diagnostic system**, you **MUST** select **one or more** clinically plausible child-\nlevel diagnosis categories. If the patient’s record supports multiple complications, sequelae, or chronic comorbidities within a\nsystem, include **all applicable child categories**. Avoid under-selecting. Draw upon clinical history, trends, and discharge markers.\n—\n### Step-by-Step Reasoning Process\n1. **Timeline Synthesis**: Describe how the patient’s health has evolved across ICU encounters (e.g., persistent CHF, recent sepsis,\nrenal decline).\n2. **Diagnostic Trait Inference**: Infer clinical risks based on underlying disease traits or complications (e.g., steroid use →\ninfection risk, multiple admissions →critical illness).\n3. **Parent-Level Filtering**: Select all high-level diagnostic systems relevant to the patient’s longitudinal profile.\n4. **Subcategory Disambiguation**: For each selected parent, choose **one or more** matching child-level categories, based\nstrictly on the allowed schema.\n5. **Prediction**: Output a JSON dictionary mapping each parent to its most plausible child categories.\n—\n### Output Format\nReturn a single JSON object with **exactly two keys**:\n1. ‘”think”‘: A clinical reasoning narrative (less than 150 words), including timeline synthesis, pathophysiological reasoning, and\njustification for each selected parent and subcategory.\n2. ‘”answer”‘: A dictionary mapping each predicted **parent-level diagnostic system** to a **list of one or more** predicted\nchild-level categories.\n—\n### Example Output:\n“‘json\n{ ”think”: ”This patient has had multiple ICU admissions over 18 months for acute decompensated heart failure with reduced\nejection fraction and atrial fibrillation, complicated by pulmonary edema and cardiogenic shock requiring inotropes. Renal function\nshows progressive chronic kidney disease with episodes of acute tubular injury during volume shifts. The course has been further\ncomplicated by recurrent MRSA pneumonia necessitating intubation and prolonged antibiotics, as well as chronic steroid use for\nautoimmune vasculitis. At the most recent discharge, the patient had unresolved fluid overload and borderline oxygenation and was\ntransferred to a skilled nursing facility. Overall, the patient remains at high risk for recurrent cardiac decompensation, infectious\ncomplications, worsening renal failure, and continued critical illness.”,\n”answer”:\n”Diseases of the Circulatory System”: [ ”Heart Diseases”, ”Peripheral and Venous Diseases” ],\n”Diseases of the Respiratory System”: [ ”Respiratory Infections” ],\n”Diseases of the Genitourinary System”: [ ”Renal and Urinary Tract Disorders” ],\n”Infectious and Parasitic Diseases”: [ ”Bacterial and Septic Infections”, ”Viral; Mycotic; and Other Infections” ] } ”’\n9\nDiagnosis Mapping\nParent-Level Diagnostic Systems\nChild-level Clinical Sub-categories\nSpecific Diagnoses\nPerinatal and Congenital Conditions\nNeonatal Trauma and Injury\nFracture of skull or face\nFracture of arm\nFracture of leg\nOther fracture\nBirth trauma\nJoint injury\nSpinal cord injury\nOther Perinatal Conditions\nLow birth weight\nPerinatal jaundice\nBirth asphyxia\nLiveborn infant\nOther perinatal diseases\n"}, {"page": 11, "text": "Parent-Level Diagnostic Systems\nChild-level Clinical Sub-categories\nSpecific Diagnoses\nCongenital Anomalies\nNervous system congenital anomaly\nFracture of hip\nOther congenital anomalies\nGastrointestinal congenital anomaly\nGenitourinary congenital anomaly\nCardiac anomalies\nDiseases of the Blood and Immune\nSystem\nAnemia and Hematologic Disorders\nAnemia\nAcute post-hemorrhagic anemia\nSickle cell\nCoagulation and hemorrhagic disorders\nWhite blood cell disorders\nOther hematologic diseases\nImmunologic Disorders\nImmunity disorders\nDiseases of the Circulatory System\nHeart Diseases\nHeart valve disease\nCarditis\nAcute myocardial infarction\nCoronary atherosclerosis\nPulmonary heart disease\nOther heart diseases\nConduction disorders\nChest pain\nCardiac dysrhythmia\nCardiac arrest\nCongestive heart failure; non-hypertensive\nHypertensive Diseases\nHypertension\nHypertension complications\nCerebrovascular Disorders\nAcute cerebrovascular disease\nPre-cerebral occlusion\nOther cerebrovascular diseases\nTransient ischemic attack\nLate effects of cerebrovascular disease\nPeripheral and Venous Diseases\nPeripheral atherosclerosis\nAneurysm\nArterial embolism\nOther circulatory diseases\nPhlebitis\nVaricose vein\nOther vein disorders\nDiseases of the Respiratory System\nRespiratory Infections\nPneumonia\nInfluenza\nTonsillitis\nBronchitis\nOther upper respiratory infections\nChronic and Obstructive Pulmonary\nDiseases\nChronic obstructive pulmonary disease\nAsthma\nOther Respiratory Conditions\nAspiration pneumonia\nPleurisy\nRespiratory distress\nAdult respiratory failure\nLung diseases due to external agents\nOther lower respiratory diseases\nOther upper respiratory diseases\nDiseases of the Digestive System\nUpper Gastrointestinal Disorders\nEsophageal disease\nGastric and duodenal ulcer\nGastritis\nOther diseases of stomach\nGastroenteritis\nGastrointestinal hemorrhage\n"}, {"page": 12, "text": "Parent-Level Diagnostic Systems\nChild-level Clinical Sub-categories\nSpecific Diagnoses\nLower Gastrointestinal and Abdominal\nDisorders\nAppendicitis\nUlcerative colitis\nIntestinal obstruction\nDiverticulosis\nAnal and rectal conditions\nAbdominal hernia\nPeritonitis\nHemorrhoids\nOther gastrointestinal diseases\nHepatic and Pancreatic Disorders\nOther liver diseases\nPancreas disease\nBiliary disease\nOral and Dental Conditions\nTeeth diseases\nMouth diseases\nDiseases of the Genitourinary System\nRenal and Urinary Tract Disorders\nNephritis\nAcute renal failure\nChronic kidney disease\nUrinary tract infection\nUrinary stone\nOther diseases of kidney\nOther diseases of bladder\nOther genitourinary diseases\nReproductive Disorders\nPelvic inflammatory disease\nEndometriosis\nProlapse\nMenstrual disorders\nOvarian cyst\nMenopausal disorders\nFemale infertility\nBreast disease\nContraceptive management\nOther female genital disorders\nInfections of male genital organs\nOther male genital disorders\nBenign prostatic hyperplasia\nPregnancy; Childbirth; and Postpartum\nComplications\nPregnancy Complications\nInduced abortion\nSpontaneous abortion\nAbortion complications\nEctopic pregnancy\nLong pregnancy\nEarly labor\nMalposition of fetus\nPelvic obstruction\nDiabetes mellitus in pregnancy\nHypertension in pregnancy\nHemorrhage in pregnancy\nPrevious C-section\nOther pregnancy complications\nLabor and Delivery Complications\nFetal distress\nAmniotic fluid disorders\nUmbilical cord complications\nObstetrics-related perinatal trauma\nForceps delivery\nOther complications of birth\nOther pregnancy and delivery\nincluding normal\nPostpartum and Puerperal Complica-\ntions\nOsteoarthros\nOther joint diseases\nDiseases of the Musculoskeletal and\nConnective Tissue\nAutoimmune and Connective Tissue\nDisorders\nSystemic lupus erythematosus\nInfectious arthritis\nRheumatoid arthritis\nOther connective tissue disorders\n"}, {"page": 13, "text": "Parent-Level Diagnostic Systems\nChild-level Clinical Sub-categories\nSpecific Diagnoses\nSkeletal and Acquired Musculoskeletal\nDisorders\nOsteoporosis\nOther bone diseases\nPathological fracture\nBack problem\nAcquired foot deformity\nDiseases of the Nervous System and\nSense Organs\nCentral Nervous System Disorders\nEpilepsy and convulsive disorders\nMeningitis\nEncephalitis\nOther CNS infections\nParkinson’s disease\nMultiple sclerosis\nOther hereditary central nervous system\ndiseases\nOther nervous system diseases\nHeadache and migraine\nComa and brain damage\nParalysis\nSensory and Vestibular Disorders\nEye infection\nCataract\nRetinal disease\nGlaucoma\nOther eye diseases\nOtitis media\nDizziness\nOther ear diseases\nEndocrine; Nutritional; and Metabolic\nDiseases\nEndocrine and Diabetic Disorders\nThyroid disorders\nDiabetes Mellitus without complications\nDiabetes Mellitus with complications\nOther endocrine disorders\nNutritional and Metabolic Disorders\nNutritional deficiencies\nHyperlipidemia\nGout and other crystal arthropathies\nFluid and electrolyte disorders\nCystic fibrosis\nOther nutritional and metabolic disorders\nInfectious and Parasitic Diseases\nBacterial and Septic Infections\nTuberculosis\nSepticemia\nIntestinal infection\nOther bacterial infections\nViral; Mycotic; and Other Infections\nHIV infection\nHepatitis\nViral infection\nMycoses\nOther infectious diseases\nSexually Transmitted and Preventive\nConditions\nSexual Infections\nImmunization and screening\nDiseases of the Skin and Subcutaneous\nTissue\nInflammatory and Infectious Skin Dis-\norders\nSkin infection\nSkin ulcer\nOther skin diseases\nOther inflammatory skin conditions\nOther acquired deformities\nInjury; Poisoning; and External Causes\nPhysical Trauma and Injuries\nSprain\nIntracranial injury\nCrush injury\nOpen wound of head\nOpen wound of extremity\nSuperficial injury\nBurns\nOther injury\n"}, {"page": 14, "text": "Parent-Level Diagnostic Systems\nChild-level Clinical Sub-categories\nSpecific Diagnoses\nToxicological and Iatrogenic Complica-\ntions\nPoisoning by psychiatric medications\nPoisoning by other medications\nPoisoning by non-medications\nProcedure complications\nDevice complications\nSymptoms, Signs, and Other\nConditions\nSymptoms and Signs\nSyncope\nFever of unknown origin\nLymph node enlargement\nGangrene\nShock\nNausea and vomiting\nAbdominal pain\nFatigue\nAllergy\nUnclassified\nAftercare and Other Issues\nRehabilitation\nSocial and administrative problems\nExamination and evaluation\nOther aftercare\nOther screening\nMental; Behavioral; and\nNeurodevelopmental Disorders\nNeurodevelopmental and Pediatric Dis-\norders\nDevelopmental disorders\nDisorders diagnosed in infancy/childhood\nAttention-deficit/conduct/disruptive\nbehavior disorders\nImpulse control disorders\nBlindness\nMood; Anxiety; and Cognitive Disor-\nders\nAdjustment disorders\nAnxiety disorders\nMood disorders\nPersonality disorders\nPsychotic and Substance Use Disorders\nSchizophrenia and other psychotic\ndisorders\nAlcohol-related disorders\nSubstance-related disorders\nOther Conditions and Events\nDelirium/dementia/amnesia/cognitive\ndisorders\nMiscellaneous mental health disorders\nSuicide and intentional self-inflicted injury\nMental health screening or history\nNeoplasms\nGastrointestinal Cancers\nEsophageal cancer\nStomach cancer\nColon cancer\nRectal or anal cancer\nPancreatic cancer\nGastrointestinal and peritoneal cancer\nHead; Neck; and Thoracic Cancers\nHead or neck cancer\nBronchus/lung cancer\nOther respiratory cancer\nUrogenital and Reproductive Cancers\nBreast cancer\nUterine cancer\nOvary cancer\nCervical cancer\nFemale genital cancer\nProstate cancer\nTesticular cancer\nMale genital cancer\nBladder cancer\nKidney and renal cancer\nUrinary organ cancer\n"}, {"page": 15, "text": "Parent-Level Diagnostic Systems\nChild-level Clinical Sub-categories\nSpecific Diagnoses\nHematologic and Endocrine Cancers\nHodgkin’s disease\nNon-Hodgkin lymphoma\nLeukemias\nMultiple myeloma\nThyroid cancer\nCancers of Other Systems\nBrain/nervous system cancer\nBone/connective tissue cancer\nSkin melanoma\nNon-epithelial cancer\nOther primary cancer\nSecondary malignancy\nLiver or inflammatory bowel disease\ncancer\nBenign Neoplasms\nBenign uterine neoplasm\nOther benign neoplasm\nUnspecified Neoplasms and Other Con-\nditions\nMalignant neoplasm\nNeoplasm unspecified\nMaintenance chemotherapy/radiation\nExternal Causes of Morbidity\n(E-Codes)\nEnvironmental; Mechanical; and Inten-\ntional Injuries\nE codes: Cut or pierce\nE codes: Drowning or submersion\nE codes: Fall\nE codes: Fire or burn\nE codes: Firearm\nE codes: Machinery\nE codes: Motor vehicle traffic\nE codes: Pedal cyclist\nE codes: Pedestrian\nE codes: Transport not motor vehicle traffic\nE codes: Environmental causes\nE codes: Overexertion\nE codes: Poisoning\nE codes: Struck by or against\nE codes: Suffocation\nE codes: Adverse effects of medical care\nE codes: Adverse effects of medical drugs\nE codes: Other specified and classifiable\nE codes: Other specified NEC\nE codes: Unspecified\nE codes: Place of occurrence\n10\nPerformance and Fairness across Racial Groups under Original and Corruption Settings.\nModel\nType\nRacial Groups (Set 1)\nWHITE\nBLACK\nHISPANIC LATINO\nRecall@10\nPrecision@10\nRecall@10\nPrecision@10\nRecall@10\nPrecision@10\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nGemini-2.0-Flash\nOriginal\n0.4698\n0.0205\n0.3939\n0.0245\n0.5038\n0.0436\n0.3973\n0.0546\n0.5172\n0.0850\n0.3725\n0.0972\nLab-Value Erasure\n0.4700\n0.0212\n0.3929\n0.0244\n0.4992\n0.0453\n0.3956\n0.0563\n0.5134\n0.0849\n0.3719\n0.1038\nPrior-note Duplication\n0.4714\n0.0208\n0.3944\n0.0240\n0.5019\n0.0443\n0.3984\n0.0553\n0.5242\n0.0805\n0.3786\n0.0992\nOCR Jittering\n0.4729\n0.0197\n0.3963\n0.0240\n0.5034\n0.0476\n0.3988\n0.0574\n0.5176\n0.0790\n0.3777\n0.1015\nHomophone Substitution\n0.4716\n0.0204\n0.3964\n0.0244\n0.5015\n0.0482\n0.3957\n0.0557\n0.5176\n0.0830\n0.3777\n0.1015\nGPT-4o-mini\nOriginal\n0.3552\n0.0256\n0.2976\n0.0264\n0.3790\n0.0554\n0.2968\n0.0604\n0.3917\n0.0999\n0.2801\n0.1071\nLab-Value Erasure\n0.3546\n0.0232\n0.2962\n0.0249\n0.3800\n0.0549\n0.2989\n0.0607\n0.3982\n0.0965\n0.2839\n0.1045\nPrior-note Duplication\n0.3534\n0.0245\n0.2963\n0.0268\n0.3730\n0.0587\n0.2921\n0.0604\n0.3944\n0.1029\n0.2821\n0.1082\nOCR Jittering\n0.3535\n0.0248\n0.2960\n0.0269\n0.3769\n0.0572\n0.2971\n0.0600\n0.4013\n0.1033\n0.2858\n0.1139\nHomophone Substitution\n0.3559\n0.0236\n0.2979\n0.0268\n0.3797\n0.0570\n0.2958\n0.0587\n0.3923\n0.1027\n0.2778\n0.1061\nTable 6: Performance under Corruption Settings across Racial Subgroups (Set 1). RW = relative width of 95% CI.\n"}, {"page": 16, "text": "Model\nType\nRacial Groups (Set 2)\nOTHER\nASIAN\nUNKNOWN\nRecall@10\nPrecision@10\nRecall@10\nPrecision@10\nRecall@10\nPrecision@10\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nGemini-2.0-Flash\nOriginal\n0.4819\n0.1005\n0.3796\n0.1142\n0.5093\n0.1004\n0.3714\n0.1245\n0.4758\n0.1114\n0.3775\n0.1343\nLab-Value Erasure\n0.4831\n0.1023\n0.3776\n0.1148\n0.5067\n0.1070\n0.3686\n0.1311\n0.4802\n0.1081\n0.3826\n0.1313\nPrior-note Duplication\n0.4824\n0.1055\n0.3786\n0.1135\n0.5089\n0.0998\n0.3700\n0.1318\n0.4744\n0.1123\n0.3754\n0.1302\nOCR Jittering\n0.4746\n0.1053\n0.3696\n0.1162\n0.5091\n0.1047\n0.3743\n0.1292\n0.4834\n0.1187\n0.3834\n0.1357\nHomophone Substitution\n0.4918\n0.1024\n0.3865\n0.1121\n0.5207\n0.1006\n0.3751\n0.1267\n0.4795\n0.1145\n0.3787\n0.1387\nGPT-4o-mini\nOriginal\n0.3808\n0.1097\n0.2933\n0.1193\n0.4058\n0.1318\n0.2933\n0.1435\n0.3637\n0.1330\n0.2900\n0.1433\nLab-Value Erasure\n0.3828\n0.1199\n0.2954\n0.1254\n0.4029\n0.1250\n0.2925\n0.1410\n0.3647\n0.1377\n0.2884\n0.1498\nPrior-note Duplication\n0.3798\n0.1242\n0.2928\n0.1238\n0.3984\n0.1293\n0.2836\n0.1338\n0.3666\n0.1259\n0.2928\n0.1413\nOCR Jittering\n0.3913\n0.1212\n0.2985\n0.1151\n0.4044\n0.1189\n0.2933\n0.1392\n0.3673\n0.1261\n0.2969\n0.1446\nHomophone Substitution\n0.3736\n0.1236\n0.2864\n0.1221\n0.4099\n0.1313\n0.2977\n0.1428\n0.3675\n0.1295\n0.2940\n0.1462\nTable 7: Performance under Corruption Settings across Racial Subgroups (Set 2). RW = relative width of 95% CI.\nModel\nType\nRacial Groups (Set 1)\nWHITE\nBLACK\nHISPANIC LATINO\nTPR\nFPR\nTPR\nFPR\nTPR\nFPR\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nGemini-2.0-Flash\nOriginal\n0.0777\n0.0284\n0.0593\n0.0384\n0.0809\n0.0641\n0.0620\n0.0794\n0.0745\n0.1111\n0.0594\n0.1392\nLab-Value Erasure\n0.0772\n0.0286\n0.0590\n0.0385\n0.0802\n0.0666\n0.0618\n0.0837\n0.0750\n0.1178\n0.0586\n0.1433\nPrior-note Duplication\n0.0773\n0.0277\n0.0581\n0.0378\n0.0804\n0.0650\n0.0603\n0.0829\n0.0752\n0.1124\n0.0568\n0.1337\nOCR Jittering\n0.0782\n0.0285\n0.0602\n0.0369\n0.0816\n0.0643\n0.0630\n0.0802\n0.0752\n0.1183\n0.0596\n0.1437\nHomophone Substitution\n0.0779\n0.0286\n0.0593\n0.0360\n0.0804\n0.0648\n0.0629\n0.0803\n0.0751\n0.1170\n0.0602\n0.1385\nGPT-4o-mini\nOriginal\n0.0488\n0.0286\n0.0424\n0.0349\n0.0501\n0.0638\n0.0427\n0.0779\n0.0474\n0.1112\n0.0411\n0.1447\nLab-Value Erasure\n0.0485\n0.0267\n0.0425\n0.0347\n0.0505\n0.0669\n0.0440\n0.0764\n0.0482\n0.1103\n0.0414\n0.1364\nPrior-note Duplication\n0.0485\n0.0288\n0.0425\n0.0350\n0.0497\n0.0638\n0.0436\n0.0772\n0.0473\n0.1210\n0.0426\n0.1317\nOCR Jittering\n0.0486\n0.0306\n0.0427\n0.0342\n0.0501\n0.0648\n0.0430\n0.0813\n0.0477\n0.1222\n0.0409\n0.1467\nHomophone Substitution\n0.0487\n0.0290\n0.0426\n0.0336\n0.0501\n0.0610\n0.0438\n0.0745\n0.0468\n0.1174\n0.0414\n0.1410\nTable 8: Fairness under Corruption Settings across Racial Subgroups (Set 1). RW = relative width of 95% CI.\nModel\nType\nRacial Groups (Set 2)\nOTHER\nASIAN\nUNKNOWN\nTPR\nFPR\nTPR\nFPR\nTPR\nFPR\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nGemini-2.0-Flash\nOriginal\n0.0721\n0.1307\n0.0559\n0.1788\n0.0732\n0.1461\n0.0563\n0.1691\n0.0714\n0.1474\n0.0460\n0.1798\nLab-Value Erasure\n0.0723\n0.1339\n0.0547\n0.1783\n0.0728\n0.1542\n0.0559\n0.1784\n0.0719\n0.1463\n0.0451\n0.1985\nPrior-note Duplication\n0.0726\n0.1275\n0.0542\n0.1798\n0.0722\n0.1555\n0.0542\n0.1690\n0.0711\n0.1426\n0.0466\n0.1753\nOCR Jittering\n0.0701\n0.1380\n0.0576\n0.1809\n0.0731\n0.1500\n0.0553\n0.1854\n0.0733\n0.1476\n0.0468\n0.1978\nHomophone Substitution\n0.0740\n0.1252\n0.0545\n0.1897\n0.0735\n0.1455\n0.0572\n0.1821\n0.0701\n0.1544\n0.0445\n0.1965\nGPT-4o-mini\nOriginal\n0.0475\n0.1324\n0.0415\n0.1593\n0.0480\n0.1530\n0.0417\n0.1675\n0.0476\n0.1542\n0.0352\n0.1918\nLab-Value Erasure\n0.0480\n0.1314\n0.0409\n0.1683\n0.0492\n0.1548\n0.0420\n0.1725\n0.0471\n0.1638\n0.0366\n0.1785\nPrior-note Duplication\n0.0475\n0.1310\n0.0411\n0.1577\n0.0464\n0.1542\n0.0416\n0.1634\n0.0485\n0.1571\n0.0368\n0.1883\nOCR Jittering\n0.0487\n0.1261\n0.0413\n0.1649\n0.0486\n0.1585\n0.0430\n0.1685\n0.0484\n0.1643\n0.0372\n0.1977\nHomophone Substitution\n0.0457\n0.1304\n0.0414\n0.1735\n0.0494\n0.1595\n0.0414\n0.1753\n0.0478\n0.1626\n0.0384\n0.1848\nTable 9: Fairness under Corruption Settings across Racial Subgroups (Set 2). RW = relative width of 95% CI.\n"}, {"page": 17, "text": "11\nPerformance and Fairness across Age Groups under Original and Corruption Settings.\nModel\nType\nAge Groups\n18–40\n41–60\n61+\nRecall@10\nPrecision@10\nRecall@10\nPrecision@10\nRecall@10\nPrecision@10\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nGemini-2.0-Flash\nOriginal\n0.5383\n0.0523\n0.2958\n0.0684\n0.4776\n0.0325\n0.3698\n0.0404\n0.4648\n0.0212\n0.4273\n0.0246\nLab-Value Erasure\n0.5398\n0.0541\n0.2941\n0.0694\n0.4770\n0.0323\n0.3695\n0.0393\n0.4636\n0.0211\n0.4260\n0.0243\nPrior-note Duplication\n0.5355\n0.0552\n0.2948\n0.0683\n0.4798\n0.0316\n0.3714\n0.0406\n0.4664\n0.0219\n0.4279\n0.0250\nOCR Jittering\n0.5359\n0.0532\n0.2940\n0.0685\n0.4785\n0.0329\n0.3700\n0.0395\n0.4684\n0.0217\n0.4314\n0.0246\nHomophone Substitution\n0.5333\n0.0540\n0.2919\n0.0677\n0.4791\n0.0334\n0.3710\n0.0401\n0.4681\n0.0215\n0.4315\n0.0246\nGPT-4o-mini\nOriginal\n0.4235\n0.0681\n0.2237\n0.0715\n0.3556\n0.0408\n0.2747\n0.0436\n0.3519\n0.0243\n0.3254\n0.0283\nLab-Value Erasure\n0.4290\n0.0661\n0.2267\n0.0699\n0.3547\n0.0416\n0.2733\n0.0443\n0.3514\n0.0249\n0.3247\n0.0282\nPrior-note Duplication\n0.4249\n0.0651\n0.2255\n0.0679\n0.3524\n0.0406\n0.2725\n0.0447\n0.3495\n0.0246\n0.3231\n0.0287\nOCR Jittering\n0.4238\n0.0644\n0.2240\n0.0694\n0.3565\n0.0402\n0.2745\n0.0439\n0.3503\n0.0241\n0.3248\n0.0275\nHomophone Substitution\n0.4283\n0.0662\n0.2223\n0.0667\n0.3566\n0.0422\n0.2756\n0.0436\n0.3514\n0.0232\n0.3253\n0.0271\nTable 10: Performance under Corruption Settings across Age Subgroups. RW = relative width of 95% CI.\nModel\nType\nAge Groups\n18–40\n41–60\n61+\nTPR\nFPR\nTPR\nFPR\nTPR\nFPR\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nGemini-2.0-Flash\nOriginal\n0.0567\n0.0755\n0.0555\n0.0849\n0.0741\n0.0457\n0.0592\n0.0555\n0.0845\n0.0289\n0.0599\n0.0438\nLab-Value Erasure\n0.0566\n0.0771\n0.0544\n0.0863\n0.0736\n0.0442\n0.0585\n0.0560\n0.0840\n0.0299\n0.0600\n0.0416\nPrior-note Duplication\n0.0561\n0.0763\n0.0543\n0.0832\n0.0735\n0.0460\n0.0571\n0.0549\n0.0843\n0.0293\n0.0589\n0.0430\nOCR Jittering\n0.0560\n0.0756\n0.0556\n0.0843\n0.0741\n0.0454\n0.0601\n0.0568\n0.0855\n0.0293\n0.0611\n0.0431\nHomophone Substitution\n0.0558\n0.0766\n0.0551\n0.0887\n0.0737\n0.0458\n0.0592\n0.0578\n0.0851\n0.0291\n0.0603\n0.0430\nGPT-4o-mini\nOriginal\n0.0365\n0.0765\n0.0403\n0.0806\n0.0456\n0.0480\n0.0429\n0.0562\n0.0535\n0.0307\n0.0423\n0.0385\nLab-Value Erasure\n0.0365\n0.0788\n0.0407\n0.0832\n0.0457\n0.0465\n0.0434\n0.0536\n0.0534\n0.0301\n0.0424\n0.0397\nPrior-note Duplication\n0.0366\n0.0774\n0.0407\n0.0822\n0.0452\n0.0477\n0.0435\n0.0523\n0.0533\n0.0315\n0.0422\n0.0388\nOCR Jittering\n0.0365\n0.0787\n0.0415\n0.0823\n0.0454\n0.0475\n0.0434\n0.0535\n0.0537\n0.0298\n0.0422\n0.0379\nHomophone Substitution\n0.0359\n0.0756\n0.0416\n0.0816\n0.0458\n0.0469\n0.0429\n0.0566\n0.0535\n0.0311\n0.0426\n0.0373\nTable 11: Fairness under corruption settings across age subgroups. RW = relative width of 95% CI.\n12\nPerformance and Fairness across Sex Groups under Original and Corruption Settings.\nModel\nType\nSex Groups\nFemale\nMale\nRecall@10\nPrecision@10\nRecall@10\nPrecision@10\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nGemini-2.0-Flash\nOriginal\n0.4763\n0.0251\n0.3855\n0.0303\n0.4812\n0.0244\n0.3982\n0.0291\nLab-Value Erasure\n0.4758\n0.0253\n0.3842\n0.0319\n0.4805\n0.0248\n0.3975\n0.0294\nPrior-note Duplication\n0.4786\n0.0257\n0.3860\n0.0302\n0.4813\n0.0241\n0.3990\n0.0287\nOCR Jittering\n0.4806\n0.0242\n0.3886\n0.0305\n0.4812\n0.0246\n0.3993\n0.0294\nHomophone Substitution\n0.4786\n0.0247\n0.3877\n0.0308\n0.4824\n0.0242\n0.4004\n0.0289\nGPT-4o-mini\nOriginal\n0.3633\n0.0302\n0.2903\n0.0323\n0.3626\n0.0294\n0.3020\n0.0325\nLab-Value Erasure\n0.3639\n0.0300\n0.2906\n0.0327\n0.3620\n0.0293\n0.3006\n0.0324\nPrior-note Duplication\n0.3617\n0.0299\n0.2901\n0.0320\n0.3598\n0.0284\n0.2987\n0.0321\nOCR Jittering\n0.3628\n0.0293\n0.2902\n0.0315\n0.3618\n0.0295\n0.3013\n0.0326\nHomophone Substitution\n0.3634\n0.0308\n0.2902\n0.0319\n0.3638\n0.0297\n0.3021\n0.0330\nTable 12: Performance under Corruption Settings across Sex Subgroups. RW = relative width of 95% CI.\n"}, {"page": 18, "text": "Model\nType\nSex Groups\nFemale\nMale\nTPR\nFPR\nTPR\nFPR\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nMean\n95CI RW\nGemini-2.0-Flash\nOriginal\n0.0762\n0.0359\n0.0594\n0.0456\n0.0789\n0.0328\n0.0588\n0.0447\nLab-Value Erasure\n0.0758\n0.0366\n0.0590\n0.0461\n0.0785\n0.0328\n0.0584\n0.0446\nPrior-note Duplication\n0.0756\n0.0350\n0.0579\n0.0443\n0.0788\n0.0332\n0.0576\n0.0434\nOCR Jittering\n0.0769\n0.0348\n0.0606\n0.0464\n0.0791\n0.0350\n0.0594\n0.0449\nHomophone Substitution\n0.0763\n0.0358\n0.0597\n0.0457\n0.0790\n0.0330\n0.0587\n0.0441\nGPT-4o-mini\nOriginal\n0.0480\n0.0343\n0.0421\n0.0403\n0.0496\n0.0344\n0.0422\n0.0443\nLab-Value Erasure\n0.0479\n0.0347\n0.0423\n0.0411\n0.0495\n0.0347\n0.0426\n0.0435\nPrior-note Duplication\n0.0480\n0.0359\n0.0422\n0.0417\n0.0492\n0.0354\n0.0426\n0.0414\nOCR Jittering\n0.0479\n0.0349\n0.0422\n0.0410\n0.0497\n0.0352\n0.0427\n0.0433\nHomophone Substitution\n0.0480\n0.0346\n0.0426\n0.0402\n0.0495\n0.0348\n0.0425\n0.0419\nTable 13: Fairness under Corruption Settings across Sex Subgroups. RW = relative width of 95% CI.\n"}]}