{"doc_id": "pdf:c66442c2382347b5", "source": "zh", "lang": "zh", "pdf_path": "data/raw/zh/pdf/基于工程化细菌的活性生物材料研究及其医学应用_陈欢欢.pdf", "meta": {"doc_id": "pdf:c66442c2382347b5", "source": "local_pdf", "title": "第54卷 第 5 期", "title_from": "pdf_meta|first_page|filename", "language": "zh", "sha256": "c66442c2382347b50a1b2ba7ec06bae5481ddf7a13889ae83d08c1e8560a55b0", "file_name": "基于工程化细菌的活性生物材料研究及其医学应用_陈欢欢.pdf", "page_count": 14, "pdf_metadata": {"format": "PDF 1.6", "title": "", "author": "CNKI", "subject": "", "keywords": "", "creator": "ReaderEx_DIS 2.3.0 Build 4002", "producer": "TTKN", "creationDate": "D:20230520214116-08'00'", "modDate": "", "trapped": "", "encryption": null}, "created_at": "2026-02-18T05:22:55.179392+00:00", "status": "ok"}, "pages": [{"page": 1, "text": "第54卷 第 5 期\n2023 年 5 月\n高\n分\n子\n学\n报\nACTA POLYMERICA SINICA\nVol.54, No.5\nMay, 2023\n基于工程化细菌的活性生物材料研究及其医学应用*\n陈欢欢 张先正**\n(武汉大学化学与分子科学学院  生物医用高分子材料教育部重点实验室    武汉  430072)\n摘　要　细菌由于具有高度生物相容性、运动性和可自主感应生理信号，基于细菌的疗法和递送系统已\n经被广泛应用于医学领域，包括生物成像、疾病治疗以及组织修复与再生等. 本文从工程化细菌的构建、\n生物医学应用以及临床转化三方面总结和评述了生物医用工程化细菌领域的研究进展. 重点介绍了通过\n化学工程化策略对细菌进行改造，在维持细菌自主性和动态功能的同时赋予其新的功能，提高疾病诊断\n效率，改善治疗效果. 此外，还探讨了工程化的细菌在医学领域上的最新进展和应用前景，最后对工程\n化细菌未来在医学应用上的挑战进行了简要的展望.\n关键词　活性生物材料，工程化细菌，化学修饰，基因编辑，医学应用\n近年来，面向生物医学领域的重大需求，\n越来越多的研究人员利用天然来源的细胞、细\n菌等活性高分子材料进行生物医学应用，在许\n多疾病的诊断和治疗上显示出巨大潜力. 随着\n化学生物技术的发展，研究人员开始聚焦于开\n发基于细菌及其衍生物的疾病诊疗体系[1,2]. 许\n多细菌在研究中显示出了优越的治疗特性，例\n如沙门氏菌的肿瘤靶向能力和抗肿瘤活性[3,4]、\n乳酸杆菌调节肠道菌群平衡的能力[5,6]以及枯草\n芽孢杆菌的显著抗菌活性[7,8]等. 尽管细菌的这\n些特性在疾病诊断治疗中显示出了广阔的应用\n前景，但细菌的高致病性和免疫原性可能会导\n致其在医学应用中产生副作用[9]. 例如：细菌的\n强免疫原性可能导致其在体内循环中被快速清\n除，并存在诱发免疫系统疾病的风险[10]；细菌\n的杀伤效果对正常细胞和肿瘤细胞均有损伤，\n这有可能导致正常组织产生严重不良反应. 这\n些缺点极大限制了细菌疗法的临床应用. 另外\n一方面，细菌在递送过程中遇到的生物学挑战\n也限制了细菌递送技术的临床转化. 胃内的强\n酸环境不利于细菌的存活[11]，胃肠道的快速运\n输缩短了益生菌在肠道上的保留时间，限制了\n细菌的黏附与生长[12]，部分细菌制剂在递送过\n程中还存在细菌泄露的风险. 因此，找到“扬\n长避短”的方法以发挥细菌的优越特性是细菌\n疗法的关键. 为了提高细菌的诊断治疗效果并\n降低其副作用，研究人员尝试通过人工手段对\n目标细菌进行改造. 近年来，随着跨学科研究\n的发展，研究人员将微生物研究整合到生物学、\n化学、工程学和材料科学等领域，基于细菌的\n活性生物材料研究便应运而生[13~16]. 通过物理、\n化学技术和基因工程编辑对细菌进行改造，尤\n其是对细菌单个细胞的修饰和封装，可以维持\n细菌的生存和繁殖能力、精准定植并获得更高\n的生物安全性，这也为细菌疗法开辟了一个全\n新的领域[17,18].\n本文系统总结了基于物理、化学修饰和基因\n工程编辑的工程化细菌在疾病诊断和治疗方面的\n研究进展，包括生物成像、疾病治疗以及组织修\n复与再生等(图1)，并介绍了工程化细菌的临床\n研究进展. 此外，本文还进一步讨论了工程化细\n菌在医学应用上的优缺点.\n· 综述 ·\n* 王佛松先生纪念专辑；2022-10-08 收稿，2022-11-21 录用，2022-12-13网络出版；国家重点基础研究发展计划(项目\n号 2019YFA0905603)和国家自然科学基金(基金号 22135005，51833007，21721005)资助项目.\n** 通讯联系人，E-mail: xz-zhang@whu.edu.cn\ndoi: 10.11777/j.issn1000-3304.2022.22334\n550\n"}, {"page": 2, "text": "5期\n陈欢欢和张先正：基于工程化细菌的活性生物材料研究及其医学应用\n1　工程化细菌的构建\n细菌工程化一般是根据细菌的表面结构与特\n征，通过物理、化学技术和基因工程编辑对细菌\n的细胞膜进行改性. 该领域的研究大多集中于细\n菌表面的电荷状态、化学基团、抗原和蛋白质，\n通过静电吸附、形成官能团、疏水相互作用、目\n标基因的靶向修饰等手段对细菌进行多样化的改\n造，从而充分发挥细菌的优越特性并赋予其新的\n功能.\n1.1　物理与化学修饰\n细菌细胞壁中的磷壁酸含有大量强酸性的磷\n酸基团，而大多数细菌的细胞膜带负电荷，因此\n通过在材料中加入阳离子聚合物或进行质子化处\n理使其带正电，便可经静电相互作用将聚合物吸\n附在细菌表面，从而为细菌改性提供了一种可行\n方案[19]. Wang等先用带正电荷的阳离子聚合物修\n饰减毒沙门氏菌，修饰后的细菌不仅可抓取并携\n带抗原，还可进一步将瘤内抗原转移至肿瘤边\n缘，从而增强抗肿瘤免疫响应[20]. Zhao等将含银\n量子点通过静电相互作用加载到双歧杆菌上，修\n饰的细菌可穿透肿瘤组织并逆转免疫抑制肿瘤微\n环境，抑制原位乳腺癌肿瘤的生长[21]. Wei 等通\n过静电作用将包封抗肿瘤药物的聚乳酸-乙醇酸\n的纳米颗粒修饰在大肠杆菌表面，达到激活抗肿\n瘤免疫的效果[22]. Cao 等通过静电作用在大肠杆\n菌的表面修饰了一层由二油酰磷酸和胆固醇自组\n装的脂质膜，涂膜的细菌生存率得到明显改善，\n可以免受胃酸环境刺激，为益生菌的口服治疗疾\n病提供了可行途径[23].\n细菌的表面带有特定的化学基团氨基，可分\n别与羧基、醛基生成酰胺键、亚胺键. 因此，选\n择带有羧基、醛基的功能性材料，通过生成化学\n键结合在细菌表面，可实现细菌的表面化学修\n饰[24,25]. Cai等采用超声乳化法合成表面带有羧基\n的光敏剂，通过形成酰胺键结合在鼠伤寒沙门氏\n菌表面，利用细菌的厌氧靶向能力将光敏剂递送\n到肿瘤的缺氧区域. 光热处理后的细菌可以杀伤\n肿瘤细胞，同时清除肿瘤和瘤内细菌[26]. Chen等\n合成了负载光敏剂亚甲基蓝(MB)的结晶沸石咪\n唑酸盐框架(ZIF-90@MB) (图2(a))，通过ZIF 的\n醛基可将光敏剂修饰在表面沉积钯纳米颗粒的希\n瓦氏菌MR-1上(图2(b)). 修饰的希瓦氏菌通过厌\n氧靶向性到达肿瘤部位后，在肿瘤的酸性环境\n下，细菌与带醛基的材料形成的亚胺键会发生水\n解，从细菌表面脱落的光敏剂在光照下释放单线\n态氧破坏线粒体，使其ATP合成受阻，下调了热\n休克蛋白(HSP70和HSP90)的表达，最终影响肿瘤\n细胞的耐高温性. 另一方面，细菌表面沉积的钯吸\n收近红外光产生热量，杀死肿瘤细胞(图2(c))[27]. \n这两项研究都提出了一种细菌介导的厌氧靶向策\n略，用于诊断和根除深部或晚期实体瘤.\n一些细菌通过自发氧化还原反应靶向环境中\n的金属离子，并通过生物酶促反应将其转化为金\n属元素，这种生物矿化反应也常用于细菌的化学\n修饰，且不会影响细菌的生存能力[28,29]. Fan等对\n大肠杆菌MG 1655 进行了双重修饰：先对细菌\n进行转染使其表达质粒治疗性蛋白肿瘤坏死因\n子-α (TNF-α)，接着通过生物矿化反应对细菌表\n面修饰上光热转化材料金纳米颗粒. 编程的大肠\n杆菌经口服后被转运到内部微循环中，靶向肿瘤\n区域并快速定植. 经光热处理后诱导TNF-α的表\n达，最终导致肿瘤细胞死亡[30]. 此外，有研究把\n金属有机骨架(MOF)与细菌相结合以构建自驱\n动生物反应器. Wang 等先用生物相容性的聚烯\n丙胺盐酸盐修饰非致病性希瓦氏菌，使细菌表\n面带正电荷，然后用透明质酸包裹负载抗癌药\n物阿霉素的MOF. 带正电的希瓦氏菌与带负电的\nMOF 通过静电相互作用，构建了一种基于细菌\nFig. 1  Schematic illustration of engineered bacteria system \ndecorated with physicochemical and bioengineered strategies \nfor disease diagnosis and treatment.\n551\n"}, {"page": 3, "text": "高\n分\n子\n学\n报\n2023年\n-MOF 生物杂交的自驱动生物反应器\n(SO@MDH) (图3(a))，经主动靶向后定植在肿瘤\n区域内，同时进一步通过乳酸代谢促进化疗，从\n而抑制肿瘤生长(图3(b)) [31].\n细菌外膜是一层特殊的脂质双分子层，因而\n可以通过疏水相互作用在细菌表面修饰生物活性\n高分子材料. 其中，聚乙二醇共轭磷脂和含胆固\n醇的疏水烷基链是常用的两亲性聚合物. 在与细\n菌接触后，其疏水端的烷基链可以通过疏水相互\n作用自发锚定在细菌的外膜中[32,33]. Jia等通过将\n阴离子光敏剂原卟啉与胆固醇修饰的聚乙二醇聚\n合物连接得到两亲性聚合物Chol-PEG-PpIX. 聚\n合物中的胆固醇部分极大地促进了原卟啉在细菌\n表面的富集，实现光调节以破坏细菌外膜通透\n性，最终导致细菌死亡[34]. 由于细菌表面被带负\n电荷的脂质双层膜包裹，因此可以利用静电和疏\n水双重作用来对细菌进行表面修饰. 代表性的研\n究是Wang等开发了一种具有“多合一”性质的\n“智能”试剂. 该试剂主要以乙二醇壳聚糖为主\n链，同时共轭上荧光标记的聚乙二醇-胆固醇两\n亲性聚合物. 通过胆固醇部分和细菌膜之间的疏\n水相互作用，以及带正电的乙二醇壳聚糖与带负\n电的细菌膜静电相互作用，试剂可以广泛用于染\n色所有哺乳动物、真菌和细菌的细胞[35].\n1.2　生物工程改造\n随着合成生物学与微生物学的学科交叉融合\n与发展，细菌在生物医学上的应用取得了显著成\n效. 不同于物理、化学方法修饰策略，生物工程\n技术修饰的细菌的生物相容性和安全性更高. 在\n本节中，我们将讨论几种应用于细菌或细菌衍生\n物的新兴生物工程策略.\n基因工程技术是对生物体基因组的特定目标\n基因进行修饰，因此，该技术兼具可操作性与可\n设计性. 通过基因工程对细菌进行改造，使其表\n达靶向、黏附、释放特定物质等不同的功能，可\n实现更广泛的生物医学应用[36]. Joshi课题组开发\n了一种活性生物材料疗法，具体来说是对大肠杆\n菌 Nissle菌株进行编程，使其产生纳米纤维. 经\n口服后，被改造的细菌会靶向上皮的黏膜层，并\n与胃肠道黏液结合填充发炎区域，保护其免受肠\n道微生物和环境因素的影响. 这种基于益生菌原\n位产生治疗性蛋白质基质的研究为胃肠道疾病开\n(a)\n(b)\n(c)\nFig. 2  (a) Synthetic procedure of ZIF-90/MB; (b) Synthetic procedure of engineered Shewanella oneidensi; (c) Mechanism of \ntumor targeting and photothermal tumor ablation of PTB@ZIF-90/MB upon laser irradiation (Reprinted with permission from \nRef.[27]; Copyright (2020) Wiley-VCH GmbH).\n552\n"}, {"page": 4, "text": "5期\n陈欢欢和张先正：基于工程化细菌的活性生物材料研究及其医学应用\n发了一个治疗平台[37]. Harimoto等开发了一种可\n遗传编码的微生物封装系统. 该系统首先设计了\n一种新的荚膜多糖系统iCAP，通过调控iCAP系\n统对大肠杆菌Nissle 1917表面进行编程以赋予动\n态化功能，控制细菌在人体血液中存活的时间. \n在小鼠肿瘤模型中经验证发现，这种动态递送\n策略使细菌的最大耐受剂量增加了10 倍，并成\n功杀死了体内癌细胞[38]. Pan 等使用大肠杆菌\nMG1655，通过质粒转染细胞溶解素A (ClyA)，\n接着对工程大肠杆菌表面进行化学修饰上放射增\n敏剂(图4(a))，随着靶向肿瘤后过表达ClyA调节\n肿瘤细胞周期，最终实现联合放射增敏杀伤乳腺\n癌(图4(b))[39].\n考虑到细菌的强免疫原性会导致其被免疫系\n统清除，目前有研究报道利用天然细胞膜对细菌\n进行封装，可以保护细菌逃脱免疫攻击并增强细\n菌的治疗效果[40]. 基于红细胞膜的低免疫原性和\n长循环特性，Cao等采用机械挤出技术制备出红\n细胞膜包裹大肠杆菌Nissle 1917，进而生成隐形\n细菌(CMCB)，CMCB可以维持细菌固有的生物\n活性与增殖能力. 与未包膜的细菌相比，注射\nCMCB的安全性更高、治疗效果更好. 同时，其\n在正常器官的积累量较低，可改善细菌在疾病部\n位的定植能力[41]. 该策略可为其他类型的细胞膜\n包被益生菌的研究提供强有力的支撑. 此外，红\n细胞可通过生物素-亲和素(Biotin-Streptavidin)的\n高亲和能力与细菌结合成复合物. Alapan等利用\n红细胞吸附载有抗癌药物阿霉素分子和超顺磁性\n氧化铁的纳米颗粒，再与大肠杆菌MG1655结合\n制备多功能生物混合微游泳器，这种研究策略可\n实现针对性的药物递送[42]. 作者同时提出，红细\n胞作为生物混合微生物中的自体载体，其在稳定\n性、变形性、生物相容性和生物降解性等方面均\n优于合成载体材料. 无论是膜包衣还是结合方\n法，都为生物混合细菌的递送系统提供了一种有\n前途的组合策略.\n细菌生物膜具有物理黏附和化学屏障的双重\n功能，利用生物膜包裹细菌可以保护细菌免受物\n理刺激. Wang等用生物膜包被枯草芽孢杆菌，显\n著提高了口服利用度，提高细菌对胃肠道的抵抗\n力和黏附性[43]. 细菌外膜囊泡(OMV)是革兰氏阴\n性细菌释放的脂质双层外膜囊泡. 作为纳米级的\n球形载体，OMV 的直径范围为50~250 nm，并\n含有细菌的多种成分，包括脂质、蛋白质、肽聚\n糖和核酸等. OMV 具有免疫刺激能力，易于修\n饰且可负载药物，因而被广泛应用于疫苗和生物\n治疗药物的研究[44~46]. 同时，OMV还继承了母体\n细菌的肿瘤组织的趋向性，可作为靶向肿瘤治疗\n(a)\n(b)\nFig. 3  (a) Synthesis of the self-driven bioreactor SO@MDH biohybrid; (b) The effect of cyclic lactate catabolism-mediated \nmetabolic therapy (Reprinted with permission from Ref.[31]; Copyright (2021) American Chemical Society).\n553\n"}, {"page": 5, "text": "高\n分\n子\n学\n报\n2023年\n的理想载体[47]. 基于此，Pan 等提取可表达靶向\n多肽LyP1 的大肠杆菌外膜囊泡(LOMV)，并用\nLOMV包封阻断免疫检查点程序性死亡-1 (PD-1)\n质粒以得到LOMV@PD-1，通过静脉注射可靶\n向肿瘤组织，提高免疫检查点阻断癌症疗法[48]. \nZou等设计了一种基于细菌外膜囊泡与源于肿瘤\n的细胞膜杂交成的混合囊泡系统(mTOMV) (图5)，\n该囊泡系统有效靶向肿瘤区域并激活同源肿瘤中\n的适应性免疫，通过“双管齐下”的策略抑制肿\n瘤的生长和转移[49]. 基于OMV 与细胞膜相似的\n脂质双分子层结构具有穿透角质层透皮递送药物\n的优势. Peng等收集了源于转基因大肠杆菌的外\n膜囊泡，并用整合素肽αvβ3 靶向配体和吲哚菁\n绿共轭外膜囊泡，从而形成I-P-OMVs. 应用于黑\n色素瘤部位后，I-P-OMVs 能够穿透皮肤并靶向\n黑色素瘤区域，近红外刺激触发诱导热疗效应并\n分泌单线态氧，迅速清除原发性黑色素瘤球体并\n诱导黑色素瘤细胞凋亡[50]. 该囊泡系统的生物相\n容性良好，制备程序简单便捷，具有巨大的临床\n应用潜力.\n细菌之间存在交互协同作用，因此，基于组\n合细菌疗法的级联效应可提高化学生产效率与生\n物利用度，同时提升治疗效果. 近年来，新引入\n的3D打印平台可以将细菌嵌入到具有高度生物\n相容性的3D 打印油墨中，打印出同时包含2 种\n益生菌的“活材料”，用于降解污染物并产生医\n学上相关的细菌纤维素[51,52]. Chen 等构建了同\n时含有保加利亚乳杆菌(LDB)和鼠李糖乳杆菌\n(LGG)的双益生菌梯度递送系统(图6(a)). 进入肠\n道后，先释放的LGG 在减少肝脏胆汁酸合成的\n同时促进胆汁酸排泄，而被海藻酸钙微球固定的\nLDB 通过多种机制主动聚集胆汁酸. 研究发现，\nLGG-LDB组装系统可以通过调节肠-肝轴有效预\n防胆汁淤积性肝损伤(图6(b)) [53]. Zheng等通过微\n流控技术将3 种细菌封装在海藻酸钙凝胶球中，\n在凝胶表面聚合一层聚多巴胺纳米膜，成功构建\n了一个基于3 种不同细菌(埃希氏杆菌属、芽孢\n杆菌属及肠杆菌属)的人工生态系统. 这3株细菌\n可通过级联反应将尿素和肌酐高效转化成氨基\n酸[54]. 以上研究说明，选择合适的聚合物有利于\n放大组合细菌间的级联效应.\n2　工程化细菌的生物医学应用\n2.1　疾病诊断\n细菌可自主感知生理信号，并能响应周围环\n境(包括宿主)的变化. 因此，细菌有望为一些疾\n(a)\n(b)\nFig. 4  (a) Synthesis of the bacteria-mediated nanosystem for radiotherapy-sensitizing effect; (b) Mechanism toward breast \ncarcinoma (Reprinted with permission from Ref.[39]; Copyright (2022) American Chemical Society).\n554\n"}, {"page": 6, "text": "5期\n陈欢欢和张先正：基于工程化细菌的活性生物材料研究及其医学应用\n病的风险预测、诊断和术后康复提供参考依据. \n例如，厌氧细菌可对肿瘤部位的趋向性进行肿瘤\n特异性成像，同时瘤内缺氧与免疫抑制微环境使\n细菌能够在肿瘤内增殖，实现肿瘤内细菌的长时\n程成像. 然而，常用的大肠杆菌成像的缺点在于\n其会产生蓝移发射光谱，波长峰值范围为470~\n490 nm，并非最适合体内成像的波长. 因此，表\n达荧光素酶的重组大肠杆菌可用于体外和体内细\n菌跟踪，为细菌辅助癌症治疗的研究提供光学靶\n向肿瘤的应用平台[55]. 工程化的大肠杆菌可将目\n标基因靶向递送至肿瘤区域，通过基于光开关的\n光声成像方法抑制血液背景噪音，从而实现肿瘤\n内细菌的精准定位与光声成像[56,57]. 由于可以间\n隔距离施加磁力，磁性材料对胃肠道手术特别有\n用. 将其与工程细菌结合形成的磁性活水凝胶可\n附着到腹部皮肤并定位驻留，从而抵抗肠道中的\n蠕动，摄入的水凝胶可维持细菌活性长达7 天，\n用于检测胃肠道出血[58].\nFig. 5  Hybrid vesicles from bacteria outer membrane and tumor cell membrane to enhance innate immune response (Reprinted \nwith permission from Ref.[49]; Copyright (2021) American Chemical Society).\nFig. 6  The synthesis procedure of dual probiotics-incorporated living materials (Reprinted with permission from Ref.[53]; \nCopyright (2022) Wiley-VCH GmbH).\n555\n"}, {"page": 7, "text": "高\n分\n子\n学\n报\n2023年\n在生物传感设备中，以细菌为主导的生物传\n感器被广泛用于分析物的检测与定量. 这是由于\n细菌不仅可以快速感知体内复杂的生理环境，还\n可以自我复制有利于生物传感器的信号放大. \nCourbet 等构建了一种基于工程大肠杆菌的信号\n放大生物传感器，用于检测人类尿液和血清中的\n临床相关生物标志物. 该工程细菌集成了多个转\n录本，可以同时检测和分析多个生物标志物，提\n高了诊断测试的稳定性和准确性[59]. 同时，把细\n菌生物传感器封装在载体中，摄入后便可以实现\n生物体内的实时监测. Mimee等开发了一种配备\n微电子器件和基因工程细菌的微胶囊，工程大肠\n杆菌以微创方式检测血液中的出血标志物(血红\n素)并产生荧光信号，随后激活相邻的电子电路以\n产生无线信号[60]. 由此可见，生物工程细菌和电\n子设备的结合为疾病诊断提供了新型的监测模式.\n2.2　疾病治疗\n细菌可以直接用于治疗疾病，也可以用作药\n物、基因疗法的载体. 基于工程细菌的癌症疗法\n引起了人们越来越浓厚的兴趣[61]. 其中，脑胶质\n瘤由于存在血脑屏障严重限制了治疗药物随着循\n环血液进入肿瘤所在的大脑，而脑膜炎奈瑟菌含\n有Opca 的外膜侵袭蛋白，可以特异性富集在中\n枢神经系统中[62]. 基于该想法，Dong等通过脑膜\n炎奈瑟菌的Opca 蛋白设计了一种仿生纳米治疗\n系统(图7(a))，穿过血脑屏障将化疗药物渗透到\n肿瘤组织中. 这种仿生纳米治疗系统在治疗胶质\n母细胞瘤方面表现出巨大的潜力(图7(b)) [62]. 此\n外，兼性厌氧菌沙门氏菌VNP20009在全身注射\n后可以选择性定植到肿瘤中，但是I 期临床试\n验显示VNP20009 的抗肿瘤作用较弱. 因此，\nChen 等设计了沙门氏菌联合光热疗法来提高抗\n肿瘤的特异性和有效性. 其过程是，通过氧化和\n自聚合在VNP20009上涂覆一层聚多巴胺，然后\n通过尾静脉注射到荷瘤小鼠体内. 聚多巴胺包被\n的VNP20009靶向实体瘤的缺氧区域，在光调节\n下光热剂会导致局部温度升高，最终杀死周围的\n肿瘤细胞. 这种组合疗法在单次治疗下显示了优\n越的抗癌效果，并抑制肿瘤复发及转移[63]. 非\n侵入性大肠杆菌已成为一类相对安全的生物载\n体，常用于将质粒DNA递送到哺乳动物细胞中. \nZhu等结合化学和基因工程方法，将表达毒素质\n粒pET28a-PE66 转染到大肠杆菌BL21 中，接着\n通过静电和疏水相互作用将ROS 敏感的阳离子\n共轭聚电解质包被在细菌表面. 工程细菌联合化\n疗和光动力疗法，可实现更为精准和个体化的抗\n肿瘤效果[64].\n胃肠道定植的微生物构成了一个庞大的生态\n(a)\n(b)\nFig. 7  (a) Preparation of biomimetic nanotherapeutic system; (b) Schematic diagram of the nanotherapeutic system to treat \nglioblastoma (Reprinted with permission from Ref.[62]; Copyright (2022) Wiley-VCH GmbH).\n556\n"}, {"page": 8, "text": "5期\n陈欢欢和张先正：基于工程化细菌的活性生物材料研究及其医学应用\n系统，肠道微生物与宿主的平衡关系一旦打破，\n势必会引发多种疾病[65]. 因此许多研究通过调节\n肠道菌群平衡来治疗胃肠道疾病. Pan 等将单宁\n酸和铁离子组成的超分子涂层在益生菌的表面，\n保护益生菌免受细胞摄取和抗生素的杀伤. 涂层\n的益生菌可以定植在左氧氟沙星治疗的大鼠胃肠\n道内，减轻胃肠道炎症并改善左氧氟沙星等抗生\n素治疗引起的相关性腹泻[66]. 然而，复杂的胃肠\n道环境，如胃中的强酸、胆汁酸和肠道中不同的\n酶，均不利于益生菌的生存. 基于此，Liu 等设\n计了一种双层包衣策略，采用单宁酸和肠溶\nL100对大肠杆菌 Nissle 1917进行封装. 包衣的益\n生菌对恶劣的胃肠道环境表现出强抵抗力，pH\n响应性的外层肠溶L100 在肠道中选择性地释放\n大肠杆菌，从而延长细菌在肠道中的保留时间，\n对结肠炎具有优异的预防和治疗效果[67].\n益生菌通过分泌大量代谢物和抗菌剂来创造\n独特的局部微环境，这些代谢物和抗菌剂亦适合\n细菌的生存[68]. 罗伊氏乳杆菌作为代表性的益生\n菌，常被用作伤口愈合及组织再生的载体[69]. \nVågesjö 等用编码CXCL12 的质粒转染罗伊氏乳\n杆菌，将其作为载体开发了一种可持续释放趋化\n因子CXCL12 的系统，用于慢性伤口的治疗[70]. \nCXCL12可以将糖尿病小鼠伤口的巨噬细胞重编\n程为抗炎表型，然后用于组织修复. 同时，罗伊\n氏乳杆菌产生的乳酸可以降低伤口的局部pH值，\n防止CXCL12的降解并延长其生物利用度. 分别\n在急性伤口、下肢缺血、糖尿病小鼠伤口以及人\n类皮肤活检标本中验证了该工程细菌加速伤口愈\n合的独特功效. Ming等用甲基丙烯酸改性的透明\n质酸水凝胶包裹罗伊氏乳杆菌，该活菌水凝胶显\n示出了优越的抗菌效果和加速伤口愈合的\n能力[71].\n3　临床研究\n近年来，工程化细菌用于不同实验动物模型\n的研究为细菌疗法的临床转化提供了可行性. 目\n前FDA已经批准了几株减毒的活菌或死菌疫苗，\n包括用于预防肺结核和癌症治疗的牛型结核分枝\n杆菌卡介苗、用于霍乱的霍乱弧菌Vaxchora 疫\n苗[72,73]. 如表1 所示，在全球范围内，基于工程\n化细菌治疗肿瘤的研究在各种临床试验中也取得\n了巨大的成功. 同时，天然存在的益生菌和粪便\n微生物群移植用于预防治疗各种胃肠道疾病的临\n床研究也颇见成效[74,75].\n尽管大量研究证明工程化细菌在不同实验动\nTable 1　Clinical investigation of bacteria-based therapies.\nBacteria\nStaphylococcus hominis\nSalmonella typhimurium\nE. coli\nCholera vaccine\nListeria\nLactic acid bacteria\nLactobacillus\nFecal microbiota transplantation\nAdministration\nTransdermal\nOral\nOral\nIntravenous\nIntratumoral\nOral\nOral\nIntramuscular\nOral\nOral\nIntravenous\nOral\nVaginal\nVaginal\nOral, rectal\nOral\nColonoscopy\nColonoscopy\nClinical trials. \nGov identifier\nNCT03151148\nNCT01099631\nNCT01033409\nNCT00004988\nNCT00004216\nNCT04589234\nNCT03762291\nNCT03168412\nNCT02144948\nSTN:125597\nNCT03190265\nNCT00613795\nNCT02766023\nNCT00305227\nNCT00729872\nNCT01773967\nNCT02743234\nNCT02424175\nIndication\nAtopic dermatitis\nUnresectable hepatic spread\nPneumonia\nCancer\nUnspecified adult solid tumor\nMetastatic pancreatic cancer\nMultiple myeloma\nHepatitis E\nDiabetes mellitus type II\nCholera\nPancreatic cancer\nPneumonia\nBacterial vaginosis\nUrinary tract infection\nUlcerative colitis\nGastroenteritis\nClostridium difficile infection\nSclerosing cholangitis\nClinical trial \nstage\nPhase 1/2\nPhase 1\nPhase 1\nPhase 1\nPhase 1\nPhase 2\nPhase 1\nCDA approval\nPhase 3\nFDA approval\nPhase 2\nPhase 3\nPhase 2\nPhase 2\nPhase 1/2\nPhase 2/3\nPhase 3\nPhase 1/2\nRef.\n[76]\n[77]\n[78]\n[79]\n[80]\n[81]\n[82]\n[83]\n[84]\n[73]\n[85]\n[86]\n[87]\n[88]\n[89]\n[90]\n[91]\n[92]\n557\n"}, {"page": 9, "text": "高\n分\n子\n学\n报\n2023年\n物模型中的治疗效果显著，但是细菌在人体组织\n中的吸收、分布、代谢和排泄方面也存在差异. \n因此，细菌疗法在动物试验中取得的数据并不能\n完全反映其对人体的影响. 总之，确定系统化的\n临床前研究标准将有助于细菌疗法从实验室阶段\n安全有效地转化到临床阶段.\n4　总结与展望\n随着研究的深入，工程化细菌已经在许多难\n治性疾病上显示了出色的治疗效果，如癌症、胃\n肠道疾病和免疫缺陷病等. 工程化细菌既可以用\n作治疗剂，也可作为治疗性药物的递送载体，因\n而具有广阔的应用前景. 然而，与传统药物不\n同，活细菌可以在体内增殖，且在不同患者体内\n增殖的规模也存在差异，这会导致递送细菌的剂\n量变得不可控制. 此外，细菌因体内脱靶效应所\n引发的毒副作用亦不可忽视. 因此，如何在提高\n细菌疗法的安全性的同时，增强其靶向性与治疗\n效果，是细菌疗法走向临床应用转化的关键.\n在今后的细菌递送治疗研究中，一方面结合\n化学和生物学技术对细菌进行改造，或利用基因\n工程敲除细菌的特定基因，在疾病诊疗有效性与\n安全性之间取得平衡. 另一方面，需要进一步探\n讨细菌如何与人体相互作用，推进工程化细菌对\n各种疾病治疗的临床转化.\n作者简介：张先正，男，1971年生. 1994、1997和2000年相继于武汉大学获学士、硕士和博士\n学位. 2000~2001年新加坡材料研究所博士后. 2001~2004年美国康奈尔大学博士后. 2004年至今\n武汉大学化学与分子科学学院高分子系教授. 长江学者特聘教授、万人计划领军人才；曾获国家\n杰出青年基金资助. 国际生物材料科学与工程学会联合会会士、英国皇家化学会会士. 主要研究\n方向是生物医用高分子及其生物医学应用.\nREFERENCES\n1\nZhou, S. Bacteria synchronized for drug delivery. Nature, 2016, 536(7614), 33-34.\n2\nChen, W. H.; Chen, Q. W.; Chen, Q.; Cui, C.; Duan, S.; Kang, Y.; Liu, Y.; Liu, Y.; Muhammad, W.; Shao, S.; Tang, C.; \nWang, J.; Wang, L.; Xiong, M. H.; Yin, L.; Zhang, K.; Zhang, Z.; Zhen, X.; Feng, J.; Gao, C.; Gu, Z.; He, C.; Ji, J.; Jiang, X.; \nLiu, W.; Liu, Z.; Peng, H.; Shen, Y.; Shi, L.; Sun, X.; Wang, H.; Wang, J.; Xiao, H.; Xu, F. J.; Zhong, Z.; Zhang, X. Z.; \nChen, X. Biomedical polymers: synthesis, properties, and applications. Sci. China Chem., 2022, 65, 1010-1075.\n3\nLow, K. B.; Ittensohn, M.; Luo, X.; Zheng, L. M.; King, I.; Pawelek, J. M.; Bermudes, D. Construction of vnp20009: A \nnovel, genetically stable antibiotic-sensitive strain of tumor-targeting salmonella for parenteral administration in humans. \nMethods Mol. Med., 2004, 90, 47-60.\n4\nZhou, S. B.; Gravekamp, C.; Bermudes, D.; Liu, K. Tumour-targeting bacteria engineered to fight cancer. Nat. Rev. \nCancer, 2018, 18(12), 727-743.\n5\nWells, J. M.; Mercenier, A. Mucosal delivery of therapeutic and prophylactic molecules using lactic acid bacteria. Nat. \nRev. Microbiol., 2008, 6(5), 349-362.\n6\nLin, S. S.; Mukherjee, S.; Li, J. J.; Hou, W. L.; Pan, C.; Liu, J. Y. Mucosal immunity-mediated modulation of the gut \nmicrobiome by oral delivery of probiotics into Peyer’s patches. Sci. Adv., 2021, 7(20), eabf0677.\n7\nPiewngam, P.; Zheng, Y.; Nguyen, T. H.; Dickey, S. W.; Joo, H. S.; Villaruz, A. E.; Glose, K. A.; Fisher, E. L.; Hunt, R. L.; \nLi, B.; Chiou, J.; Pharkjaksu, S.; Khongthong, S.; Cheung, G. Y. C.; Kiratisin, P.; Otto, M. Pathogen elimination by \nprobiotic bacillus via signalling interference. Nature, 2018, 562(7728), 532-537.\n8\nLufton, M.; Bustan, O.; Eylon, B.; Shtifman-Segal, E.; Croitoru-Sadger, T.; Shagan, A.; Shabtay-Orbach, A.; Corem-\nSalkmon, E.; Berman, J.; Nyska, A.; Mizrahi, B. Living bacteria in thermoresponsive gel for treating fungal infections. \nAdv. Funct. Mater., 2018, 28(40), 1801581.\n9\nHosseinidoust, Z.; Mostaghaci, B.; Yasa, O.; Park, B. W.; Singh, A. V.; Sitti, M. Bioengineered and biohybrid bacteria-\nbased systems for drug delivery. Adv. Drug Deliv. Rev., 2016, 106, 27-44.\n558\n"}, {"page": 10, "text": "5期\n陈欢欢和张先正：基于工程化细菌的活性生物材料研究及其医学应用\n10\nKim, S. M.; DeFazio, J. R.; Hyoju, S. K.; Sangani, K.; Keskey, R.; Krezalek, M. A.; Khodarev, N. N.; Sangwan, N.; \nChristley, S.; Harris, K. G.; Malik, A.; Zaborin, A.; Bouziat, R.; Ranoa, D. R.; Wiegerinck, M.; Ernest, J. D.; Shakhsheer, \nB. A.; Fleming, I. D.; Weichselbaum, R. R.; Antonopoulos, D. A.; Gilbert, J. A.; Barreiro, L. B.; Zaborina, O.; Jabri, B.; \nAlverdy, J. C. Fecal microbiota transplant rescues mice from human pathogen mediated sepsis by restoring systemic \nimmunity. Nat. Commun., 2020, 11(1), 2354.\n11\nDing, W. K.; Shah, N. P., Acid, bile, and heat tolerance of free and microencapsulated probiotic bacteria. J. Food Sci., \n2007, 72(9), 446-450.\n12\nAnselmo, A. C.; McHugh, K. J.; Webster, J.; Langer, R.; Jaklenec, A. Layer-by-layer encapsulation of probiotics for \ndelivery to the microbiome. Adv. Mater., 2016, 28(43), 9486-9490.\n13\nBeyer, H. M.; Engesser, R.; Horner, M.; Koschmieder, J.; Beyer, P.; Timmer, J.; Zurbriggen, M. D.; Weber, W. Synthetic \nbiology makes polymer materials count. Adv. Mater., 2018, 30(21), e1800472.\n14\nSong, W.; Anselmo, A. C.; Huang, L. Nanotechnology intervention of the microbiome for cancer therapy. Nat. \nNanotechnol., 2019, 14(12), 1093-1103.\n15\nXie, M.; Fussenegger, M. Designing cell function: Assembly of synthetic gene circuits for cell biology applications. Nat. \nRev. Mol. Cell Biol., 2018, 19(8), 507-525.\n16\n冯茜, 张琨雨, 李睿, 边黎明. 可注射水凝胶及其在再生医学领域的应用. 高分子学报, 2021, 52(1), 1-15.\n17\nAsgari, S.; Pourjavadi, A.; Licht, T. R.; Boisen, A.; Ajalloueian, F. Polymeric carriers for enhanced delivery of \nprobiotics. Adv. Drug Deliv. Rev., 2020, 161-162, 1-21.\n18\nLi, Z. T.; Wang, Y. X.; Liu, J.; Rawding, P.; Bu, J.; Hong, S.; Hu, Q. Y. Chemically and biologically engineered bacteria-\nbased delivery systems for emerging diagnosis and advanced therapy. Adv. Mater., 2021, 33(38), e2102580.\n19\nLi, Z. M.; Ma, J. Y.; Ruan, J.; Zhuang, X. Using positively charged magnetic nanoparticles to capture bacteria at ultralow \nconcentration. Nanoscale Res. Lett., 2019, 14(1), 195.\n20\nWang, W. G.; Xu, H. H.; Ye, Q. S.; Tao, F.; Wheeldon, I.; Yuan, A. H.; Hu, Y. Q.; Wu, J. H. Systemic immune responses \nto irradiated tumours via the transport of antigens to the tumour periphery by injected flagellate bacteria. Nat. Biomed. \nEng., 2022, 6(1), 44-53.\n21\nZhao, J. Y.; Huang, H. B.; Zhao, J. Y.; Xiong, X.; Zheng, S. B.; Wei, X. Q.; Zhou, S. B. A hybrid bacterium with tumor-\nassociated macrophage polarization for enhanced photothermal-immunotherapy. Acta Pharm. Sin. B, 2022, 12(6), \n2683-2694.\n22\nWei, B. C.; Pan, J. M.; Yuan, R. T.; Shao, B. F.; Wang, Y.; Guo, X.; Zhou, S. Polarization of tumor-associated \nmacrophages by nanoparticle-loaded Escherichia coli combined with immunogenic cell death for cancer immunotherapy. \nNano Lett., 2021, 21(10), 4231-4240.\n23\nCao, Z. P.; Wang, X. Y.; Pang, Y.; Cheng, S. S.; Liu, J. Y. Biointerfacial self-assembly generates lipid membrane coated \nbacteria for enhanced oral delivery and treatment. Nat. Commun., 2019, 10(1), 5783.\n24\nTaherkhani, S.; Mohammadi, M.; Daoud, J.; Martel, S.; Tabrizian, M. Covalent binding of nanoliposomes to the surface \nof magnetotactic bacteria for the synthesis of self-propelled therapeutic agents. ACS Nano, 2014, 8(5), 5049-5060.\n25\nFelfoul, O.; Mohammadi, M.; Taherkhani, S.; de Lanauze, D.; Xu, Y. Z.; Loghin, D.; Essa, S.; Jancik, S.; Houle, D.; \nLafleur, M.; Gaboury, L.; Tabrizian, M.; Kaou, N.; Atkin, M.; Vuong, T.; Batist, G.; Beauchemin, N.; Radzioch, D.; \nMartel, S. Magneto-aerotactic bacteria deliver drug-containing nanoliposomes to tumour hypoxic regions. Nat. \nNanotechnol., 2016, 11(11), 941-947.\n26\nChen, F. M.; Zang, Z. S.; Chen, Z.; Cui, L.; Chang, Z. G.; Ma, A. Q.; Yin, T.; Liang, R. J.; Han, Y. T.; Wu, Z. H.; Zheng, M. B.; \nLiu, C. L.; Cai, L. T. Nanophotosensitizer-engineered salmonella bacteria with hypoxia targeting and photothermal-\nassisted mutual bioaccumulation for solid tumor therapy. Biomaterials, 2019, 214, 119226.\n27\nChen, Q. W.; Liu, X. H.; Fan, J. X.; Peng, S. Y.; Wang, J. W.; Wang, X. N.; Zhang, C.; Liu, C. J.; Zhang, X. Z. Self-\nmineralized photothermal bacteria hybridizing with mitochondria ‐ targeted metal-organic frameworks for augmenting \nphotothermal tumor therapy. Adv. Funct. Mater., 2020, 30(14), 1909806.\n28\nPark, J. H.; Yang, S. H.; Lee, J.; Ko, E. H.; Hong, D.; Choi, I. S. Nanocoating of single cells: From maintenance of cell \nviability to manipulation of cellular activities. Adv. Mater., 2014, 26(13), 2001-2010.\n29\nWu, F.; Liu, J. Y. Decorated bacteria and the application in drug delivery. Adv. Drug Deliv. Rev., 2022, 188, 114443.\n30\nFan, J. X.; Li, Z. H.; Liu, X. H.; Zheng, D. W.; Chen, Y.; Zhang, X. Z. Bacteria-mediated tumor therapy utilizing \nphotothermally-controlled TNF-α expression via oral administration. Nano Lett., 2018, 18(4), 2373-2380.\n559\n"}, {"page": 11, "text": "高\n分\n子\n学\n报\n2023年\n31\nWang, J. W.; Chen, Q. W.; Luo, G. F.; Han, Z. Y.; Song, W. F.; Yang, J.; Chen, W. H.; Zhang, X. Z. A self-driven \nbioreactor based on bacterium-metal-organic framework biohybrids for boosting chemotherapy via cyclic lactate \ncatabolism. ACS Nano, 2021, 15(11), 17870-17884.\n32\nTeramura, Y.; Kaneda, Y.; Totani, T.; Iwata, H. Behavior of synthetic polymers immobilized on a cell membrane. \nBiomaterials, 2008, 29(10), 1345-1355.\n33\nTakeo, M.; Li, C. C.; Matsuda, M.; Nagai, H.; Hatanaka, W.; Yamamoto, T.; Kishimura, A.; Mori, T.; Katayama, Y. \nOptimum design of amphiphilic polymers bearing hydrophobic groups for both cell surface ligand presentation and \nintercellular cross-linking. J. Biomater. Sci. Polym. Ed., 2015, 26(6), 353-368.\n34\nJia, H. R.; Zhu, Y. X.; Chen, Z.; Wu, F. G. Cholesterol-assisted bacterial cell surface engineering for photodynamic \ninactivation of gram-positive and gram-negative bacteria. ACS Appl. Mater. Interfaces, 2017, 9(19), 15943-15951.\n35\nWang, H. Y.; Hua, X. W.; Jia, H. R.; Li, C.; Lin, F.; Chen, Z.; Wu, F. G. Universal cell surface imaging for mammalian, \nfungal, and bacterial cells. ACS Biomater. Sci. Eng., 2016, 2(6), 987-997.\n36\nSetten, R. L.; Rossi, J. J.; Han, S. P. The current state and future directions of RNAi-based therapeutics. Nat. Rev. Drug. \nDiscov., 2019, 18(6), 421-446.\n37\nPraveschotinunt, P.; Duraj-Thatte, A. M.; Gelfat, I.; Bahl, F.; Chou, D. B.; Joshi, N. S. Engineered E. coli Nissle 1917 for \nthe delivery of matrix-tethered therapeutic domains to the gut. Nat. Commun., 2019, 10(1), 5580.\n38\nHarimoto, T.; Hahn, J.; Chen, Y. Y.; Im, J.; Zhang, J.; Hou, N.; Li, F.; Coker, C.; Gray, K.; Harr, N.; Chowdhury, S.; \nPu, K.; Nimura, C.; Arpaia, N.; Leong, K. W.; Danino, T. A programmable encapsulation system improves delivery of \ntherapeutic bacteria in mice. Nat. Biotechnol., 2022, 40(8), 1259-1269.\n39\nPan, P.; Dong, X.; Chen, Y.; Zeng, X.; Zhang, X. Z. Engineered bacteria for enhanced radiotherapy against breast \ncarcinoma. ACS Nano, 2022, 16(1), 801-812.\n40\nZhang, Y.; Liu, M. D.; Li, C. X.; Li, B.; Zhang, X. Z. Tumor cell membrane-coated liquid metal nanovaccine for tumor \nprevention. Chin. J. Chem., 2020, 38, 595-600.\n41\nCao, Z. P.; Cheng, S. S.; Wang, X. Y.; Pang, Y.; Liu, J. Y. Camouflaging bacteria by wrapping with cell membranes. Nat. \nCommun., 2019, 10(1), 3452.\n42\nAlapan, Y.; Yasa, O.; Schauer, O.; Giltinan, J.; Tabak, A. F.; Sourjik, V.; Sitti, M. Soft erythrocyte-based bacterial \nmicroswimmers for cargo delivery. Sci. Robot., 2018, 3(17), eaar4423.\n43\nWang, X. Y.; Cao, Z. P.; Zhang, M. M.; Meng, L.; Ming, Z. Z.; Liu, J. Y. Bioinspired oral delivery of gut microbiota by \nself-coating with biofilms. Sci. Adv., 2020, 6(26), eabb1952.\n44\nSchwechheimer, C.; Kuehn, M. J. Outer-membrane vesicles from gram-negative bacteria: Biogenesis and functions. Nat. \nRev. Microbiol., 2015, 13(10), 605-619.\n45\nKulp, A.; Kuehn, M. J. Biological functions and biogenesis of secreted bacterial outer membrane vesicles. Annu. Rev. \nMicrobiol., 2010, 64, 163-184.\n46\nToyofuku, M.; Nomura, N.; Eberl, L. Types and origins of bacterial membrane vesicles. Nat. Rev. Microbiol., 2019, \n17(1), 13-24.\n47\nKim, O. Y.; Park, H. T.; Dinh, N. T. H.; Choi, S. J.; Lee, J.; Kim, J. H.; Lee, S. W.; Gho, Y. S. Bacterial outer membrane \nvesicles suppress tumor by interferon-γ-mediated antitumor response. Nat. Commun., 2017, 8(1), 626.\n48\nPan, J. M.; Li, X. L.; Shao, B. F.; Xu, F. N.; Huang, X. H.; Guo, X.; Zhou, S. B.; Self-blockade of PD-L1 with bacteria-\nderived outer-membrane vesicle for enhanced cancer immunotherapy. Adv. Mater., 2022, 34, 2106307.\n49\nZou, M. Z.; Li, Z. H.; Bai, X. F.; Liu, C. J.; Zhang, X. Z. Hybrid vesicles based on autologous tumor cell membrane and \nbacterial outer membrane to enhance innate immune response and personalized tumor immunotherapy. Nano Lett., 2021, \n21(20), 8609-8618.\n50\nPeng, L. H.; Wang, M. Z.; Chu, Y.; Zhang, L.; Niu, J.; Shao, H. T.; Yuan, T. J.; Jiang, Z. H.; Gao, J. Q.; Ning, X. H. \nEngineering bacterial outer membrane vesicles as transdermal nanoplatforms for photo-TRAIL-programmed therapy \nagainst melanoma. Sci. Adv., 2020, 6(27), eaba2735.\n51\nSchaffner, M.; Rühs, P. A.; Coulter, F.; Kilcher, S.; Studart, A. R. 3D printing of bacteria into functional complex \nmaterials. Sci. Adv., 2017, 3(12), eaao6804.\n52\n贺超良, 汤朝晖, 田华雨, 陈学思. 3D 打印技术制备生物医用高分子材料的研究进展. 高分子学报, 2013, (6), \n722-732.\n53\nChen, Q. W.; Li, Q. R.; Cao, M. W.; Yan, J. H.; Zhang, X. Z. Hierarchy-assembled dual probiotics system ameliorates \ncholestatic drug-induced liver injury via gut-liver axis modulation. Adv. Sci., 2022, 9(17), e2200986.\n560\n"}, {"page": 12, "text": "5期\n陈欢欢和张先正：基于工程化细菌的活性生物材料研究及其医学应用\n54\nZheng, D. W.; Pan, P.; Chen, K. W.; Fan, J. X.; Li, C. X.; Cheng, H.; Zhang, X. Z. An orally delivered microbial cocktail \nfor the removal of nitrogenous metabolic waste in animal models of kidney failure. Nat. Biomed. Eng., 2020, 4(9), \n853-862.\n55\nJiang, T. Y.; Yang, X. Y.; Li, G.; Zhao, X. H.; Sun, T.; Muller, R.; Wang, H. L.; Li, M. Y.; Zhang, Y. M. Bacteria-based \nlive vehicle for in vivo bioluminescence imaging. Anal. Chem., 2021, 93(47), 15687-15695.\n56\nGao, R. K.; Liu, F.; Liu, W. F.; Zeng, S. L.; Chen, J. Q.; Gao, R. R.; Wang, L.; Fang, C. H.; Song, L.; Sedgwick, A. C.; \nSessler, J. L.; Chu, J.; Yan, F.; Liu, C. B. Background-suppressed tumor-targeted photoacoustic imaging using bacterial \ncarriers. Proc. Natl. Acad. Sci. USA, 2022, 119(8), e2121982119.\n57\n李丹, 孙盼盼, 李建高, 燕赛赛, 王东, 唐本忠. 聚集诱导发光高分子在光学诊疗应用中的研究进展. 高分子学报, \n2022, 53, 856-873.\n58\nLiu, X. Y.; Yang, Y. Y.; Inda, M. E.; Lin, S. T.; Wu, J. J.; Kim, Y. H.; Chen, X. Y.; Ma, D. C.; Lu, T. K.; Zhao, X. H. \nMagnetic living hydrogels for intestinal localization, retention, and diagnosis. Adv. Funct. Mater., 2021, 31(27), 2010918.\n59\nCourbet, A.; Endy, D.; Renard, E.; Molina, F.; Bonnet, J. Detection of pathological biomarkers in human clinicalsamples \nvia amplifying genetic switches and logic gates. Sci. Transl. Med., 2015, 7(289), 289ra283.\n60\nMimee, M.; Nadeau, P.; Hayward, A.; Carim, S.; Flanagan, S.; Jerger, L.; Collins, J.; McDonnell, S.; Swartwout, R.; \nCitorik, R. J.; Bulovic, V.; Langer, R.; Traverso, G.; Chandrakasan, A. P.; Lu, T. K. An ingestible bacterial-electronic \nsystem to monitor gastrointestinal health. Science, 2018, 360(6391), 915-918.\n61\nHong, S.; Huang, Q. X.; Zhong, Z. L.; Rong, L.; Zhang, X. Z. Photo-initiated coagulation activation and fibrinolysis \ninhibition for synergetic tumor vascular infarction. CCS Chemistry, 2021, 3, 1893-1910.\n62\nDong, C. Y.; Huang, Q. X.; Cheng, H.; Zheng, D. W.; Hong, S.; Yan, Y.; Niu, M. T.; Xu, J. G.; Zhang, X. Z. Neisseria \nmeningitidis opca protein/MnO2 hybrid nanoparticles for overcoming the blood-brain barrier to treat glioblastoma. Adv. \nMater., 2022, 34(12), e2109213.\n63\nChen, W. F.; Wang, Y.; Qin, M.; Zhang, X. D.; Zhang, Z. R.; Sun, X.; Gu, Z. Bacteria-driven hypoxia targeting for \ncombined biotherapy and photothermal therapy. ACS Nano, 2018, 12(6), 5995-6005.\n64\nZhu, C. L.; Yang, Q.; Lv, F. T.; Liu, L. B.; Wang, S. Conjugated polymer-coated bacteria for multimodal intracellular and \nextracellular anticancer activity. Adv. Mater., 2013, 25(8), 1203-1208.\n65\n韩子意, 白雪峰, 王钰璋, 陈其文, 张先正. 用于增强结肠癌化疗的肠道菌群葡萄糖醛酸酶响应甘草酸胶束. 高分子\n学报, 2022, 53, 626-635.\n66\nPan, J. Z.; Gong, G. D.; Wang, Q.; Shang, J. J.; He, Y. X.; Catania, C.; Birnbaum, D.; Li, Y. F.; Jia, Z. J.; Zhang, Y. Y.; \nJoshi, N. S.; Guo, J. L. A single-cell nanocoating of probiotics for enhanced amelioration of antibiotic-associated \ndiarrhea. Nat. Commun., 2022, 13(1), 2117.\n67\nLiu, J.; Li, W.; Wang, Y. X.; Ding, Y. Y.; Lee, A.; Hu, Q. Y. Biomaterials coating for on-demand bacteria delivery: \nSelective release, adhesion, and detachment. Nano Today, 2021, 41, 101291.\n68\nChen, Y. G.; Li, C. X.; Zhang, Y.; Qi, Y. D.; Feng, J.; Zhang, X. Z. Antibacterial sutures coated with smooth chitosan \nlayer by gradient deposition. Chinese J. Polym. Sci., 2022, 40, 1050-1061.\n69\nHan, N.; Jia, L.; Su, Y.; Du, J.; Guo, L.; Luo, Z.; Liu, Y. Lactobacillus reuteri extracts promoted wound healing via PI3K/\nAKT/β-catenin/TGFβ1 pathway. Stem. Cell Res. Ther., 2019, 10(1), 243.\n70\nVagesjo, E.; Ohnstedt, E.; Mortier, A.; Lofton, H.; Huss, F.; Proost, P.; Roos, S.; Phillipson, M. Accelerated wound \nhealing in mice by on-site production and delivery of CXCL12 by transformed lactic acid bacteria. Proc. Natl. Acad. Sci. \nUSA, 2018, 115(8), 1895-1900.\n71\nMing, Z. Z.; Han, L.; Bao, M. Y.; Zhu, H. H.; Qiang, S. J.; Xue, S. B.; Liu, W. W. Living bacterial hydrogels for \naccelerated infected wound healing. Adv. Sci., 2021, 8(24), e2102545.\n72\nBegnini, K. R.; Buss, J. H.; Collares, T.; Seixas, F. K. Recombinant Mycobacterium bovis BCG for immunotherapy in \nnonmuscle invasive bladder cancer. Appl. Microbiol. Biotechnol., 2015, 99(9), 3741-3754.\n73\nChen, W. H.; Cohen, M. B.; Kirkpatrick, B. D.; Brady, R. C.; Galloway, D.; Gurwith, M.; Hall, R. H.; Kessler, R. A.; \nLock, M.; Haney, D.; Lyon, C. E.; Pasetti, M. F.; Simon, J. K.; Szabo, F.; Tennant, S.; Levine, M. M. Single-dose live \noral cholera vaccine CVD 103-HgR protects against human experimental infection with vibrio cholerae O1 El Tor. Clin. \nInfect. Dis., 2016, 62(11), 1329-1335.\n561\n"}, {"page": 13, "text": "高\n分\n子\n学\n报\n2023年\n74\nCostello, S. P.; Hughes, P. A.; Waters, O.; Bryant, R. V.; Vincent, A. D.; Blatchford, P.; Katsikeros, R.; Makanyanga, J.; \nCampaniello, M. A.; Mavrangelos, C.; Rosewarne, C. P.; Bickley, C.; Peters, C.; Schoeman, M. N.; Conlon, M. A.; \nRoberts-Thomson, I. C.; Andrews, J. M. Effect of fecal microbiota transplantation on 8-week remission in patients with \nulcerative colitis: a randomized clinical trial. JAMA, 2019, 321(2), 156-164.\n75\nGroot, P. D.; Nikolic, T.; Pellegrini, S.; Sordi, V.; Imangaliyev, S.; Rampanelli, E.; Hanssen, N.; Attaye, I.; Bakker, G.; \nDuinkerken, G.; Joosten, A.; Prodan, A.; Levin, E.; Levels, H.; Potter, V. L. B.; Bon, A. V.; Brouwer, C.; Dam, S. V.; \nSimsek, S.; Raalte, D. V.; Stam, F.; Gerdes, V.; Hoogma, R.; Diekman, M.; Gerding, M.; Rustemeijer, C.; Bakker, B. D.; \nHoekstra, J.; Zwinderman, A.; Bergman, J.; Holleman, F.; Piemonti, L.; Vos, W. D.; Roep, B.; Nieuwdorp, M. Faecal \nmicrobiota transplantation halts progression of human new-onset type 1 diabetes in a randomised controlled trial. Gut, \n2021, 70(1), 92-105.\n76\nNakatsuji, T.; Hata, T. R.; Tong, Y.; Cheng, J. Y.; Shafiq, F.; Butcher, A. M.; Salem, S. S.; Brinton, S. L.; Rudman Spergel, \nA. K.; Johnson, K.; Jepson, B.; Calatroni, A.; David, G.; Ramirez-Gama, M.; Taylor, P.; Leung, D. Y. M.; Gallo, R. L. \nDevelopment of a human skin commensal microbe for bacteriotherapy of atopic dermatitis and use in a phase 1 \nrandomized clinical trial. Nat. Med., 2021, 27(4), 700-709.\n77\nPangilinan, C. R.; Lee, C. H. Highlights of immunomodulation in salmonella-based cancer therapy. Biomedicines, 2021, \n9(11), 1566.\n78\nMasomian, M.; Ahmad, Z.; Gew, L. T.; Poh, C. L. Development of next generation streptococcus pneumoniae vaccines \nconferring broad protection. Vaccines, 2020, 8(1), 132.\n79\nWei, M. Y.; Shi, S.; Liang, C.; Meng, Q. C.; Hua, J.; Zhang, Y. Y.; Liu, J.; Zhang, B.; Xu, J.; Yu, X. J. The microbiota and \nmicrobiome in pancreatic cancer: more influential than expected. Mol. Cancer, 2019, 18(1), 97.\n80\nDuong, M. T.; Qin, Y.; You, S. H.; Min, J. J. Bacteria-cancer interactions: bacteria-based cancer therapy. Exp. Mol. Med., \n2019, 51(12), 1-15.\n81\nMcNerney, M. P.; Doiron, K. E.; Ng, T. L.; Chang, T. Z.; Silver, P. A. Theranostic cells: emerging clinical applications of \nsynthetic biology. Nat. Rev. Genet., 2021, 22(11), 730-746.\n82\nWang, D.; Wei, X.; Kalvakolanu, D. V.; Guo, B. F.; Zhang, L. Perspectives on oncolytic salmonella in cancer \nimmunotherapy-a promising strategy. Front. Immunol., 2021, 12, 615930.\n83\nChen, Z. P.; Lin, S. Z.; Duan, J. F.; Luo, Y.; Wang, S. Y.; Gan, Z. K.; Yi, H. M.; Wu, T.; Huang, S.; Zhang, Q.; Lv, H. K. \nImmunogenicity and safety of an accelerated hepatitis e vaccination schedule in healthy adults: a randomized, controlled, \nopen-label, phase Ⅳ trial. Clin. Microbiol. Infect., 2019, 25(9), 1133-1139.\n84\nLopez-Moreno, A.; Acuna, I.; Torres-Sanchez, A.; Ruiz-Moreno, A.; Cerk, K.; Rivas, A.; Suarez, A.; Monteoliva-Sanchez, M.; \nAguilera, M. Next generation probiotics for neutralizing obesogenic effects: taxa culturing searching strategies. Nutrients, \n2021, 13(5), 1617.\n85\nAnderson, E. M.; Thomassian, S.; Gong, J.; Hendifar, A.; Osipov, A. Advances in pancreatic ductal adenocarcinoma \ntreatment. Cancers, 2021, 13(21), 5510.\n86\nMorrow, L. E.; Kollef, M. H.; Casale, T. B. Probiotic prophylaxis of ventilator-associated pneumonia: a blinded, \nrandomized, controlled trial. Am. J. Respir. Crit. Care Med., 2010, 182(8), 1058-1064.\n87\nArmstrong, E.; Hemmerling, A.; Miller, S.; Burke, K. E.; Newmann, S. J.; Morris, S. R.; Reno, H.; Huibner, S.; \nKulikova, M.; Liu, R.; Crawford, E. D.; Castaneda, G. R.; Nagelkerke, N.; Coburn, B.; Cohen, C. R.; Kaul, R. \nMetronidazole treatment rapidly reduces genital inflammation through effects on bacterial vaginosis-associated bacteria \nrather than lactobacilli. J. Clin. Invest., 2022, 132(6), e152930.\n88\nStapleton, A. E.; Au-Yeung, M.; Hooton, T. M.; Fredricks, D. N.; Roberts, P. L.; Czaja, C. A.; Yarova-Yarovaya, Y.; \nFiedler, T.; Cox, M.; Stamm, W. E. Randomized, placebo-controlled phase 2 trial of a lactobacillus crispatus probiotic \ngiven intravaginally for prevention of recurrent urinary tract infection. Clin. Infect. Dis., 2011, 52(10), 1212-1217.\n89\nHong, N.; Ku, S.; Yuk, K.; Johnston, T. V.; Ji, G. E.; Park, M. S. Production of biologically active human interleukin-10 \nby bifidobacterium bifidum BGN4. Microb. Cell Fact., 2021, 20(1), 16.\n90\nSchnadower, D.; Tarr, P. I.; Casper, T. C.; Gorelick, M. H.; Dean, J. M.; O'Connell, K. J.; Mahajan, P.; Levine, A. C.; \nBhatt, S. R.; Roskind, C. G.; Powell, E. C.; Rogers, A. J.; Vance, C.; Sapien, R. E.; Olsen, C. S.; Metheney, M.; Dickey, V. P.; \nHall-Moore, C.; Freedman, S. B. Lactobacillus rhamnosus GG versus placebo for acute gastroenteritis in children. N. \nEngl. J. Med., 2018, 379(21), 2002-2014.\n91\nHammeken, L. H.; Baunwall, S. M. D.; Dahlerup, J. F.; Hvas, C. L.; Ehlers, L. H. Health-related quality of life in \npatients with recurrent clostridioides difficile infections. Therap. Adv. Gastroenterol., 2022, 15, 1-8.\n562\n"}, {"page": 14, "text": "5期\n陈欢欢和张先正：基于工程化细菌的活性生物材料研究及其医学应用\n92\nGoldstein, J.; Levy, C. Novel and emerging therapies for cholestatic liver diseases. Liver Int., 2018, 38(9), 1520-1535.\nReview\nEngineered Bacteria-based Living Biomaterials for Biomedical Applications\nHuan-huan Chen, Xian-zheng Zhang*\n(Key Laboratory of Biomedical Polymers of Ministry of Education, Department of Chemistry, Wuhan University, \nWuhan 430072)\nAbstract  Living bacteria have the characteristics of biocompatibility, motility and can autonomously sense \nphysiological signals, which can be used as therapeutic agents or drug carriers for the treatment of a variety of \nintractable diseases, including bioimaging, disease treatment, and tissue repair and regeneration. However, \nbacteria still have shortcomings for medical applications. For examples, some bacteria are often fragile to \nunfriendly environmental stimulation, leading to unnecessary bacterial death and reduced treatment effectiveness. \nRecently, various physicochemical and bioengineered modification strategies have been developed for individual \nbacteria to improve the bioavailability and efficacy, as well as achieve targeted delivery of conventional drugs. In \nthis review, we highlight recent advance in engineered bacteria-based living biomaterials for biomedical \napplications in terms of engineered bacteria, biomedical application, and clinical transformation. According to the \ncharge state, chemical groups, proteins and antigens of the bacterial surface, we systematically introduce the \nengineered bacteria modified with physicochemical and bioengineered strategies, especially for single bacteria. In \naddition, we highlight engineered bacteria-based living biomaterials for emerging diagnosis and advanced \ntherapy, including imaging, biosensor, disease treatment, and tissue repair and regeneration, etc. Furtherly, in the \nclinical translation, we summarize the new progress of engineered bacteria in the treatment of tumor and \ngastrointestinal diseases, as well as the great success of engineered bacteria in various clinical trials. Finally, the \nopportunities and challenges in the future medical application of engineered bacteria have been briefly \nprospected. This review offers the progress in the application of engineered bacteria based on living biomaterials \nin biomedical application, which has potential for the development of bacterial therapy in the future.\nKeywords  Living biomaterial, Biomedical application, Engineered bacteria, Chemical modification, Gene editing\n* Corresponding author: Xian-zheng Zhang, E-mail: xz-zhang@whu.edu.cn\n563\n"}]}