{"doc_id": "pdf:d8018dfd56baf118", "source": "zh", "lang": "zh", "pdf_path": "data/raw/zh/pdf/可遗传功能微生物活体智能生物医用材料：设计策略、集成技术及医学应用_曹浈萍.pdf", "meta": {"doc_id": "pdf:d8018dfd56baf118", "source": "local_pdf", "title": "• 专题一：双清论坛“面向未来的智能材料物质科学” •", "title_from": "pdf_meta|first_page|filename", "language": "zh", "sha256": "d8018dfd56baf118015861aace552256098ffe3ae9cfcafedda822c30351ff43", "file_name": "可遗传功能微生物活体智能生物医用材料：设计策略、集成技术及医学应用_曹浈萍.pdf", "page_count": 9, "pdf_metadata": {"format": "PDF 1.6", "title": "", "author": "", "subject": "", "keywords": "", "creator": "CNKI", "producer": "ReaderEx_DIS 2.6.0 Build 4116", "creationDate": "D:20250801194145-08'00'", "modDate": "", "trapped": "", "encryption": null}, "created_at": "2026-02-18T05:22:55.091364+00:00", "status": "ok"}, "pages": [{"page": 1, "text": "第39 卷\n第3 期\n中\n国\n科\n学\n基\n金\n465\n• 专题一：双清论坛“面向未来的智能材料物质科学” •\nDOI: 10.3724/BNSFC-2025.03.01.0001\n可遗传功能微生物活体智能生物医用材料：\n设计策略、集成技术及医学应用*\n曹浈萍1†\n陈\n焕1，2†\n刘尽尧1**\n1. 上海交通大学分子医学研究院，上海200127\n2. 上海交通大学药学院，上海200240\n[摘\n要]\n随着微生物科学、合成生物学和材料化学的快速发展，微生物活体智能医用材料作为一种新\n型可持续智能材料，已成为生物医学领域的研究热点。本文基于第391期双清论坛“面向未来的智能材料\n物质科学”会议内容，对我国在微生物活体智能生物医用材料的设计、集成及应用研究方面的国家重大需\n求进行了总结。本文回顾了基于合成生物学与材料化学的微生物活体智能材料的设计策略，探讨了单细\n胞与多细胞协同设计方法，并总结了当前面临的主要挑战。最后，提出了该领域未来5~10年内亟需解决\n的科学问题和核心技术，并展望了微生物活体智能材料在精准医疗和智能药物递送等领域的发展方向。\n[关键词]\n活体材料；智能生物医用材料；材料化学；疾病诊疗；可遗传功能设计\n活体材料作为一种创新型的可持续发展智能材料，\n主要由具备生命动态特征的微生物（如细菌、真菌、病\n毒）、植物或动物细胞组成，已成为近年来材料科学与生\n物医学领域的研究热点。与传统的无机材料和聚合物\n材料相比，活体材料的独特之处在于其天然的生命活\n性，具备新陈代谢、细胞运动、繁殖及环境响应等生物动\n态特性[1，2]。这些特性赋予活体材料在智能化和功能化\n应用上的无可比拟的优势，尤其在生物医药领域展现出\n巨大的潜力。细菌作为微生物家族中的重要成员，其天\n然的环境适应性和与周围环境的紧密互动能力，使其成\n为活体智能生物医用材料的理想载体[3]。长期的进化\n赋予细菌自我复制、环境响应、靶向性及原位释放生物\n活性物质的能力，为其在智能活体材料中的应用奠定了\n坚实的基础。此外，细菌还具备强大的基因可编辑性以\n及表面可修饰性，可以通过基因改造和化学材料修饰产\n生具有特定功能的生物活性物质，灵活引入新功能，满\n足不同应用需求，进一步实现多功能集成，从而构建出\n具有新型特性的多功能细菌智能活体材料。集成技术\n涵盖跨学科技术融合（如基因回路设计、光控开关、人工\n智能建模等）及合成材料辅助的调控策略（如合成材料\n界面工程、动态组装调控、基质功能提升及聚合网络优\n化），实现单细胞功能强化与多细胞群落协同的精准控\n制，平衡活性、稳定性与安全性。近年来，随着合成生物\n学、基因工程和材料化学等多学科的快速发展，微生物\n活体材料的设计、改造与应用取得了显著进展[4-8]。特\n别是细菌在智能生物医用材料中的应用，已经从基础研\n究进入实际应用的初步阶段。这些材料能够在体内定\n向释放药物、感知疾病并进行精准治疗，推动了个性化\n医疗和智能医学的发展（图1）。然而，尽管细菌活体材\n料的研究取得了一定进展，其在改造和功能集成方面仍\n面临诸多挑战，尤其是在保证细菌活性和功能多样性之\n间的平衡问题上。因此，推动微生物活体智能生物医用\n材料的设计与集成，对于解决当前生物医学领域的关键\n难题，特别是在疾病诊断、治疗及药物递送等方面具有\n收稿日期：2025-03-01；修回日期：2025-04-13\n† 共同第一作者。\n* 本文根据国家自然科学基金委员会第391期“双清论坛”讨论的内容整理。\n** 通信作者，Email：jyliu@sjtu.edu.cn\n本文受到国家自然科学基金项目（22425505，22305152）的资助。\n引用格式: 曹浈萍, 陈焕, 刘尽尧. 可遗传功能微生物活体智能生物医用材料：设计策略、集成技术及医学应用. 中国科学基金, 2025, 39(3): 465–473.\nCao ZP, Chen H, Liu JY. Heritable functional living microbial intelligent biomedical materials: Design strategies, integration technologies, and medical\napplications. Bulletin of National Natural Science Foundation of China, 2025, 39(3): 465–473. (in Chinese)\n"}, {"page": 2, "text": "重要意义。未来发展方向强调非基因工程的可遗传功\n能改造、材料化学赋能的功能稳定性优化及多学科交叉\n的技术突破，旨在推动微生物活体智能材料从实验室研\n究向临床转化，为“健康中国”战略的实施提供创新解决\n方案。\n本文通过回顾近年来基于合成生物学与材料化学\n的微生物活体智能生物医用材料的设计策略，涵盖了从\n单细胞到多细胞互作的集成方法，以及其在生物医学领\n域的应用进展，总结了该领域当前面临的挑战，并凝练\n了未来5~10年内的重大科学问题和核心技术，探讨了微\n生物活体智能生物医用材料的发展方向。通过激发更\n多学者参与这一前沿领域的研究，推动微生物活体智能\n生物医用材料的创新与应用，期望为相关领域的跨学科\n融合与“健康中国”战略的推进提供重要的理论与技术\n支持。\n生物活材料作为基础单元，依托微生物的天然动态\n特性（如环境感知、运动性、增殖、代谢及生化响应），通\n过合成生物学驱动的基因可编辑性与材料化学赋能的\n功能化策略，构建兼具智能响应与可遗传特性的活性单\n元，其核心在于通过基因回路编程或化学修饰实现功能\n模块的稳定遗传，确保治疗效能的代际延续。集成技术\n涵盖合成生物学基因回路的设计和控制及合成材料辅\n助的调控策略等跨学科技术融合，以实现单细胞功能强\n化与多细胞群落协同的精准控制，最终实现活性、生物\n安全性和环境适应性的精准平衡。生物医用应用聚焦\n于疾病精准诊疗与组织修复等。\n1 微生物活体材料的设计策略\n目前，根据成分是否引入人工合成材料，微生物活\n体材料被划分为天然细胞活体材料和细胞人工杂化材\n料两大类。天然细胞活体材料是由可经诱导刺激产生\n各种生物活性分子的单个细菌细胞或者由产生胞外基\n质并自组装的多个细菌细胞形成。借助基因工程和合\n成生物学手段，这些材料可以被灵活编程，以实现药物\n释放、材料修复等功能。而细胞人工杂化材料是通过引\n入合成材料，借助表面修饰策略或聚合交联获得。这类\n材料能够实现多功能集成，从而拓展活体材料在生物医\n学领域的应用范围。\n1.1 天然细胞活体材料\n基因工程技术的突破为微生物活体材料的智能化\n设计提供了核心手段。通过CRISPR-Cas系统、合成基因\n回路等工具，研究人员可精准编辑微生物基因组，使其\n具备环境感知、逻辑运算与靶向执行能力。合成生物学\n设计的基因回路可将微生物转化为“生物计算机”[8]，通\n过感应pH、温度或特定代谢物（如乳酸）触发程序化响\n应，如药物释放或免疫调节[7]。以工程化大肠杆菌为\n例，其可通过缺氧响应启动子特异性激活肿瘤微环境中\n的抗血管生成药物分泌，实现精准治疗[1]。此外，基因\n编辑技术还可通过敲除毒力基因或引入自毁开关（如光\n控裂解系统）增强生物安全性，为临床应用奠定基础[3]。\n图1 可遗传功能微生物活体智能生物医用材料的集成技术及医学应用\nFig.1 Integrated Technology and Medical Applications of Heritable Functional Living Microbial Intelligent Biomedical Materials\n466\n中\n国\n科\n学\n基\n金\n2025 年\n"}, {"page": 3, "text": "这些技术突破标志着微生物活体材料从“被动载体”向\n“主动治疗系统”的范式转变。当前，天然活体材料的基\n因工程改造主要聚焦于两个维度：单细胞功能强化与多\n细胞群落协同。前者通过单一菌株的精准调控实现靶\n向治疗，后者则通过微生物间的分工协作应对复杂病理\n环境，二者共同推动智能医用材料的迭代升级。\n1.1.1 单细胞工程化改造\n作为微生物活体材料设计的基石，单细胞改造策略\n通过基因编辑赋予单一微生物株系多模态功能，其核心\n在于模块化基因回路的设计与优化。以治疗性细菌为\n例，单细胞工程化改造策略主要包括构建靶向药物递送\n系统、强化免疫调控和代谢工程化改造三大类。构建靶\n向药物递送系统主要通过整合感应模块与执行模块，使\n得工程菌可识别疾病标志物并释放治疗分子，最终实现\n治疗药物的靶向递送。例如，Isabella等[9]利用合成生物\n学方法开发了一株表达苯丙氨酸羟化酶基因的大肠杆\n菌Nissle 1917，其可将苯丙氨酸转化为反式肉桂酸，从而\n降低苯丙氨酸水平，达到治疗苯丙酮尿症的目的。在苯\n丙酮尿症小鼠模型中，口服该工程菌后，血液中的苯丙\n氨酸浓度降低了38%。同时，在人体临床试验中，该工\n程菌具有良好的生物安全性和耐受性，最大耐受剂量为\n2 × 1011集落形成单位。更重要的是，监测到患者血浆\n（反式肉桂酸）和尿液（马尿酸）中菌株特异性苯丙氨酸\n代谢物的剂量反应性增加[10]。强化免疫调控工程菌的\n设计主要利用基因回路调控免疫相关细胞因子分泌，可\n增强抗肿瘤或抗炎疗效。Steidler等[11]利用基因工程手\n段将人源细胞因子IL-10基因导入乳酸乳球菌，使其具备\nIL-10分泌能力。葡聚糖硫酸钠诱导的结肠炎小鼠每天\n口服2×107 LL-mIL10该工程菌疫苗，每只小鼠可产生约\n1 U的mIL-10，使炎症降低了约50%。另外，该工程菌还\n能预防IL-10基因敲除（IL-10 -/-）小鼠的结肠炎发病率。\n近期，研究者将大肠杆菌Nissle 1917 作为抗肿瘤疫苗\n接种平台，该平台针对增强含新表位的肽阵列的产生和\n胞质递送进行了优化，实现了驱动有效和特异性T细胞\n介导的抗癌免疫系统，从而有效控制或消除肿瘤生长，\n并延长晚期小鼠原发性（45天生存率仍为100%）和转移\n性实体瘤（50天生存率约为60%）的生存期[12]。另外，微\n生物的代谢工程化改造主要通过重构微生物代谢通路\n实现，可定向合成治疗分子或调控宿主代谢。研究者通\n过改造丁酸梭菌连续表达和递送GLP-1，通过调节肠道\n菌群平衡[13]和促进GLP-1类似物分泌[14]以改善Ⅱ型糖\n尿病症状，显著降低糖尿病模型小鼠的血糖水平。尽管\n单细胞改造已在靶向治疗与代谢调控领域取得显著进\n展，但其应用仍受限于基因回路的稳定性与跨物种普适\n性。CRISPR系统在革兰氏阳性菌中的编辑效率较低，\n且部分基因元件（如启动子）在不同微生物中兼容性\n差[6]。为此，研究人员正开发通用型基因表达载体与跨\n物种适配元件，以扩展可编程微生物的种类范围。然\n而，单菌株的单一功能难以应对复杂病理环境（如肿瘤\n异质性、多菌种感染），亟需通过多细胞协同设计实现系\n统级功能强化。\n1.1.2 多细胞微生物群改造\n在自然生命系统中，微生物群落通过分工协作维持\n生态稳态，这一特性为多细胞活体材料的设计提供了仿\n生学启示。相较于单细胞改造，合成微生物群落通过共\n培养两种或多种微生物菌株，利用代谢物交换或分子信\n号通讯实现动态互作，从而构建分工明确的治疗系统。\n微生物间的相互作用可归纳为六种生态类型：偏利共\n生、互利共生、偏害共生、捕食、竞争和中性互作[15]。然\n而，多细胞系统的稳定性面临挑战，例如菌株间的资源\n竞争或代谢干扰可能导致功能失调，因此需对种群密度\n和互作关系进行精确控制。\n研究者首先基于天然共生体系设计合成微生物群\n落。例如，Gilbert等[16]受康普茶发酵共生群落的启发，\n将基因工程酿酒酵母与产细菌纤维素的根瘤菌共培养，\n通过酵母分泌的重组蛋白与细菌纤维素结合，赋予材料\n定制化功能。为避免共培养中微生物对营养、空间等资\n源的竞争，研究者借鉴自然共生系统的“交叉喂养”机\n制，通过代谢工程调控碳源与氨基酸的合成与消耗，构\n建稳定的多细胞系统[17-20]。典型案例如三菌种微生物\n群：基因工程大肠杆菌代谢葡萄糖生成乳酸，乳酸支持\n希瓦氏菌生长并转化为乙酸盐，后者进一步为枯草芽孢\n杆菌提供碳源，实现高效的电子传递与能量生产[19]。\n此外，Shou等[20]设计了一对酵母菌株的强制性合作系\n统，菌株A依赖腺嘌呤并过量合成赖氨酸，菌株B依赖赖\n氨酸并过量合成腺嘌呤，二者共培养时形成高效的多化\n学物质合成网络。Balagadde等[21]则构建了类似“捕食\n者—猎物”关系的合成系统，通过群体感应调控猎物菌\n株中毒素蛋白（CcdB）与解毒剂蛋白（CcdA）的表达，实\n现种群动态平衡。Fedorec等[22]开发的竞争性排斥系统\n通过毒素释放与免疫因子表达，实现菌群密度的自主调\n节。为进一步扩展多细胞系统的功能，研究者尝试构建\n跨物种甚至跨界合成生态系统。例如，Weber等[23]整合\n细菌、酵母与哺乳动物细胞，模拟自然界物种共存的互\n作模式。这类系统通过功能冗余与动态互作显著提升\n环境鲁棒性，尤其在复杂病理微环境中展现出适应性优\n势。例如，Chen等[24]利用粘附素介导的细菌自组装技\n术，利用表面表达的锚定蛋白引导大肠杆菌形成空间有\n第39 卷\n第3 期\n曹浈萍等：可遗传功能微生物活体智能生物医用材料：设计策略、集成技术及医学应用\n467\n"}, {"page": 4, "text": "序结构以靶向递送抗生素；Huang等[25]开发了可3D打印\n的枯草芽孢杆菌生物膜，通过群体感应信号（如ComX\n肽）调控生物膜硬度与形状，适配不同组织修复需求。\n然而，目前多细胞系统的时序控制仍依赖复杂的基因回\n路设计，动态调控精度不足。为此，研究者尝试通过光\n控开关，优先激活关键菌株功能并逐步诱导次级响应，\n以提高治疗响应的时空特异性[26]。未来，结合人工智\n能的动态建模与实时监测技术，有望实现多细胞活体材\n料的精准闭环控制，推动其在精准医学与智能诊疗中的\n应用。\n1.2 细胞人工杂化材料\n近年来，材料化学的快速发展推动了细菌表面工程\n化改造技术的革新，基于非基因依赖的化学修饰策略已\n成为微生物活体材料研究的前沿方向。相较于传统的\n基因工程方法，材料化学修饰通过表面官能团的定向功\n能化赋予微生物新特性，展现出跨菌种普适性、可逆调\n控性及高生物安全性的独特优势[3]。这一技术不仅规\n避了基因水平转移的潜在风险，还可通过模块化材料设\n计实现功能的“即插即用”，显著提升了微生物活体材料\n的临床转化潜力[27]。尤其在对基因操作敏感的菌株或\n需快速迭代的治疗场景中，化学修饰展现了强大的灵活\n性与应用前景。\n1.2.1 单细胞人工杂化\n细菌表面由多糖、蛋白质和脂质构成的复杂界面，\n其丰富的官能团（如氨基、羧基、巯基等）为化学修饰提\n供了天然的分子反应平台[28]。不同官能团的化学特性\n决定了其适用于特定的共价偶联修饰策略。例如，氨基\n可通过N-羟基琥珀酰亚胺酯或异氰酸酯活化分子进行\n交联；羧基可通过碳二亚胺化学与氨基化合物偶联；巯\n基则能与马来酰亚胺基团形成稳定的硫醚键[29-33]。此\n外，基于β-葡聚糖中的邻二醇基团，研究人员利用硼酸\n点击化学将人工纳米酶锚定于益生菌表面，从而显著增\n强其活性氧清除能力，拓展了益生菌在抗炎和抗氧化治\n疗中的应用[34]。除了共价修饰，超分子相互作用也是\n人工杂化材料功能化的重要策略。细菌细胞表面富含\n酸性磷酸盐和羧基，并且其生理环境的pH通常高于等电\n点，使得细菌表面整体呈负电性[35，36]。这一特性使得\n通过静电相互作用实现细菌的表面改性成为可能。例\n如，各种阳离子物质（如阳离子聚合物[37-40]、无机纳米颗\n粒[41-43]和脂质体[44]）可通过简单的共孵育方式自组装\n形成保护性涂层，从而提高细菌在胃肠道恶劣环境中的\n存活率[44-47]。此外，两亲性聚合物的疏水性部分能够自\n发嵌入细菌的脂质双层膜，如聚乙二醇（Polyethylene\nglycol，PEG）修饰的磷脂或胆固醇衍生物已被成功用于\n稳定细菌表面功能化分子[48，49]。这些化学修饰策略具\n有反应时间短、操作简便的优势，使其成为细胞人工杂\n化材料研究的重要工具。然而，由于不同细菌种类在表\n面官能团密度和细胞总表面积上存在差异，修饰效率可\n能存在一定的差异。因此，开发更具广谱适应性和精确\n控制能力的表面改性策略仍是未来研究的关键方向。\n细胞表面成分在塑造细菌行为中起着决定性作用，\n化学修饰不仅能够优化细菌的存活率和稳定性，还能赋\n予其自然界无法实现的新功能。近年来，借助表面改性\n技术，研究人员已成功开发多种功能化细菌，并在增强\n环境适应性、肿瘤治疗、免疫调节和抗感染防护等领域\n取得了重要突破[44,50-57]。例如，研究人员基于细菌表面\n固有的负电荷和超分子相互作用，使磷脂双分子层在细\n菌表面自组装形成脂质体涂层[58]，从而显著增强其对\n胃肠道恶劣环境的耐受性，提高单细胞人工杂化材料的\n口服生物利用度，提升其在疾病治疗中的应用价值。为\n了实现更加灵活的功能引入并优化微生物治疗策略，研\n究人员利用多巴胺的生物粘附特性，在细菌表面沉积形\n成聚多巴胺纳米涂层[59-63]。这种涂层不仅能够稳定细\n菌的表面环境，还能通过其丰富的活性官能团（如酚羟\n基和胺基）高效负载多种功能分子，包括成像探针、抗\n原、抗体、小分子药物和高分子聚合物。例如，在微生物\n介导的肿瘤治疗中，研究人员在黑色素细菌表面的多巴\n胺涂层上连接PD-1抗体[64]，从而实现抗肿瘤免疫治疗\n的时空可控药物释放，并进一步重塑肿瘤微环境，有效\n抑制肿瘤的生长。在肠道黏膜屏障相关疾病的治疗中，\n研究人员进一步优化细菌表面修饰策略，在细菌表面的\n聚多巴胺涂层上修饰PEG[65]，以提高细菌在肠道中的运\n动能力和黏液渗透性。这种修饰策略不仅能够有效抑\n制致病菌的侵袭，还能够维持肠道菌群的稳态，同时促\n进黏液分泌并紧密连接蛋白的表达，增强肠道屏障功\n能。这一策略在预防和治疗炎症性肠病、代谢紊乱以及\n自身免疫性疾病方面展现出巨大潜力。总的来说，单细\n胞人工杂化技术凭借其操作简便、功能模块化和广谱适\n应性，为微生物活体材料的生物医学应用提供了全新的\n思路。未来的研究应着重于优化材料表面改性策略，提\n升微生物材料的稳定性和安全性，并探索新型智能化功\n能涂层，以进一步拓展其在精准医疗、免疫治疗和靶向\n递送等领域的应用潜力。\n1.2.2 多细胞人工杂化\n基于多细胞工程化改造的人工杂化系统，研究人员\n通过材料化学、生物工程和微生态调控策略，使微生物\n群落在特定环境中形成稳定、功能化的结构，为疾病治\n疗、环境修复和生物制造等领域提供了新的技术方案。\n468\n中\n国\n科\n学\n基\n金\n2025 年\n"}, {"page": 5, "text": "多细胞人工杂化系统主要采用材料辅助微生物组装的\n策略，通过高分子材料、纳米载体或微胶囊包埋技术，实\n现对不同细胞群体的空间分布控制，例如利用微流控技\n术将不同代谢特性的微生物共封装于钙离子交联的藻\n酸盐微球[66]，以维持其相互依存的代谢级联效应，从而\n优化整体功能。另外，研究人员设计了一种梯度水凝胶\n培养基[67]，通过营养物和代谢产物的梯度分布，使肠道\n微生物群在体外环境下保持自然的代谢多样性，为研究\n肠道微生物—药物相互作用提供了新的研究平台。多\n细胞人工杂化系统已被广泛应用于医学、环境与生物制\n造等领域[68-70]。例如，在炎症性疾病治疗中，研究人员\n利用共生细菌—水凝胶复合材料构建了生物电子皮\n肤[71]，该系统能够通过无线生物传感检测皮肤微生物\n的动态变化，并通过电子刺激调控局部免疫环境，实现\n类器官级别的炎症干预。此外，在肾功能衰竭治疗中，\n研究人员开发了一种口服微生物鸡尾酒，通过将代谢废\n物降解菌株包封于选择性透过的纳米涂层中[66]，使其\n在肠道环境中稳定存活，并通过代谢途径将血液中积累\n的有毒氮代谢产物转化为可吸收的氨基酸，从而减少患\n者对透析治疗的依赖。总之，多细胞人工杂化系统凭借\n其高度模块化、可调控性和生物相容性，为未来的智能\n生物材料设计提供了新的方向。然而，当前技术仍然面\n临菌群稳定性控制、宿主相容性优化和长期功能保持等\n挑战。\n2 面临的挑战与亟待解决的关键科学问题\n得益于微生物的独特优势和不断深入的研究，微生\n物作为可再生生物资源的应用正在不断增加。随着各\n学科的不断发展与交叉融合，微生物智能活体材料的研\n究取得了显著进展，开辟了广阔的应用前景。然而，由\n于微生物自身固有的问题以及改造技术的局限，微生物\n智能活体材料在生物医学领域的长远发展仍面临诸多\n挑战。\n2.1 天然细胞活体材料发展面临的挑战\n针对天然细胞活体材料，当前主要面临的挑战包括\n改造种类有限、普适性差以及潜在的生物安全风险。尽\n管微生物种类繁多，但目前能够在常规条件下大规模培\n养并用于活体智能医用材料构建的微生物种类仍然较\n为有限。此外，由于学科技术的局限，现有的微生物基\n因改造工具的普适性较低，能够基因改造的微生物种类\n仍十分匮乏，这限制了细胞天然活体材料的多样性，并\n妨碍了微生物活体智能医用材料的大规模开发与应用，\n迫使研究人员在每种微生物上进行个性化研究与设计，\n这极大地限制了该领域的快速进展。另一方面，重组基\n因的不稳定性是微生物活体智能医用材料面临的重要\n安全隐患。在微生物的生长和繁殖过程中，重组基因可\n能发生突变，导致基因功能改变，从而影响材料的治疗\n效果。更为严重的是，重组基因有可能通过水平转移传\n播至其他微生物体内，进而引发不可预见的生态风险和\n健康问题，增加生物安全风险。\n2.2 人工杂化材料发展面临的挑战\n对于人工杂化材料，当前的挑战主要包括临时性、\n不可遗传性以及安全性验证困难等问题。微生物具有\n增殖特性，这使得在活体材料应用过程中，随着微生物\n的增殖，表面所修饰的材料组分可能逐渐脱落，导致通\n过这种方法引入的外源功能无法稳定存在和持续发挥\n作用。此外，微生物的增殖还可能改变材料的性能，从\n而影响其治疗效果的稳定性。临时性特性也限制了微\n生物活体智能医用材料在某些需要长期稳定治疗的疾\n病中的应用，尤其是慢性疾病的长期管理。另一方面，\n现有的微生物活体材料功能主要依赖于对细胞的临时\n修饰或调控，而未发生基因水平上的稳定改变，因此它\n们不具备功能的遗传性。当微生物细胞分裂时，这些临\n时修饰或调控的功能无法稳定地传递给子代细胞，导致\n功能在传代过程中逐渐丧失。此外，人工杂化材料的组\n分通常较为复杂，除了微生物本身，还需要引入外源材\n料，如培养基成分、代谢产物以及制备过程中引入的其\n他物质。这些复杂组分在体内应用时可能引发免疫反\n应，从而带来生物安全隐患。然而，传统的安全性评估\n方法往往无法全面、准确地检测这些复杂混合物带来的\n潜在毒性，导致其在体内应用的安全性验证极为困难。\n2.3 亟待解决的关键科学问题\n针对以上面临的挑战，亟需探索和开发更加安全、\n高效且可遗传的微生物改造方法，以提升微生物智能活\n体材料的体内应用安全性，推动其走向临床应用。当前\n的关键科学问题主要包括：（1）如何实现基于物理、化学\n等非基因工程方法的微生物可遗传改造；（2）如何解决\n人工杂化方法在微生物活体材料中实现功能遗传的机\n制问题。通过深入探讨这些机制，将为设计更高效、稳\n定的人工杂化微生物活体材料提供理论依据，并推动该\n领域从经验性设计向理性设计转变。这些科学突破将\n为微生物智能活体材料的安全性、功能性及可持续发展\n提供坚实的基础，并为将其推广应用到实际生物医学领\n域提供有效支持。\n3 未来发展方向\n在未来几年，针对当前新型微生物智能活体材料研\n究所面临的重大问题和关键技术，亟需加强以下几个方\n第39 卷\n第3 期\n曹浈萍等：可遗传功能微生物活体智能生物医用材料：设计策略、集成技术及医学应用\n469\n"}, {"page": 6, "text": "面的探索：一是开发安全、高效且可遗传的微生物改造\n新方法；二是深入解析这些改造方法的机制；三是推动\n相关基础研究突破关键技术，建立应用研究平台。全力\n推进微生物活体智能生物医用材料的设计、集成及应用\n研究，解决生物医学领域中的关键问题。在未来的研究\n中，重点应放在开发更为安全、有效且可遗传的微生物\n活体材料改造策略上，特别是解析这些方法如何实现微\n生物活体材料的功能遗传。研究的关键方向包括：一是\n将人工材料的物理化学属性转化为微生物活体材料的\n内源性功能；二是通过材料化学赋能实现微生物活体材\n料功能的可遗传改造。\n3.1 人工材料的物理化学属性的内源性转化\n实现人工材料的物理化学属性转化为微生物的内\n源性功能，进而实现非生命组分与活体系统的功能融\n合。通过物理和材料化学改造的方法，将人工材料的物\n理化学特性转变为微生物的代谢调控、抗逆性、靶向性\n及免疫激活等能力。为了实现这一目标，关键在于阐明\n材料的物理化学信号（如表面电荷、拓扑结构等）如何调\n控微生物表观遗传学的分子机制。这一过程的深入研\n究有助于将人工材料的功能引入微生物活体材料中，实\n现材料与活体系统的有机结合。\n3.2 材料化学赋能功能可遗传改造\n超越传统材料化学的边界，利用材料化学为微生物\n活体材料提供可遗传改造的功能。这一方向的核心在\n于通过合成具有特定功能的材料来调控微生物的代谢\n通路并实现遗传改造。通过设计合成的智能材料，这些\n材料能够响应环境信号（如温度、pH和特定分子浓度\n等），刺激微生物的代谢过程，并通过这些材料化学方法\n将调节机制整合到微生物的遗传体系中，实现代谢功能\n的可遗传优化。未来的研究需要揭示材料与微生物界\n面互作对微生物基因组稳定性的影响规律，建立“材料\n属性—基因表达—功能输出”之间的定量关系模型，并\n建立功能遗传性的定量评价标准和生物安全控制体系。\n这将为微生物活体材料的功能拓展以及其在精准医疗、\n智能药物递送和环境修复等领域的应用提供强有力的\n技术支持。\n4 总结与展望\n微生物活体智能医用材料作为一种创新型材料，结\n合了微生物的天然生物活性和材料化学的智能功能，推\n动了生物医学领域的技术革新。随着多学科的融合，微\n生物活体材料的设计与应用取得了显著进展，尤其是在\n疾病诊断、靶向治疗、免疫调节和药物递送方面。然而，\n微生物活体材料仍面临安全性、功能稳定性和可遗传性\n等核心挑战。未来研究应聚焦于开发更为安全、高效且\n可遗传的微生物改造方法，尤其是如何通过非基因工程\n方法实现微生物的可遗传改造。解决这一问题的关键\n在于深入探索材料化学赋能与微生物代谢过程的相互\n作用，将非生命物质的功能与活体系统的功能深度融\n合。此外，人工杂化微生物活体材料的功能遗传性问题\n也亟需得到有效解决，未来的研究应探索如何通过智能\n材料调控微生物的代谢，并将这一机制稳定整合到微生\n物的遗传体系中。通过这一系列的创新努力，微生物活\n体智能材料有望在精准医疗、智能药物递送和环境修复\n等领域发挥更加重要的作用。总的来说，微生物活体智\n能医用材料的发展不仅将推动生物医药产业的创新与\n升级，也为全球健康问题的解决提供了新的思路。随着\n技术的不断突破和跨学科合作的深化，微生物活体材料\n将在未来的医疗领域中扮演更加关键的角色，为实现\n“健康中国”战略目标提供有力支持。\n参\n考\n文\n献\n[1]\nHarimoto T，Jung WH，Mooney DJ. Delivering living medicines with\nbiomaterials. Nature Reviews Materials，2025，10: 191—210.\n[2]\nAyushman M，Mikos G，Tong XM，et al. Cell tumbling enhances stem\ncell differentiation in hydrogels via nuclear mechanotransduction.\nNature Materials，2025，24（2）: 312—322.\n[3]\nCao ZP，Liu JY. Coated bacteria: Advanced living materials for\nmicrobial therapy. Accounts of Materials Research，2024，5（7）: 872\n—883.\n[4]\nAn BL，Wang YY，Huang YY，et al. Engineered living materials for\nsustainability. Chemical Reviews，2023，123（5）: 2349—2419.\n[5]\nGantenbein S，Colucci E，Käch J，et al. Three-dimensional printing of\nMycelium hydrogels into living complex materials. Nature Materials，\n2023，22（1）: 128—134.\n[6]\nWang SC，Zhan YW，Jiang X，et al. Engineering microbial consortia as\nliving materials: Advances and prospectives. ACS Synthetic Biology，\n2024，13（9）: 2653—2666.\n[7]\nDong X，Wu W，Pan P，et al. Engineered living materials for advanced\ndiseases therapy. Advanced Materials，2023: e2304963.\n[8]\nTang YJ，Yu C，Rao L. Engineering bacteria and their derivatives for\ncancer immunotherapy. BME Frontiers，2024，5: 0047.\n[9]\nIsabella VM，Ha BN，Castillo MJ，et al. Development of a synthetic live\nbacterial therapeutic for the human metabolic disease phenylketonuria.\nNature Biotechnology，2018，36（9）: 857—864.\n[10]\nPuurunen MK，Vockley J，Searle SL，et al. Safety and pharmacody-\nnamics of an engineered E. coli Nissle for the treatment of\nphenylketonuria: A first-in-human phase 1/2a study. Nature Metabo-\nlism，2021，3（8）: 1125—1132.\n[11]\nSteidler L，Hans W，Schotte L，et al. Treatment of murine colitis by\nLactococcus lactis secreting interleukin-10. Science，2000，289（5483）:\n1352—1355.\n[12]\nRedenti A，Im J，Redenti B，et al. Probiotic neoantigen delivery vectors\n470\n中\n国\n科\n学\n基\n金\n2025 年\n"}, {"page": 7, "text": "for precision cancer immunotherapy. Nature，2024，635（8038）: 453—\n461.\n[13]\nGong X，Geng HW，Yang Y，et al. Metabolic engineering of commen-\nsal bacteria for gut butyrate delivery and dissection of host-microbe\ninteraction. Metabolic Engineering，2023，80: 94—106.\n[14]\nZhou DX，Li SJ，Hu G，et al. Hypoglycemic effect of C. butyricum-\npMTL007-GLP-1 engineered probiotics on type 2 diabetes mellitus.\nGut Microbes，2025，17（1）: 2447814.\n[15]\nSong H，Ding MZ，Jia XQ，et al. Synthetic microbial consortia: From\nsystematic analysis to construction and applications. Chemical Society\nReviews，2014，43（20）: 6954—6981.\n[16]\nGilbert C，Tang TC，Ott W，et al. Living materials with programmable\nfunctionalities grown from engineered microbial co-cultures. Nature\nMaterials，2021，20（5）: 691—700.\n[17]\nMee MT，Collins JJ，Church GM，et al. Syntrophic exchange in\nsynthetic microbial communities. Proceedings of the National Academy\nof Sciences of the United States of America，2014，111（20）: E2149—\nE2156.\n[18]\nLi XL，Zhou Z，Li WN，et al. Design of stable and self-regulated\nmicrobial consortia for chemical synthesis. Nature Communications，\n2022，13（1）: 1554.\n[19]\nLiu Y，Ding MZ，Ling W，et al. A three-species microbial consortium\nfor power generation. Energy & Environmental Science，2017，10（7）:\n1600—1609.\n[20]\nShou WY，Ram S，Vilar JMG. Synthetic cooperation in engineered\nyeast populations. Proceedings of the National Academy of Sciences of\nthe United States of America，2007，104（6）: 1877—1882.\n[21]\nBalagaddé FK，Song H，Ozaki J，et al. A synthetic Escherichia coli\npredator-prey ecosystem. Molecular Systems Biology，2008，4: 187.\n[22]\nFedorec AJH，Karkaria BD，Sulu M，et al. Single strain control of\nmicrobial consortia. Nature Communications，2021，12（1）: 1977.\n[23]\nWeber W，Daoud-El Baba M，Fussenegger M. Synthetic ecosystems\nbased on airborne inter- and intra kingdom communication. Proceed-\nings of the National Academy of Sciences of the United States of\nAmerica，2007，104（25）: 10435—10440.\n[24]\nChen BZ，Kang W，Sun J，et al. Programmable living assembly of\nmaterials by bacterial adhesion. Nature Chemical Biology，2022，18\n（3）: 289—294.\n[25]\nHuang JF，Liu SY，Zhang C，et al. Programmable and printable Bacillus\nsubtilis biofilms as engineered living materials. Nature Chemical\nBiology，2019，15（1）: 34—41.\n[26]\nWang YY，Zhang Q，Ge CH，et al. Programmable bacterial biofilms as\nengineered living materials. Accounts of Materials Research，2024，5\n（7）: 797—808.\n[27]\nLin SS，Wu F，Zhang YF，et al. Surface-modified bacteria: Synthesis，\nfunctionalization and biomedical applications. Chemical Society Re-\nviews，2023，52（19）: 6617—6643.\n[28]\nVollmer W，Blanot D，De Pedro MA. Peptidoglycan structure and\narchitecture. FEMS Microbiology Reviews，2008，32（2）: 149—167.\n[29]\nLiu LL，He HM，Luo ZY，et al. In situ photocatalyzed oxygen\ngeneration with photosynthetic bacteria to enable robust immunogenic\nphotodynamic therapy in triple-negative breast cancer. Advanced\nFunctional Materials，2020，30（10）: 1910176.\n[30]\nBi XB，Yin J，Guanbang AC，et al. Chemical and enzymatic strategies\nfor bacterial and mammalian cell surface engineering. Chemistry，\n2018，24（32）: 8042—8050.\n[31]\nHan L，Terasaki O，Che SN. Carboxylic group functionalized ordered\nmesoporous silicas. Journal of Materials Chemistry，2011，21（30）:\n11033.\n[32]\nXie SZ，Zhao L，Song XJ，et al. Doxorubicin-conjugated Escherichia\ncoli Nissle 1917 swimmers to achieve tumor targeting and responsive\ndrug release. Journal of Controlled Release，2017，268: 390—399.\n[33]\nLukose V，Whitworth G，Guan ZQ，et al. Chemoenzymatic assembly of\nbacterial glycoconjugates for site-specific orthogonal labeling. Journal\nof the American Chemical Society，2015，137（39）: 12446—12449.\n[34]\nCao FF，Jin LL，Gao Y，et al. Artificial-enzymes-armed Bifidobacter-\nium longum probiotics for alleviating intestinal inflammation and\nmicrobiota dysbiosis. Nature Nanotechnology，2023，18（6）: 617—627.\n[35]\nClarke PH，Lilly MD. A general structure for cell walls of gram-\nnegative bacteria. Nature，1962，195: 517—518.\n[36]\nGoldman DW，Pober JS，White J，et al. Selective labelling of the\nhydrophobic segments of intrinsic membrane proteins with a lipophilic\nphotogenerated carbene. Nature，1979，280（5725）: 841—843.\n[37]\nDas SK，Liang JN，Schmidt M，et al. Biomineralization mechanism of\ngold by zygomycete fungi Rhizopus oryzae. ACS Nano，2012，6（7）:\n6165—6173.\n[38]\nYuan HX，Liu Z，Liu LB，et al. Cationic conjugated polymers for\ndiscrimination of microbial pathogens. Advanced Materials，2014，26\n（25）: 4333—4338.\n[39]\nLi LH，Liu LY，Li L，et al. Chitosan coated bacteria responsive metal-\npolyphenol coating as efficient platform for wound healing. Composites\nPart B: Engineering，2022，234: 109665.\n[40]\nKuang X，Liu Y，Luo HL，et al. Triggerable prodrug nanocoating\nenables on-demand activation of microbial and small-molecular\ntherapeutics for combination treatment. Journal of the American\nChemical Society，2023，145（49）: 26932—26946.\n[41]\nTang YF，Liu ZW，Zhao K，et al. Positively charged and flexible\nSiO2@ZrO2 nanofibrous membranes and their application in adsorption\nand separation. RSC Advances，2018，8（23）: 13018—13025.\n[42]\nLi ZM，Ma JY，Ruan J，et al. Using positively charged magnetic\nnanoparticles to capture bacteria at ultralow concentration. Nanoscale\nResearch Letters，2019，14（1）: 195.\n[43]\nQin M，Zhang XM，Ding HY，et al. Engineered probiotic bio-hetero-\njunction with robust antibiofilm modality via “eating” extracellular\npolymeric substances for wound regeneration. Advanced Materials，\n2024，36（35）: e2402530.\n[44]\nCao ZP，Wang XY，Pang Y，et al. Biointerfacial self-assembly\ngenerates lipid membrane coated bacteria for enhanced oral delivery\nand treatment. Nature Communications，2019，10（1）: 5783.\n[45]\nHou WL，Li JJ，Cao ZP，et al. Decorating bacteria with a therapeutic\nnanocoating for synergistically enhanced biotherapy. Small，2021，17\n（37）: e2101810.\n[46]\nHu QL，Wu M，Fang C，et al. Engineering nanoparticle-coated bacteria\nas oral DNA vaccines for cancer immunotherapy. Nano Letters，2015，\n15（4）: 2732—2739.\n[47]\nHan ZY，Fu ZJ，Wang YZ，et al. Probiotics functionalized with a\ngallium-polyphenol network modulate the intratumor microbiota and\npromote anti-tumor immune responses in pancreatic cancer. Nature\n第39 卷\n第3 期\n曹浈萍等：可遗传功能微生物活体智能生物医用材料：设计策略、集成技术及医学应用\n471\n"}, {"page": 8, "text": "Communications，2024，15（1）: 7096.\n[48]\nJia HR，Zhu YX，Chen Z，et al. Cholesterol-assisted bacterial cell\nsurface engineering for photodynamic inactivation of gram-positive and\ngram-negative bacteria. ACS Applied Materials & Interfaces，2017，9\n（19）: 15943—15951.\n[49]\nWang HY，Hua XW，Jia HR，et al. Universal cell surface imaging for\nmammalian，fungal，and bacterial cells. ACS Biomaterials Science &\nEngineering，2016，2（6）: 987—997.\n[50]\nFeng PP，Cao ZP，Wang XY，et al. On-demand bacterial reactivation by\nrestraining within a triggerable nanocoating. Advanced Materials，\n2020，32（34）: e2002406.\n[51]\nWang XY，Cao ZP，Zhang MM，et al. Bioinspired oral delivery of gut\nmicrobiota by self-coating with biofilms. Science Advances，2020，6\n（26）: eabb1952.\n[52]\nGeng ZM，Wang XY，Wu F，et al. Biointerface mineralization generates\nultraresistant gut microbes as oral biotherapeutics. Science Advances，\n2023，9（11）: eade0997.\n[53]\nCao ZP，Liu JY. Surface nanocoating of bacteria as a versatile platform\nto develop living therapeutics. Nature Protocols，2024，19（11）: 3162—\n3190.\n[54]\nDeng B，Lin SS，Wang Y，et al. Hyaluronic acid-nanocoated bacteria\ngenerate an anti-inflammatory tissue-repair effect in impaired gut and\nextraintestinal organs. Advanced Materials，2025，37（3）: e2412783.\n[55]\nFan G，Wasuwanich P，Rodriguez-Otero MR，et al. Protection of\nanaerobic microbes from processing stressors using metal-phenolic\nnetworks. Journal of the American Chemical Society，2022，144（6）:\n2438—2443.\n[56]\nXie AQ，Ji HH，Liu ZY，et al. Modified prebiotic-based “shield” armed\nprobiotics with enhanced resistance of gastrointestinal stresses and\nprolonged intestinal retention for synergistic alleviation of colitis. ACS\nNano，2023，17（15）: 14775—14791.\n[57]\nMa XT，Liang XL，Li Y，et al. Modular-designed engineered bacteria\nfor precision tumor immunotherapy via spatiotemporal manipulation by\nmagnetic field. Nature Communications，2023，14（1）: 1606.\n[58]\nCao ZP，Cheng SS，Wang XY，et al. Camouflaging bacteria by\nwrapping with cell membranes. Nature Communications，2019，10\n（1）: 3452.\n[59]\nWang L，Liu JY. Dopamine polymerization-mediated surface functio-\nnalization toward advanced bacterial therapeutics. Accounts of\nChemical Research，2024，57（6）: 945—956.\n[60]\nLi JJ，Hou WL，Lin SS，et al. Polydopamine nanoparticle-mediated\ndopaminergic immunoregulation in colitis. Advanced Science，2022，9\n（1）: e2104006.\n[61]\nPan C，Li JJ，Hou WL，et al. Polymerization-mediated multifunctiona-\nlization of living cells for enhanced cell-based therapy. Advanced\nMaterials，2021，33（13）: e2007379.\n[62]\nLi JJ，Xia Q，Guo HY，et al. Decorating bacteria with triple immune\nnanoactivators generates tumor-resident living immunotherapeutics.\nAngewandte Chemie （International Ed），2022，61（27）: e202202409.\n[63]\nLiu Y，Zhang MM，Wang XY，et al. Dressing bacteria with a hybrid\nimmunoactive nanosurface to elicit dual anticancer and antiviral\nimmunity. Advanced Materials，2023，35（11）: e2210949.\n[64]\nWang L，Cao ZP，Zhang MM，et al. Spatiotemporally controllable\ndistribution of combination therapeutics in solid tumors by dually\nmodified bacteria. Advanced Materials，2022，34（1）: e2106669.\n[65]\nChen YM，Lin SS，Wang L，et al. Reinforcement of the intestinal\nmucosal barrier via mucus-penetrating PEGylated bacteria. Nature\nBiomedical Engineering，2024，8（7）: 823—841.\n[66]\nZheng DW，Pan P，Chen KW，et al. An orally delivered microbial\ncocktail for the removal of nitrogenous metabolic waste in animal\nmodels of kidney failure. Nature Biomedical Engineering，2020，4（9）:\n853—862.\n[67]\nZheng DW，Qiao JY，Ma JC，et al. A microbial community cultured in\ngradient hydrogel for investigating gut microbiome-drug interaction\nand guiding therapeutic decisions. Advanced Materials，2023，35（22）:\ne2300977.\n[68]\nMcBee RM，Lucht M，Mukhitov N，et al. Engineering living and\nregenerative fungal-bacterial biocomposite structures. Nature Materi-\nals，2022，21（4）: 471—478.\n[69]\nShi JY，Kim S，Li PJ，et al. Active biointegrated living electronics for\nmanaging inflammation. Science，2024，384（6699）: 1023—1030.\n[70]\nAn JX，Han ZY，Qin YT，et al. Bacteria-based backpacks to enhance\nadoptive macrophage transfer against solid tumors. Advanced Materi-\nals，2024，36（6）: e2305384.\n[71]\nLiu XH，Qin YT，Dong LY，et al. Living symbiotic bacteria-involved\nskin dressing to combat indigenous pathogens for microbiome-based\nbiotherapy toward atopic dermatitis. Bioactive Materials，2023，21: 253\n—266.\nHeritable Functional Living Microbial Intelligent Biomedical Materials: Design Strategies,\nIntegration Technologies, and Medical Applications\nZhenping Cao1†\nHuan Chen1, 2†\nJinyao Liu1*\n1. Institute of Molecular Medicine, Renji Hospital, School of Medicine, Shanghai Jiao Tong University, Shanghai 200127, China\n2. School of Pharmaceutical Sciences, Shanghai Jiao Tong University, Shanghai 200240, China\nAbstract\nWith the rapid development of microbiology, synthetic biology, and materials chemistry, intelligent living\nmicrobial biomedical materials, as a novel and sustainable kind of smart materials, have become a research hotspot in the\nbiomedical field. This paper summarizes China’s major national needs in the design, integration, and application of\n† Contributed equally as co-first authors.\n* Corresponding Author, Email: jyliu@sjtu.edu.cn\n472\n中\n国\n科\n学\n基\n金\n2025 年\n"}, {"page": 9, "text": "intelligent living microbial biomedical materials, based on the content of the 391st Shuangqing Forum “Intelligent Materials\nScience for the Future”. This paper reviews their design strategies based on synthetic biology and materials chemistry,\ndiscusses the collaborative design methods of single-cell and multi-cell systems, and summarizes the main challenges\ncurrently faced. Finally, the paper proposes the scientific issues and core technologies that need to be addressed in the next\n5~10 years in this field, and forecasts the development directions of intelligent living microbial materials in areas such as\nprecision medicine and smart drug delivery.\nKeywords\nliving materials; intelligent biomedical materials; materials chemistry; disease diagnosis and treatment;\nheritable functional design\n刘尽尧\n上海交通大学医学院分子医学研究院研究员，博士生导师。主要从事医用材料化学、活体智能材料、活体药\n物与微生态疗法、药物载体与递送等方向的研究。以独立通讯作者在Nature Biomedical Engineering、Nature Protocols、\nNature Communications、Science Advance、Journal of the American Chemical Society、Angewandte Chemie International\nEdition、Advanced Materials等期刊上发表多篇代表性论文。主持国家自然科学基金青年科学基金项目（A类）、国家重点\n研发计划课题、国家海外高层次人才引进青年项目等。\n曹浈萍\n上海交通大学医学院分子医学研究院副研究员，硕士生导师。主要从事微生物活体材料构建及生物医学应\n用研究，承担国家自然科学基金、上海市科委扬帆计划等多项课题，至今以第一或通讯作者（含共同）在Nature\nMicrobiology、Nature Protocols、Nature Communications、Science Advance、Advanced Materials、Advanced Science和\nMaterials Today等期刊发表多篇代表性学术论文。\n陈\n焕\n上海交通大学药学院助理研究员。主要研究方向为生物医用高分子递送系统的设计、构建及药物递送研\n究。承担国家自然科学基金、中国博士后科学基金等多项课题，至今以第一或通讯作者（含共同）在Nature\nCommunications、Journal of the American Chemical Society、Advanced Science等期刊发表多篇代表性学术论文。\n（责任编辑贾祖冰张强）\n第39 卷\n第3 期\n曹浈萍等：可遗传功能微生物活体智能生物医用材料：设计策略、集成技术及医学应用\n473\n"}]}