{"doc_id": "pdf:b767e05231893a8f", "source": "zh", "lang": "zh", "pdf_path": "data/raw/zh/pdf/乳腺癌诊疗指南（2022年版）.pdf", "meta": {"doc_id": "pdf:b767e05231893a8f", "source": "local_pdf", "title": "2022 年第10 期", "title_from": "pdf_meta|first_page|filename", "language": "zh", "sha256": "b767e05231893a8ff30483705d2d326d251d54b72b777a43f77ecc43676b4b36", "file_name": "乳腺癌诊疗指南（2022年版）.pdf", "page_count": 26, "pdf_metadata": {"format": "PDF 1.6", "title": "", "author": "CNKI", "subject": "", "keywords": "", "creator": "ReaderEx_DIS 2.3.0 Build 4002", "producer": "TTKN", "creationDate": "D:20221122140431-08'00'", "modDate": "", "trapped": "", "encryption": null}, "created_at": "2026-02-18T05:22:55.017291+00:00", "status": "ok"}, "pages": [{"page": 1, "text": "1\n第19 卷\n2022 年第10 期\n标准与讨论\n乳腺癌诊疗指南（2022 年版）\nGuidelines for the Diagnosis and Treatment of  Breast Cancer (2022 edition)\n乳腺癌是女性常见的恶性肿瘤之一，发病率位\n居女性恶性肿瘤的首位，严重危害妇女的身心健康。\n目前，通过采用综合治疗手段，乳腺癌已成为疗效\n最佳的实体肿瘤之一。\n为进一步规范我国乳腺癌诊疗行为，提高医疗\n机构乳腺癌诊疗水平，改善乳腺癌患者预后，保障\n医疗质量和医疗安全，特制定本指南。\n一、乳腺癌筛查\n乳腺癌筛查是指通过有效、简便、经济的乳腺\n检查措施，在无症状妇女中识别和发现具有进展潜\n能的癌前病变患者以及早期浸润性癌患者，以期早\n期发现、早期诊断及早期治疗，其最终目的是降低\n人群乳腺癌的死亡率。\n筛查分为群体筛查和机会性筛查。群体筛查是\n指在辖区或机构有组织、有计划地组织适龄妇女进\n行筛查；机会性筛查是指医疗保健机构结合门诊常\n规工作提供乳腺癌筛查服务。\n妇女参加乳腺癌筛查的起始年龄：机会性筛查\n一般建议40 岁开始，但对于乳腺癌高危人群可将\n筛查起始年龄提前到40 岁以前。群体筛查国内暂\n无推荐年龄，国际上推荐40~50 岁开始，目前国\n内开展的群体筛查采用的年龄均属于研究或探索性\n质，缺乏严格随机对照研究的不同年龄成本效益分\n析数据。\n（一）一般风险人群妇女乳腺癌筛查策略\n1. 20~39 岁\n（1）每月1 次乳腺自我检查。\n（2）每1~3 年1 次临床检查。\n2. 40~69 岁\n（1）适合机会性筛查和群体性筛查。\n（2）每1~2 年1 次乳腺X 线检查和/或乳腺超声。\n（3）对条件不具备的地区或致密型乳腺（腺体\n为C 型或D 型），可首选乳腺超声检查。\n（4）每月1 次乳腺自我检查。\n（5）每年1 次临床检查。\n3. 70 岁以上\n（1）机会性筛查（有症状或可疑体征时进行影\n像学检查）。\n（2）每月1 次乳腺自我检查。\n（3）每年1 次临床检查。\n（二）高危人群乳腺癌筛查策略\n建议对乳腺癌高危人群提前进行筛查（小于40\n岁），筛查间期推荐每年1 次，筛查手段整体原则应\n联合乳腺X 线检查和乳腺超声，必要时还可以应用\nMRI 等影像学手段。\n乳腺癌高危人群符合以下3 个条件，即：1. 有\n明显的乳腺癌遗传倾向者（见下段基因检测标准）；\n2. 既往有乳腺导管或小叶不典型增生或小叶原位癌\n（lobular carcinoma in situ，LCIS）的患者；3. 既\n往行胸部放疗。\n遗传性乳腺癌- 卵巢癌综合征基因检测标准如\n下\n［a，b］。\n（1）具有血缘关系的亲属中有BRCA1/BRCA2\n基因突变的携带者。\n（2）符合以下1 个或多个条件的乳腺癌患者\n［c］：\n中华人民共和国国家卫生健康委员会\nNational Health Commission of the People's Republic of China\n"}, {"page": 2, "text": "2\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n①发病年龄≤45 岁；②发病年龄≤50 岁并且有1\n个及以上具有血缘关系的近亲\n［d］也为发病年龄≤50\n岁的乳腺癌患者和/或1 个及以上的近亲为任何年\n龄的卵巢上皮癌/输卵管癌/原发性腹膜癌患者；③\n单个个体患2 个原发性乳腺癌\n［e］，并且首次发病年\n龄≤50 岁；④发病年龄不限，同时2 个及以上具有\n血缘关系的近亲患有任何发病年龄的乳腺癌和/或卵\n巢上皮癌、输卵管癌、原发性腹膜癌；⑤具有血缘\n关系的男性近亲患有乳腺癌；⑥合并有卵巢上皮癌、\n输卵管癌、原发性腹膜癌的既往史。\n（3）卵巢上皮癌、输卵管癌、原发性腹膜癌患者。\n（4）男性乳腺癌患者。\n（5）具有以下家族史：①具有血缘关系的一级\n或二级亲属中符合以上任何条件；②具有血缘关系\n的三级亲属中有2 个及以上乳腺癌患者（至少1 个\n发病年龄≤50 岁）和/或卵巢上皮癌/输卵管癌/原\n发性腹膜癌患者。\n注：a. 符合1 个或多个条件提示可能为遗传性\n乳腺癌- 卵巢癌综合征，有必要进行专业性评估。\n当审查患者的家族史时，父系和母系亲属的患癌情\n况应该分开考虑。早发性乳腺癌和/或任何年龄的卵\n巢上皮癌、输卵管癌、原发性腹膜癌提示可能为遗\n传性乳腺癌- 卵巢癌综合征。在一些遗传性乳腺癌-\n卵巢癌综合征的家系中，还包括前列腺癌、胰腺癌、\n胃癌和黑素瘤。b. 其他考虑因素：家族史有限的个\n体，例如女性一级或二级亲属<2 个，或者女性亲\n属的年龄>45 岁，在这种情况下携带突变的可能性\n往往会被低估。对发病年龄≤40 岁的三阴性乳腺癌\n患者可考虑进行BRCA1/2 基因突变的检测。c. 乳\n腺癌包括浸润性癌和导管内癌。d. 近亲是指一级、\n二级和三级亲属。e. 2 个原发性乳腺癌包括双侧乳\n腺癌或者同侧乳腺的2 个或多个明确的不同来源的\n原发性乳腺癌。\n二、诊断\n应当结合患者的临床表现、体格检查、影像学\n检查、组织病理学等进行乳腺癌的诊断和鉴别诊断。\n（一）临床表现\n早期乳腺癌不具备典型症状和体征，不易引起\n患者重视，常通过体检或乳腺癌筛查发现。以下为\n乳腺癌的典型体征，多在癌症中期和晚期出现。\n1. 乳腺肿块\n80% 的乳腺癌患者以乳腺肿块首诊。患者常无\n意中发现肿块，多为单发，质硬，边缘不规则，表\n面欠光滑。大多数乳腺癌为无痛性肿块，仅少数伴\n有不同程度的隐痛或刺痛。\n2. 乳头溢液\n非妊娠期从乳头流出血液、浆液、乳汁、脓液，\n或停止哺乳半年以上仍有乳汁流出者，称为乳头溢\n液。引起乳头溢液的原因很多，常见的疾病有导管\n内乳头状瘤、乳腺增生、乳腺导管扩张症和乳腺癌。\n单侧单孔的血性溢液应进一步行乳管镜检查，若伴\n有乳腺肿块更应重视。\n3. 皮肤改变\n乳腺癌引起皮肤改变可出现多种体征，最常见\n的是肿瘤侵犯乳房悬韧带（又称库珀韧带）后与皮\n肤粘连，出现酒窝征。若癌细胞阻塞了真皮淋巴管，\n则会出现橘皮样改变。乳腺癌晚期，癌细胞沿淋巴\n管、腺管或纤维组织浸润到皮内并生长，形成皮肤\n卫星结节。\n4. 乳头、乳晕异常\n肿瘤位于或接近乳头深部，可引起乳头回缩。\n肿瘤距乳头较远，乳腺内的大导管受到侵犯而短缩\n时，也可引起乳头回缩或抬高。乳头乳晕湿疹样癌\n即佩吉特病，表现为乳头皮肤瘙痒、糜烂、破溃、\n结痂、脱屑、伴灼痛，甚至乳头回缩。\n5. 腋窝淋巴结肿大\n隐匿性乳腺癌乳腺体检摸不到肿块，常以腋\n窝淋巴结肿大为首发症状。医院收治的乳腺癌患者\n1/3 以上有腋窝淋巴结转移。初期可出现同侧腋窝\n淋巴结肿大，肿大的淋巴结质硬、散在、可推动。\n随着病情发展，淋巴结逐渐融合，并与皮肤和周围\n"}, {"page": 3, "text": "3\n第19 卷\n2022 年第10 期\n标准与讨论\n组织粘连、固定。晚期可在锁骨上和对侧腋窝摸到\n转移的淋巴结。\n（二）乳腺触诊\n进行乳腺触诊前应详细询问乳腺病史、月经婚\n姻史、既往肿瘤家族史（乳腺癌、卵巢癌）。绝经前\n妇女最好在月经结束后进行乳腺触诊。\n受检者通常采用坐位或立位，对下垂型乳房或\n乳房较大者，亦可结合仰卧位。乳腺体检应遵循先\n视诊后触诊，先健侧后患侧的原则，触诊时应采用\n手指指腹侧，按一定顺序，不遗漏乳头、乳晕区及\n腋窝部位，可双手结合。\n大多数乳腺癌触诊时可以触到肿块，此类乳腺\n癌容易诊断。部分早期乳腺癌触诊阴性，查体时应\n重视乳腺局部腺体增厚变硬、乳头糜烂、乳头溢液，\n以及乳头轻度回缩、乳房皮肤轻度凹陷、乳晕轻度\n水肿、绝经后出现乳房疼痛等，应提高警惕。诊断\n时要结合影像学和组织病理学检查结果，必要时可\n活检行细胞学诊断。\n（三）影像学检查\n乳腺的影像学检查主要包括乳腺X 线检查、乳\n腺超声以及乳腺MRI 等。\n1. 乳腺X 线摄影\n乳腺疾病的最基本检查方法，在检出钙化方面，\n具有其他影像学方法无可替代的优势，但对致密型\n乳腺、近胸壁肿块的显示不佳，且有放射性损害，\n对年轻女性患者不作为首选检查方法。\n常规投照体位包括双侧内外侧斜位及头尾位。\n对常规体位显示不佳或未包全乳腺实质者，可根据\n病灶位置选择补充体位，包括外内侧位、内外侧位、\n内侧头足轴位、外侧头足轴位、尾叶位、乳沟位。\n为使病灶显示效果更佳，必要时可开展一些特殊摄\n影技术，如局部加压摄影、放大摄影或局部加压放\n大摄影等。\n（1）适应症：适用于筛查性人群及诊断性患者\n的乳腺检查。①无症状人群的筛查。②适龄女性筛\n查或其他相关检查发现乳腺异常改变。③有乳腺肿\n块、局部增厚、异常乳头溢液、乳腺皮肤异常、局\n部疼痛或肿胀症状。④良性病变的短期随诊。⑤乳\n腺癌保乳术后的随诊。⑥乳房修复重建术后。⑦引\n导定位及活检。\n对40 岁以下、无明确乳腺癌高危因素或临床\n查体未见异常的妇女，不建议首先进行乳腺X 线检\n查。妊娠期女性通常不进行乳腺X 线摄影。\n（2）诊断报告基本指南：见附件1。\n2. 乳腺超声\n超声检查因其简便易行、灵活直观、无创无辐\n射等特点，适用于所有疑诊乳腺病变的人群。可同\n时进行乳腺和腋窝淋巴结的检查。乳腺超声扫描体\n位常规取仰卧位，扫描范围自腋窝顶部至双乳下界，\n包括全乳及腋窝。\n常规超声检查可以早期、敏感地检出乳腺内可\n疑病变，通过对病变形态、内部结构及周围组织改\n变等特征的观察，结合彩色多普勒血流成像观察病\n变内血流情况，确定病变性质。超声造影可以显示\n病灶内微血管分布、走形、血流动力学差异以及病\n灶与周围正常组织的关系，对于良恶性病灶的鉴别\n具有一定的意义。弹性成像可以评价组织硬度，对\n于部分乳腺病变的良恶性判断有一定的辅助价值。\n（1）适应症：①有乳腺相关症状者：触诊发现\n乳腺肿物、乳头溢液、乳头内陷、局部皮肤改变等。\n②无症状的乳腺癌高危人群乳腺检查。③作为乳腺\nX 线筛查的补充检查。④乳腺良性病变的随访；乳\n腺癌术后随访；绝经后激素替代治疗随访等。⑤介\n入性超声：超声引导细针/空芯针穿刺活检及术前定\n位等。\n（2）诊断报告基本指南：见附件1。\n3. 乳腺MRI 检查\n乳腺MRI 检查的优势在于敏感性高，能显示\n多病灶、多中心或双侧乳腺癌病灶，并能同时显示\n肿瘤与胸壁的关系、腋窝淋巴结转移情况等，为制\n订手术方案提供更可靠的依据。缺点在于特异性中\n等、假阳性率高、对微小钙化性病变显示不满意，\n"}, {"page": 4, "text": "4\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n此外检查时间长、费用昂贵。不作为首选检查方法。\n建议使用高场强（1.5T 及以上）MRI 设备及乳腺专\n用相控阵线圈，扫描体位为俯卧位，扫描序列包括\nT1 加权成像序列（包括不抑脂序列，以及与增强序\n列相同的抑脂序列）、T2 加权成像（加抑脂序列）、\n弥散加权成像、增强扫描序列（包括横断位动态增\n强扫描及矢状位扫描）。\n（1）适应症：①乳腺X 线摄影和超声对病变检\n出或确诊困难者。②乳腺癌术前分期及筛查对侧乳\n腺肿瘤。③评价新辅助化疗疗效。④寻找腋窝淋巴\n结转移患者的原发灶。⑤乳腺癌术后鉴别治疗后瘢\n痕与肿瘤复发。⑥评估肿块切除术后切缘阳性患者\n的残留病灶。⑦乳腺假体植入术后评价。⑧高危人\n群的乳腺癌筛查。⑨引导乳腺病灶的定位及活检。\n（2）禁忌症：①体内有起搏器、外科金属夹等\n铁磁性物质及其他不得接近强磁场者。②具有对任\n何钆螯合物过敏史者。③幽闭恐惧症者。④妊娠期\n妇女。⑤一般情况很差，不能耐受磁共振检查者。\n（3）诊断报告基本指南：见附件1。\n4. 正电子发射计算机体层成像\n根据美国国立综合癌症网络（National Com-\nprehensive Cancer Network，NCCN）指南、欧\n洲肿瘤内科学会（European Society for Medical \nOncology，ESMO）指南、日本乳腺癌学会\n（Japanese Breast Cancer Society，JBCS）指南\n及中国抗癌协会指南。\n（1）正电子发射计算机体层成像（positron \nemission tomography-computed tomography，\nPET-CT）检查适应症：①临床局部晚期、分子分型\n预后差、有症状可疑存在远处转移的患者疗前分期\n（尤其是常规影像检查对是否存在远处转移难以判断\n或存在争议时）。②术后患者随访过程中可疑出现\n局部复发或转移，包括查体或常规影像检查出现异\n常、肿瘤标志物升高等（对于鉴别复发和放射性纤\n维化，PET-CT 较其他常规影像检查具有优势）。关\n于PET-CT 在乳腺癌骨转移方面的应用，虽有临床\n研究提示，其具有与骨显像相似的灵敏度，更高的\n特异性，对乳腺癌骨转移治疗后病情的跟踪优于骨\n显像，但目前尚未获得各个指南的常规推荐。\n（2）PET-CT 检查的相对禁忌症：①妊娠和哺\n乳期妇女。②严重心、肝、肾功能衰竭及对含碘对\n比剂过敏者不能行增强PET-CT 检查。③病情危重\n难以配合、不能平卧15 分钟、尿便失禁或有幽闭\n恐惧症的患者。④颅脑转移颅内压增高患者。\n5. 骨显像\n（1）浸润性乳腺癌治疗前分期：①对于临床\nⅠ~ⅡB 期浸润性乳腺癌患者，有局部骨痛或碱性磷\n酸酶升高时，可行骨显像检查评估是否有骨转移。\n②临床Ⅲ期浸润性乳腺癌患者，可行骨显像检查或\n氟化钠PET-CT 检查，评估是否有骨转移（2B 类）。\n③复发或临床Ⅳ期乳腺癌患者，可行骨显像检查或\n氟化钠PET-CT 检查，评估是否有骨转移。\n若患者已行的氟代脱氧葡萄糖PET-CT 检查中\n明确提示有骨骼转移，且PET 及CT 的部分均提示\n有骨骼转移，那么骨显像或氟化钠PET-CT 检查可\n能不再需要。\n（2）随访：若患者出现骨痛或碱性磷酸酶升高\n时，可行骨显像检查评估是否有骨转移；当缺乏临\n床信号和症状提示复发时，不建议影像学的转移\n筛查。\n（四）实验室检查\n1. 生化检查\n早期无特异性血生化改变，晚期累及其他脏器\n时，可出现相应的生化指标的变化。如多发骨转移\n时，可出现碱性磷酸酶升高。\n2. 肿瘤标志物检测\nCA15-3、癌胚抗原是乳腺癌中应用价值较高\n的肿瘤标志物，主要用于转移性乳腺癌患者的病程\n监测。CA15-3 和癌胚抗原联合应用可显著提高检\n测肿瘤复发和转移的敏感性。由于其对局部病变的\n敏感性低，且在某些良性疾病和其他器官的恶性肿\n瘤中也可升高，因此不适合用于乳腺癌的筛查和\n"}, {"page": 5, "text": "5\n第19 卷\n2022 年第10 期\n标准与讨论\n诊断。\n三、组织病理学诊断\n病理学诊断是乳腺癌确诊和治疗的依据。规范\n化的乳腺癌病理诊断报告不仅需要提供准确的病理\n诊断，还需要提供正确、可靠的与乳腺癌治疗方案\n选择、疗效预测和预后判断相关的标志物检测结果。\n进行病理学诊断时，临床医师需提供完整、确切的\n临床情况，以及合格、足量、完整的组织标本。\n（一）标本类型及固定\n1. 标本类型\n乳腺标本类型主要包括空芯针穿刺活检标本、\n真空辅助活检标本和各种手术切除标本（乳腺微创\n旋切术、乳腺肿块局部切除术、乳腺病变保乳切除\n术、乳腺单纯切除术乳腺改良根治术标本、以及乳\n腺癌新辅助化疗后的改良根治标本）。\n2. 标本固定\n穿刺或切除后的乳腺组织应立即固定（不得超\n过1 小时为宜）。应选择足够的磷酸缓冲液配制的\n4% 中性甲醛固定液。活检标本固定时间6~48 小时\n为宜。对于切除标本，应将其每隔5~10mm 切开，\n宜用纱布或滤纸将相邻的组织片分隔开，以保障固\n定液的充分渗透和固定。固定时间12~72 小时为宜。\n（二）取材及大体描述指南\n接受标本后，首先必须核对标本袋信息及病理\n检查申请单的信息（包括姓名、性别、年龄、床\n位号、住院号、标本类型及部位、临床诊断、送检\n者等）。\n1. 空芯针穿刺活检标本\n（1）大体检查及记录：标明穿刺组织的数目、\n每块组织的大小，包括直径和长度。\n（2）取材：送检组织全部取材。空芯针穿刺活\n检标本不宜行术中病理诊断。\n2. 真空辅助（乳腺微创旋切）活检标本\n（1）大体检查及记录：标明活检组织的总大小。\n（2）取材：送检组织全部取材。如临床送检组\n织标记钙化及钙化旁，需记录注明，并将其分别置\n于不同的包埋盒中。真空辅助活检标本不宜行术中\n病理诊断。\n3. 乳腺肿块切除标本\n（1）大体检查及记录：按外科医师的标示确定\n送检标本的部位。若未标记，应联系外科医师明确\n切除标本所在的位置。测量标本3 个径线的大小；\n若带皮肤，应测量皮肤的大小。测量肿瘤或可疑病\n变3 个径线的大小。记录肿瘤或可疑病变的部位和\n外观。记录每块组织所对应的切片总数及编号。 \n（2）取材：术中冰冻取材：沿标本长轴每隔\n5mm 做1 个切面，如有明确肿块，在肿块处取材。\n如为钙化灶，宜对照X 线摄片对可疑病变取材或按\n标记探针位置取材。如无明确肿块，对可疑病变处\n取材。\n常规标本取材：若肿块或可疑病变最大径≤5cm，\n应至少每1cm 取材1 块，必要时［如导管原位癌\n（ductal carcinoma in situ，DCIS）］宜将病变全部\n取材后送检。若肿块或可疑病变最大径大于5cm，\n应每1cm 至少取材1 块，如6cm 的肿块至少取材\n6 块；如已诊断为DCIS，建议将病灶全部取材。乳\n腺实质的其他异常和皮肤均需取材。\n4. 乳腺病变保乳切除标本\n（1）大体检查及记录。冰冻另送切缘者需对切\n缘检查及记录。\nⅰ按外科医师的标示确定送检标本的部位。若\n未标记，应联系外科医师明确切除标本所在的位置。\nⅱ测量标本3 个径线的大小，若附带皮肤，则\n测量皮肤的大小。\nⅲ根据临床标记，正确放置标本，建议将标本\n各切缘（表面切缘、基底切缘、上切缘、下切缘、\n内切缘、外切缘）涂上不同颜色的染料。待色标略\n干后，吸干多余的染料。\nⅳ按从表面到基底的方向，沿标本长轴每隔\n3~5mm 做1 个切面，将标本平行切分为若干块组\n织，并保持各块组织的正确方向和顺序。\n"}, {"page": 6, "text": "6\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\nⅴ仔细查找病灶，并测量肿瘤3 个径线的大小；\n若为化疗后标本，则测量瘤床大小；若为局切后标\n本，则描述残腔大小及有无残留病灶。\nⅵ测量肿瘤、瘤床或残腔距各切缘的距离，观\n察最近切缘。\nⅶ记录每块组织所对应的切片编号及对应取材\n内容。\n（2）取材。\nⅰ切缘取材：冰冻另送切缘者除外切缘取材。\n保乳标本切缘取材主要有2 种方法：垂直切缘\n放射状取材和切缘离断取材。2 种切缘取材方法各\n有优缺点。无论采取何种取材方法，建议在取材前\n将六处标本切缘涂上不同颜色的染料，以便在镜下\n观察时能根据不同颜色对切缘作出准确的定位，并\n正确测量肿瘤和切缘的距离。保乳标本病理报告中\n需明确切缘状态（阳性或阴性）。“阳性切缘”是指\n墨染切缘处有DCIS 或浸润性癌侵犯。“阴性切缘”\n的定义并不一致，但多数指南或共识中将“墨染切\n缘处无肿瘤”定义为“阴性切缘”。对于切缘阴性者，\n建议报告切缘与肿瘤的最近距离，应尽量用客观的\n定量描述，而不建议用主观描述（如距切缘近等）。\n垂直切缘放射状取材：根据手术医师对保乳标\n本做出的方位标记，垂直于基底将标本平行切成多\n个薄片（建议间隔5mm），观察每个切面的情况。\n描述肿瘤大小、所在位置及肿瘤距各切缘的距离，\n取材时将大体离肿瘤较近处的切缘与肿瘤一起全部\n取材，大体离肿瘤较远处的切缘抽样取材，镜下观\n察时准确测量切缘与肿瘤的距离。垂直切缘放射状\n取材的优点是能正确测量病变与切缘的距离，缺点\n是工作量较大，且对大体离肿瘤较远的切缘只能抽\n样取材。\n切缘离断取材：将六处切缘组织离断，离断的\n切缘组织充分取材，镜下观察切缘的累犯情况。切\n缘离断取材的优点是取材量相对较少，能通过较少\n的切片对所有的切缘情况进行镜下观察，缺点是不\n能准确测量病变与各切缘的距离。\nⅱ肿瘤及周围组织取材：①若肿块或可疑病变\n最大径≤5cm，应沿肿瘤或可疑病变的最大切面至\n少每1cm 取材1 块，必要时（如DCIS）宜全部取\n材后送检。若肿块或可疑病变最大径大于5cm，则\n每1cm 至少取材1 块；如已诊断为DCIS，建议将\n病灶全部取材。若为新辅助化疗后标本，则参照乳\n腺癌新辅助治疗后病理诊断规范（2020 版）进行取\n材。若为手术残腔：送检代表性的切面，包括可疑\n的残留病灶。②乳腺实质的其他异常。③皮肤。\nⅲ补充切缘取材：若首次切除时为阳性切缘，\n需再次送检切缘。补充切缘亦可作为单独的标本同\n切除组织一同送检。若外科医师已对补充切缘中真\n正的切缘做了标记，可用染料对真正切缘处进行涂\n色，并垂直于标记处切缘将标本连续切开并送检。\n如果标本较小，所有组织应全部送检。\n5. 乳腺切除术（包括单纯切除术和改良根治术）\n（1）大体检查及记录：①按正确的方向摆放标\n本以便识别肿瘤所在的象限：改良根治术标本可通\n过识别腋窝组织来正确定位（腋窝组织朝向外上\n方）。单纯切除术标本，需根据外科医师的标记来定\n位，若未标记方向，则与外科医师联系以确定标本\n的正确方向。建议标本的基底切缘涂上染料以便镜\n下观察切缘情况。②测量整个标本及附带皮肤、腋\n窝组织的大小。描述皮肤的外观，如有无手术切口、\n穿刺点、瘢痕、红斑或水肿等。③从基底部水平切\n开乳头，取乳头水平切面组织一块以观察输乳管的\n横断面，而后垂直于乳腺表面切开乳头其他组织。\n描述乳头、乳晕的外观，如有无破溃及湿疹样改变\n等。④垂直于基底将标本切成连续的薄片。⑤仔细\n查找病灶，记录病灶所在象限位置，描述肿瘤（质\n地、颜色、边界、与皮肤及深部结构的关系）的特\n征。若有明确肿块，则测量肿瘤3 个径线的大小；\n若为化疗后标本，则测量瘤床大小；若为局切后标\n本，则描述手术残腔大小及有无残留病灶。测量肿\n瘤、残腔、瘤床距最近表面切缘及基底切缘的距离。\n⑥描述非肿瘤乳腺组织的情况。⑦将腋窝脂肪组织\n"}, {"page": 7, "text": "7\n第19 卷\n2022 年第10 期\n标准与讨论\n同标本离断后，仔细寻找淋巴结，对规范的腋窝清\n扫标本宜至少找及15 枚淋巴结。描述淋巴结的总\n数目及最大径范围、有无融合、有无与周围组织粘连。\n注意需附带淋巴结周围的结缔组织。\n（2）取材。\nⅰ原发肿瘤和手术残腔的取材：若为肿瘤：送检\n肿瘤的最大切面；若肿块或可疑病变最大径≤5cm，\n应至少每1cm 取材1 块，必要时（如DCIS）宜\n全部取材后送检。若标本肿块或可疑病变最大\n径>5cm，则每1cm 至少取材1 块，如已诊断为\nDCIS，应将病灶全部取材。\n若为化疗后瘤床：参照乳腺癌新辅助治疗后病\n理诊断规范（2020 年版）取材。\n若为手术残腔：送检代表性的切面，包括可疑\n的残留病灶。\nⅱ其余组织的异常病灶：乳头：距肿瘤最近处表\n面被覆皮肤；距肿瘤最近处基底切缘，尽可能取切\n缘的垂直切面；周围象限乳腺组织每个象限代表性\n取材1 块。\n腋窝淋巴结：若淋巴结肉眼观察为阴性，则送\n检整个淋巴结行组织学检查；若淋巴结肉眼阳性，\n则沿淋巴结最大径剖开后取组织送检，注意需附带\n淋巴结周围的结缔组织，以识别淋巴结被膜外的肿\n瘤转移灶。\n6. 前哨淋巴结活检\n乳腺癌前哨淋巴结活检（Sentinel lymph \nnode biopsy，SLNB）已逐渐取代传统的腋窝淋巴\n结清扫来评估早期乳腺癌患者的区域淋巴结情况，\nSLNB 阴性者可避免腋窝淋巴结清扫。\n（1）前哨淋巴结转移灶的定义。\nⅰ孤立肿瘤细胞（isolated tumor cells，ITC）：\n淋巴结中的肿瘤病灶直径≤0.2mm：淋巴结中，或\n单张切片上的肿瘤细胞<200 个。AJCC 定义其为\npN0（i+）。目前大部分临床乳腺癌诊疗指南认为\nITC 无临床意义，推荐按腋窝淋巴结阴性处理。\nⅱ微转移：肿瘤转移灶最大径>0.2mm，但不\n超过2mm。AJCC 定义其为pN1mi。ITC 与微转\n移有着本质的不同，前者为pN0，后者为pN1，两\n者的鉴别非常重要。本标准中推荐将前哨淋巴结间\n隔2mm 切成若干片组织，主要目的是为了最大程\n度检测出微转移病灶。\nⅲ宏转移：肿瘤转移灶最大径>2mm。\n（2）术中病理评估：前哨淋巴结中术中病理评\n估的主要目的是检测出淋巴结中的转移病灶，从而\n进行腋窝淋巴结清扫，以避免二次手术。但目前对\n前哨淋巴结术中病理评估是否必要存在争议。术中\n病理评估的方法主要包括术中细胞印片和术中冷冻\n切片。\nⅰ术中细胞印片：将淋巴结每间隔2mm 切成\n若干片组织，仔细检查每片组织上是否存在肉眼可\n见的转移灶，对每个切面行细胞印片。推荐巴氏染\n色和HE 染色。术中细胞印片的优点是可保全整个\n淋巴结组织，对组织无损耗，可对淋巴结的不同切\n面取材，价廉，所需时间短，制作流程简单；缺点\n是在印片的高细胞背景下辨认出分散的癌细胞（如\n小叶癌）有一定难度。术中细胞印片有很好的诊断\n特异性，但其诊断敏感性受多种因素的影响。\nⅱ术中冷冻切片：将淋巴结每间隔2mm 切成\n若干片组织，仔细检查每片组织上是否存在肉眼可\n见的转移灶，每片组织制成冷冻切片行病理评估。\n术中冷冻切片的优点是诊断特异性好，能够避免因\n假阳性而造成不必要的腋窝淋巴结清扫；缺点是组\n织损耗，用时长，费用较高，且难以评估脂肪化的\n淋巴结等。\n（3）术后常规石蜡病理评估：术后石蜡切片是\n前哨淋巴结诊断的金标准，可明显减少微小转移的\n漏诊。但是关于如何切分淋巴结、是否需要连续切\n片、切多少张连续切片、连续切片之间间隔多少尚\n无统一意见。推荐石蜡切片方案：①将淋巴结每间\n隔2mm 切成若干片组织；②每片组织均包埋成石蜡\n组织块；③每个蜡块至少切一张切片；有条件的单位\n推荐连续切片，间隔150~200μm，切6 个切面。\n"}, {"page": 8, "text": "8\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n（三）病理诊断分类、分级和分期方案\n1. 组织学分型\n参见附件2，组织学分型主要依据2012 和\n2019 版WHO 乳腺肿瘤分类，某些组织学类型的\n准确区分需行免疫组化后确定。\n对乳腺浸润性癌进行准确的组织学分型对患者\n的个体化治疗具有非常重要的临床意义。在NCCN\n乳腺癌临床实践指南有关乳腺浸润性癌的术后辅助\n治疗方案中，针对小管癌、黏液癌这两类预后较好\n的乳腺癌，制定了与其他类型的浸润性癌不同的内\n分泌治疗及放化疗方案，因此要严格掌握这些特殊\n类型乳腺癌的诊断标准。对于炎性乳腺癌这类预后\n较差的乳腺癌，NCCN 乳腺癌临床实践指南也制定\n了有别于其他浸润性癌的手术及术前术后辅助治疗\n方案。过去认为髓样癌预后较好，但目前的研究表\n明其转移风险与其他高度恶性的浸润性癌相当，其\n诊断重复性在不同观察者之间的差异也很明显。因\n此NCCN 指南建议，对伴有髓样特征的浸润性癌\n患者应根据其临床和病理分期接受与浸润性导管癌\n（invasive ductal carcinoma，IDC）一样的治疗。\n某些特殊类型的乳腺癌具有较特殊的临床特征，如\n浸润性微乳头状癌较易出现淋巴结转移，即使出现\n较少比例的浸润性微乳头状癌，也应在病理报告中\n注明百分比。对于混合性癌，建议报告不同肿瘤类\n型所占的比例，并分别报告2 种或以上成分的肿瘤\n分子生物标记的表达情况。\n2. 组织学分级\n（1）浸润性乳腺癌（参见附件3）：组织学分级\n是重要的预后因素，多项研究显示在浸润性乳腺癌\n中，组织学分级与预后明确相关。目前应用最广泛\n的浸润性癌病理分级系统是改良的Scarff-Bloom-\nRichardson（Nottingham）组织计分系统，根据\n腺管形成的比例、细胞的异型性和核分裂象计数三\n项重要指标，每项指标分别独立评估，各给予1~3\n分，相加后根据总分将浸润性癌划分为1、2、3 共\n三个级别。\n腺管分化程度的评估针对整个肿瘤，需要在\n低倍镜下评估。只计数有明确中央腺腔且由有极向\n肿瘤细胞包绕的结构，以腺管/肿瘤区域的百分比\n表示。\n细胞核多形性的评估要选取多形性最显著的\n区域。该项评估参考周围正常乳腺上皮细胞的核\n大小、形状和核仁大小。当周边缺乏正常细胞时，\n可用淋巴细胞作为参照。当细胞核与周围正常上\n皮细胞的大小和形状相似、染色质均匀分布时，\n视为1 分；当细胞核比正常细胞大，形状和大小有\n中等程度差异，可见单个核仁时，视为2 分；当细\n胞核的大小有显著差异，核仁显著，可见多个核\n仁时应视为3 分。\n只计数明确的核分裂象，不计数核浓染和核碎\n屑。核分裂象计数区域必须要根据显微镜高倍视野\n的直径进行校正。核分裂象计数要选取增殖最活跃\n的区域，一般常见于肿瘤边缘，如果存在肿瘤中的\n异质性，要选择核分裂象多的区域。\n（2）乳腺DCIS 的分级：对于DCIS，病理报告\n中应该包括分级，并建议报告是否存在坏死，组织\n学结构、病变大小或范围、切缘状况。目前乳腺原\n位癌的分级主要是细胞核分级，诊断标准如下。\n低核级DCIS：由小而一致的癌细胞组成，呈\n僵直搭桥状、微乳头状、筛状或实体状结构。细胞\n核大小一致，染色质均匀，核仁不明显，核分裂象\n少见。\n中核级DCIS：形态介于低级别和高级别DCIS\n之间，细胞的大小、形状、极性有轻- 中等差异。\n染色质粗细不等，可见核仁，核分裂象可见，可出\n现点状坏死或粉刺样坏死。\n高核级DCIS：由高度不典型的细胞组成，形成\n微乳头状、筛状或实体状。细胞核多形性明显，缺\n乏极性排列，染色质粗凝块状，核仁明显，核分裂\n象较多。管腔内常出现伴有大量坏死碎屑的粉刺样\n坏死。但腔内坏死不是诊断高级别DCIS 的必要条\n件，有时导管壁衬覆单层细胞，但细胞高度异型，\n"}, {"page": 9, "text": "9\n第19 卷\n2022 年第10 期\n标准与讨论\n也可以诊断为高级别DCIS。\n3. 乳腺癌的分期方案\n参见附件4。肿瘤分期包括了肿瘤的大小、累\n及范围（皮肤和胸壁受累情况）、淋巴结转移和远\n处转移情况。正确的肿瘤分期是指导患者个体化治\n疗决策的基础。乳腺癌患者要进行临床分期和病理\n分期。\n第8 版AJCC 乳腺癌分期对肿瘤大小的测量做\n出了详尽的规定。肿瘤大小的测量有多种方法，包\n括临床触诊、影像学评估、病理大体测量和显微镜\n下测量。乳腺癌分期中涉及的肿瘤大小是指浸润性\n癌的大小。由于体检、影像学及大体检查均无法区\n分浸润性癌和导管内癌，因此显微镜下测量应该是\n最准确的测量方式。如果浸润性癌范围较大，无法\n用1 个蜡块全部包埋，则以巨检时的肿瘤大小为准。\n若浸润性癌病灶局限，可以用1 个蜡块全部包埋，\n则肿瘤大小以显微镜下测量的大小为准。（1）如果\n肿瘤组织中有浸润性癌和原位癌2 种成分，肿瘤的\n大小应该以浸润性成分的测量值为准，可注明原位\n癌的范围和比例等。（2）原位癌伴微浸润：出现微\n浸润时，应在报告中注明，并测量微浸润灶最大径；\n如为多灶微浸润，浸润灶大小不能累加，需在报告\n中注明多灶微浸润，并测量最大浸润灶的大小。（3）\n对于肉眼能确定的发生于同一象限的2 个以上多个\n肿瘤病灶，应在病理报告中注明为多灶性肿瘤，并\n分别测量大小。（4）对于肉眼能确定的发生于不同\n象限的2 个以上多个肿瘤病灶，应在病理报告中注\n明为多中心性肿瘤，并分别测量大小。（5）如果肿\n瘤组织完全由DCIS 组成，应尽量测量其范围。淋\n巴结状态是决定乳腺癌患者治疗和预后的重要因素，\n对于淋巴结转移数位于分期临界值（如1、3 和10\n个转移）附近时，要特别仔细观察淋巴结的转移数\n目，从而做出准确的pN 分期。\n新辅助治疗后标本的分期需结合临床检查、影\n像学检查和病理检查信息，根据手术切除标本的情\n况对治疗后的yT 和yN 进行判定。\n4. 免疫组化和肿瘤分子病理检测及其质量控制\n应对所有乳腺浸润性癌病例进行雌激素受体\n（estrogen receptor，ER）、孕激素受体（progesterone \nreceptor，PR）、HER2 免疫组化染色，HER2（2+）\n病例应进一步行原位杂交检测。评估ER、PR 状\n态的意义在于确认内分泌治疗获益的患者群体以及\n预测预后，ER 和/或PR 阳性患者可采用他莫昔芬\n和芳香化酶抑制剂等内分泌治疗。ER、PR 的规范\n化病理报告需要报告阳性细胞强度和百分比。ER\n及PR 阳性定义：≥1% 的阳性染色肿瘤细胞。评估\nHER2 状态的意义在于确认适合HER2 靶向治疗的\n患者群体以及预测预后。HER2 阳性定义：经免疫\n组织化学检测，超过10% 的细胞出现完整胞膜强着\n色（3+）和/或原位杂交检测到HER2 基因扩增（单\n拷贝HER2 基因>6 或HER2/CEP17 比值>2.0）。\nER、PR 检测参考《中国乳腺癌ER、PR 检测指\n南》（参见附件5）。HER2 检测参考《中国乳腺癌\nHER2 检测指南》（参见附件6）。\nKi-67 增殖指数在乳腺癌治疗方案选择和预后\n评估上起着越来越重要的作用，应对所有乳腺浸润\n性癌病例进行Ki-67 检测，并对癌细胞中阳性染色\n细胞所占的百分比进行报告。对于Ki-67 计数，目\n前尚缺乏相关共识。建议在低倍镜下评估整张切片，\n观察阳性细胞分布是否均匀：\n若肿瘤细胞中阳性细胞分布较均匀，可随机选\n取3 个或以上浸润性癌高倍视野计数，得出一个平\n均的Ki-67 增殖指数。\n若肿瘤细胞中阳性细胞分布不均匀，出现明\n显的Ki-67 增殖指数高表达区域（热点区）。主要\n有2 种情况：①在肿瘤组织边缘与正常组织交界处\n出现热点区，而肿瘤组织内Ki-67 增殖指数相对较\n低，推荐选取肿瘤边缘区域热点区≥3 个浸润性癌\n高倍视野进行Ki-67 增殖指数评估；②在肿瘤组织\n内出现热点区，可对整张切片的Ki-67 增殖指数\n进行平均评估，选取视野时应包括热点区域在内\n的≥3 个浸润性癌高倍视野。当Ki-67 增殖指数介\n"}, {"page": 10, "text": "10\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n于10%~30% 的临界值范围时，建议尽量评估500\n个以上的浸润性癌细胞，以提高结果的准确度。\n开展乳腺癌免疫组化和分子病理检测的实验室\n应建立完整有效的内部质量控制，不具备检测条件\n的单位应妥善地保存好标本，以供具有相关资质的\n病理实验室进行检测。\n具有合格资质的病理实验室应满足以下条件：\n（1）应建立完善的标准操作程序，并严格遵照\n执行，做好每次检测情况的记录和存档工作。应开\n展同一组织不同批次染色结果的重复性分析。检测\n相关的仪器和设备应定期维护、校验。任何操作程\n序和试剂变化均应重新进行严格的验证。\n（2）从事乳腺癌免疫组化和分子病理检测的实\n验技术人员和病理医师应定期进行必要的培训、资\n格考核和能力评估。\n（3）实验室外部质控可通过参加有关外部质控\n活动来实现。外部质控的阳性和阴性符合率应达到\n90% 以上。外部质控活动推荐每年参加1~2 次。\n5. 病理报告内容及指南\n乳腺浸润性癌的病理报告（参见附件5）应包\n括与患者治疗和预后相关的所有内容，如肿瘤大小、\n组织学类型、组织学分级、有无并存的DCIS、有\n无脉管侵犯、神经侵犯、乳头、切缘和淋巴结情况等。\n还应包括ER、PR、HER2、Ki-67 等指标的检测\n情况。若为治疗后乳腺癌标本，则应对治疗后反应\n进行病理评估。DCIS 的病理诊断报告应报告核级\n别（低、中或高级别）和有无坏死（粉刺或点状坏\n死）、手术切缘情况以及ER 和PR 表达情况。对癌\n旁良性病变，宜明确报告病变名称或类型。对保乳\n标本的评价宜包括大体检查及显微镜观察中肿瘤距\n切缘最近处的距离、若切缘阳性，应注明切缘处肿\n瘤的类型（原位癌或浸润性癌）。淋巴管/血管侵犯\n需要与乳腺癌标本中经常出现的组织收缩引起的腔\n隙鉴别。相对而言，收缩腔隙在肿瘤组织内更常见，\n而在肿瘤主体周围寻找脉管侵犯更可靠。\n四、鉴别诊断\n乳腺癌需与乳腺增生、纤维腺瘤、囊肿、导管\n内乳头状瘤、乳腺导管扩张症（浆细胞性乳腺炎）、\n乳腺结核等良性疾病，与乳房恶性淋巴瘤、间叶源\n性肉瘤以及其他部位原发肿瘤转移到乳腺的继发性\n乳腺恶性肿瘤进行鉴别诊断。鉴别诊断时需要详细\n地询问病史和仔细地体格检查，并结合影像学检查\n（乳腺超声、乳腺X 线摄影及乳腺磁共振等），最后\n还需要细胞学和/或病理组织学检查明确诊断。\n临床查体可触及肿块的乳腺癌约占80%，可以\n进行外科手术活检行病理组织学诊断，在有条件的\n医院可借助穿刺活检尽快明确诊断。但临床触诊阴\n性的乳腺癌增加了诊断的困难，需借助影像学定位\n进行病灶穿刺，或在乳腺X 线技术引导下放置金属\n定位线，再经外科切除活检明确诊断。\n少数乳腺癌患者伴有乳头溢液，需与乳腺增生、\n导管扩张、乳汁潴留、导管内乳头状瘤及乳头状瘤\n病等鉴别。有条件的医院可借助乳头溢液细胞学涂\n片查找癌细胞，通过乳管内镜检查，了解乳管内有\n无占位性病变，需要时再经活检明确诊断。\n五、治疗\n（一）治疗原则\n乳腺癌应采用综合治疗的原则，根据肿瘤的生\n物学行为和患者的身体状况，联合运用多种治疗手\n段，兼顾局部治疗和全身治疗，以期提高疗效和改\n善患者的生活质量。\n1. 非浸润性乳腺癌的治疗\n（1）LCIS：经典型LCIS 中的小叶内终末导管\n或腺泡呈实性膨大，其中充满均匀一致的肿瘤细胞。\n肿瘤细胞体积小而一致，黏附性差。细胞核呈圆形\n或卵圆形，染色质均匀，核仁不明显。细胞质淡染\n或淡嗜酸性，可含黏液空泡致细胞核偏位呈印戒细\n胞样，细胞质也可透亮。LCIS 包括多种亚型：多形\n性型、旺炽型、透明型、肌样细胞型等。其中较为\n重要的是多形性亚型。多形性LCIS 中的肿瘤细胞\n"}, {"page": 11, "text": "11\n第19 卷\n2022 年第10 期\n标准与讨论\n黏附性差，细胞核显著增大，有明显的多形性，可\n有显著的核仁和核分裂象，有时可见粉刺样坏死或\n钙化，需与高级别DCIS 相鉴别。非典型性小叶增\n生（atypical lobular hyperplasia，ALH）和LCIS\n在形态学上具有相似之处，但累犯终末导管小叶单\n位（terminal ductal lobular unit，TDLU）的程\n度不同。当TDLU 单位中≥50% 的腺泡被诊断性细\n胞所充满并扩张时可诊断为LCIS，小于50% 时则\n诊断为ALH。根据AJCC（第8 版），将LCIS 当\n做乳腺良性病变，然而专家团认为仍需谨慎适用，\n推荐对非经典型LCIS 需积极处理。\nLCIS 发展为浸润性癌的风险相对较小，具有\n癌变间期长、双侧乳房和多个象限发病的特点。一\n些研究发现，在诊断为ALH 和LCIS 的妇女中，终\n生发生癌变的概率为5%~32%，平均癌变率为8%。\nLCIS 癌变发生于双侧乳房的机会均等，而不仅局限\n于原发LCIS 部位。多数观点认为，LCIS 是癌变的\n危险因素，有些研究则认为LCIS 是癌前病变。有\n研究显示，LCIS 多数进展为浸润性小叶癌，但是也\n可进展为IDC。这是一个值得重视的癌前病变，对\n其治疗需要更有效而确切的方法。\nLCIS 可无任何临床症状，亦可没有乳房肿块、\n乳头溢液、乳头肿胀及皮肤改变等体征，有时仅有\n类似增生样改变。依据中国女性乳腺特点，应完善\n乳腺X 线、乳腺超声检查，必要时可行乳腺MRI；\n拟行保乳手术患者，术前必须行乳腺X 线检查。在\n乳腺X 线检查发现有钙化、肿块、结构紊乱后，其\n通过穿刺活检（包括空芯针穿刺以及真空辅助穿刺\n活检）或开放活检均可被诊断。如穿刺活检提示为\n经典型LCIS 患者，则可以进行常规的影像学随访\n而不行开放活检。若穿刺活检提示为多形性LCIS\n或穿刺结果与影像学检查不符，需行开放活检以除\n外DCIS 及浸润癌。LCIS 亦有因其他乳房病变进行\n手术活检时发现。典型的LCIS 与低级别的DCIS 很\n相似，可采用E- 钙黏蛋白及P120 免疫组织化学染\n色来鉴别。\nLCIS 如果行广泛切除后，绝经前可予他莫昔芬\n（三苯氧胺）治疗5 年；绝经后口服他莫昔芬或雷洛\n昔芬降低风险；若不能排除多形性LCIS 可行全乳切\n除术，视情况进行乳房重建。\n（2）DCIS：又称导管内癌，为非浸润性癌，多\n数发生于TDLU，也可发生于大导管，是局限于乳\n腺导管内的原位癌。典型的DCIS 在乳腺X 线检查\n上多表现为不伴肿块的簇状微小钙化灶，恶性钙化\n还可表现为细小点样、线状、分支状钙化等。在实\n际工作中，多采用以核分级为基础，兼顾坏死、核\n分裂象及组织结构的分级模式，将DCIS 分为3 级，\n即低级别、中级别和高级别。高级别DCIS 往往由\n较大的多形性细胞构成，核仁明显、核分裂象常见。\n管腔内常出现伴有大量坏死碎屑的粉刺样坏死，但\n腔内坏死不是诊断高级别DCIS 的必要条件。低级\n别DCIS 由小的单形性细胞组成，细胞核圆形，大\n小一致，染色质均匀，核仁不明显，核分裂象少见。\n肿瘤细胞排列成僵直搭桥状、微乳头状、筛状或实\n体状。中级别DCIS 结构表现多样，细胞异型性介\n于高级别和低级别DCIS 之间。\nDCIS 可能是IDC 的前驱病变，DCIS 不经治疗\n最终可能会发展为IDC。对最初误诊为良性病变而\n导致未能获得治疗的DCIS 研究显示，从DCIS 进\n展为IDC 的比例为14%~53%。\n依据中国女性乳腺特点，应完善乳腺X 线检\n查、乳腺超声检查，必要时可行乳腺MRI。拟行保\n乳手术的患者，术前必须行乳腺X 线检查诊断。至\n少有90% 的DCIS 是在乳腺X 线检查筛查中被发\n现，多数表现为微小钙化灶，部分表现为微小钙化\n灶伴肿块影或致密影，约10% 患者有可触及的肿块，\n约6% 患者乳腺X 线检查表现为假阴性。DCIS 的\n典型MRI 表现为沿导管分布的导管样或段样成簇\n小环状强化，也可表现为局灶性、区域性或弥漫性\n强化，孤立性或多发性肿块。超声下DCIS 多表现\n为边界不清的肿块，内部呈低回声，肿块内多具有\n弥漫、成堆或簇状分布的针尖样、颗粒状钙化，肿\n"}, {"page": 12, "text": "12\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n块内血流多较丰富。空芯针穿刺活检及开放活检都\n是获取DCIS 组织学诊断的手段，但穿刺活检提示\n为DCIS 患者，可选择开放活检以明确有无浸润癌。\n在穿刺结果为DCIS 患者中，25% 有IDC 成分；在\n穿刺结果为LCIS 患者中，开放活检后有17%~27%\n病理升级为DCIS 或浸润性癌。因此建议穿刺活检\n后行开放活检。DCIS 的病理诊断，推荐完整取材、\n规范取材。\nⅰ局部扩大切除并全乳放射治疗。\nⅱ全乳切除，视情况进行SLNB 和乳房重建。\n对于单纯原位癌患者，在未获得浸润性乳腺癌\n证据或者未证实存在肿瘤转移时，不建议行全腋窝\n淋巴结清扫。然而，仍有一小部分临床诊断为单纯\n原位癌的患者在进行手术时被发现为浸润性癌，应\n按浸润癌处理。单纯LCIS 的确诊必须依据手术活\n检结果。\nⅲ以下情形考虑采用他莫昔芬治疗5 年以降\n低保乳手术后同侧乳腺癌复发风险：①接受保乳手\n术（肿块切除术）加放疗的患者，尤其是ER 阳性\n的DCIS 患者；ER 阴性的DCIS 患者他莫昔芬治疗\n效果尚不确定。②对于接受全乳切除术的DCIS 患\n者术后可通过口服他莫昔芬或雷洛昔芬来降低对侧\n乳腺癌风险，但需权衡化学预防的临床获益与不良\n反应。\n2. 浸润性乳腺癌的治疗\n（1）保乳手术加放射治疗。\n（2）乳腺癌全乳切除联合腋窝淋巴结清扫手术\n（改良根治术），视情况进行乳房重建。\n（3）全乳切除并SLNB，视情况进行乳房重建。\n（4）老年人乳腺癌：局部扩大切除或全乳切除\n（根据手术及麻醉风险），受体阳性患者需进行内分\n泌治疗，视情况做SLNB。\n（二）手术治疗\n1. 手术治疗原则\n乳腺癌手术范围包括乳腺和腋窝淋巴结两部\n分。乳腺手术有肿瘤扩大切除和全乳切除。腋窝淋\n巴结可行SLNB 和腋窝淋巴结清扫，除原位癌外均\n需了解腋窝淋巴结状况。选择手术术式应综合考虑\n肿瘤的临床分期和患者的身体状况。\n2. 乳腺手术\n（1）乳房切除手术：适应症为TNM 分期中0、\nⅠ、Ⅱ期及部分Ⅲ期且无手术禁忌，患者不具备实施\n保乳手术条件或不同意接受保留乳房手术；局部进\n展期或伴有远处转移的患者，经全身治疗后降期，\n亦可选择全乳切除术。\nHalsted 传统根治术中采用的乳房切除术需同\n时切除胸大小肌，创伤大，并发症发生率高，目前\n已被改良根治术所取代。其切除范围包括上至锁骨\n下、下至腹直肌前鞘、内至胸骨旁、外至背阔肌的\n解剖边界内，连同胸大肌筋膜完整切除乳腺组织及\n乳头乳晕复合体，只有当胸肌受累时才需切除部分\n或全部胸肌。部分学者认为可保留胸大肌筋膜，尤\n其是需要进行术中即刻假体/扩张器重建时。\n目前的乳房切除术已由改良根治术发展为保留\n皮肤的乳房切除+ 乳腺重建手术，两者治疗效果类\n似，但后者美容效果更好。此外，保留乳头乳晕的\n乳房切除术在临床上的应用也日趋广泛，但还缺乏\n长期研究数据，需进一步完善患者选择问题。\n（2）保留乳房手术：严格掌握保乳手术适应症。\n实施保乳手术的医疗单位应具备保乳手术切缘的组\n织学检查设备与技术，保证切缘阴性；保乳术后放\n射治疗的设备与技术。保留乳房手术后美容效果评\n价标准见附件7。\n保乳手术适用于患者有保乳意愿，乳腺肿瘤可\n以完整切除，达到阴性切缘，并可获得良好的美容\n效果、同时可接受术后辅助放疗的患者。年轻不作\n为保乳手术的禁忌，≤35 岁的患者有相对高的复发\n和再发乳腺癌的风险，在选择保乳时，应向患者充\n分交代可能存在的风险。\n保乳手术的绝对禁忌症包括病变广泛或弥漫分\n布的恶性特征钙化灶，且难以达到切缘阴性或理想\n外形；T4 期乳腺癌，包括侵犯皮肤、胸壁及炎性乳\n"}, {"page": 13, "text": "13\n第19 卷\n2022 年第10 期\n标准与讨论\n腺癌；肿瘤经局部广泛切除后切缘阳性，再次切除\n后仍不能保证病理切缘阴性者；妊娠期乳腺癌，预\n估术后放疗无法等到分娩后者；患者拒绝行保留乳\n房手术。相对禁忌症包括肿瘤直径大于3cm 和累及\n皮肤的活动性结缔组织病，尤其是硬皮病和红斑狼\n疮等。\n3. 腋窝淋巴结的外科手术\n处理腋窝淋巴结是浸润性乳腺癌标准手术中的\n一部分。其主要目的是为了了解腋窝淋巴结的状况，\n以确定分期，选择最佳治疗方案。\n（1）乳腺癌SLNB：SLNB 具有创伤小且相关并\n发症少等优点，是指对最早接受乳腺癌区域淋巴引\n流和发生肿瘤转移的1 个（或几个）淋巴结进行切\n除活检，以评估腋窝淋巴结状态，NCCN 乳腺癌临\n床实践指南推荐临床腋窝淋巴结阴性的早期乳腺癌\n患者选择SLNB 作为腋窝淋巴结处理的优选手术方\n式。在SLNB 手术前，需进行前哨淋巴结示踪，目\n前SLNB 常用的示踪方法有染料法（专利蓝、异硫\n蓝、亚甲蓝和纳米炭）、核素法、染料联合核素法及\n荧光示踪法，运用最广泛的示踪方法为蓝染法联合\n核素法。SLNB 技术能够准确地进行乳腺癌腋窝淋\n巴结分期，对于临床检查腋窝淋巴结无明确转移的\n患者，进行SLNB 后，淋巴结阴性的患者可以免除\n腋窝淋巴结清扫，以减少上肢水肿等并发症的发生；\n若SLNB 阳性，可进行腋窝淋巴结清扫。\n（2）腋窝淋巴结清扫：腋窝淋巴结清扫的指征\n包括：①临床腋窝淋巴结阳性且经穿刺/手术活检\n证实有转移的患者；②前哨淋巴结阳性，且不符合\nACOSOG Z0011 入组标准的患者如T3、超过2 枚\n前哨淋巴结阳性以及需全部乳腺切除者；③近期不\n充分的腋窝淋巴结清扫；④前哨淋巴结验证试验；\n⑤SLNB 失败；⑥SLNB 发现临床可疑的淋巴结；\n⑦T4；⑧不能施行SLNB；⑨SLNB 后腋窝复发。\n通常情况下，腋窝淋巴结清扫范围应包括背阔\n肌前缘至胸小肌外侧缘（Level Ⅰ）、胸小肌外侧缘\n至胸小肌内侧缘（Level Ⅱ）的所有淋巴结。清扫腋\n窝淋巴结要求在10 个以上，以保证能真实地反映\n腋窝淋巴结的状况。只有当LevelⅠ~Ⅱ明显转移或\n者Level Ⅲ（胸小肌内侧缘至腋静脉入口处）探及\n增大转移的淋巴结时才需进行Ⅰ~Ⅲ水平的全腋窝淋\n巴结清扫。\n4. 乳房修复与重建\n乳腺癌改良根治手术后的乳房缺损与保乳术后\n的乳房畸形均需要整形外科进行再造和修复，且已\n成为乳腺癌完整治疗方案中不可或缺的一个重要组\n成部分。乳房再造提高术后患者的生活质量及心理\n满意度。我国乳房再造的数量逐年增加，方法越来\n越完善，乳房再造的理念和意识被越来越多的肿瘤\n外科医师所认识和接受。\n乳房再造的肿瘤学安全性是肯定的。是否行乳\n房再造、再造的时机及再造方式不影响乳腺癌患者\n术后的生存率和生存时间。乳房再造对外科手术或\n肿瘤复发、转移的检出没有影响。\n正常情况下，乳房再造不影响术后化疗的进行。\n除非即刻再造术后出现较严重并发症（如感染、切\n口裂开等），否则不会对化疗的临床应用及治疗效\n果造成显著影响。即刻乳房再造术后辅助化疗不会\n增加再造术后并发症发生率，不会降低即刻乳房再\n造成功率，不会影响伤口愈合，也不会影响再造效\n果。但新辅助化疗会增加即刻乳房再造术后皮瓣感\n染及坏死的发生率。化疗可造成人体免疫功能下降、\n抗感染能力降低，化疗期间不适合做任何乳房再造\n手术。\n无论自体组织再造，还是假体再造，均不是放\n射治疗的禁忌症，也不会对放疗效果产生明显影响。\n即刻乳房再造增加了术后放疗野设计的技术难度，\n但周密设计的放疗方案不影响放疗效果。放疗会影\n响再造的远期美学满意度及总体满意度。\n乳腺癌切除乳房再造的基本原则如下：\n（1）必须将肿瘤治疗放在首位。乳房再造的任\n何整形外科治疗都不应推迟乳腺癌辅助治疗的时间，\n不应影响乳腺癌辅助治疗的进行。\n"}, {"page": 14, "text": "14\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n（2）必须将乳房再造纳入乳腺癌的整个治疗\n方案，医师有义务告知患者有选择进行乳房再造的\n权利。\n（3）在乳腺切除过程中，应在不违反肿瘤学原\n则的前提下，尽可能保留乳房的皮肤、皮下组织以\n及重要的美学结构（如乳房下皱襞等），最大限度地\n为乳房再造保留条件，提高再造乳房美学效果和患\n者满意度。\n（4）乳腺癌的治疗应当在多学科团队合作框架\n下进行，包括放射科、乳腺外科、整形外科、影像科、\n病理科、心理科、核医学科、免疫科等。\n乳房再造的术前检查、评估和教育：术前应对\n患者的条件进行检测与评估，分析肿瘤学情况、内\n科情况、组织条件、对侧乳房情况等，综合这些条\n件选择创伤小、手术简化、费用少、并发症发生率\n低且效果良好的手术方案。\n禁忌行乳房再造的乳腺癌类型与分期：Ⅳ期浸\n润性乳腺癌、复发转移性乳腺癌。通常认为放化疗\n期间、放疗后半年内禁行乳房再造，对于接受过放\n疗或准备进行放疗的患者，应谨慎选择乳房再造的\n时机和手术方式。严重肥胖和吸烟、严重内科疾病、\n外周血管疾病都是术后出现并发症的重要风险因素，\n是乳房再造术的相对禁忌症。\n治疗周期及费用：①乳房再造是一个序列化的\n治疗，通常需要多次手术才能达到理想的效果。采\n用组织扩张法进行乳房再造。②即刻乳房再造在总\n体治疗时间和费用上较二期乳房再造具有优势。\n乳房再造的基本方法：包括皮肤覆盖的再造和\n乳房体积的再造。皮肤覆盖的再造方法包括组织扩\n张和自体皮瓣移植等，乳房体积的再造方法包括：\n应用假体、皮瓣组织瓣移植、游离自体脂肪移植等。\n自体组织乳房再造常用的皮瓣包括：背阔肌肌皮瓣、\n腹直肌肌皮瓣、腹壁下动脉穿支皮瓣等。\n随访时间：乳房再造的随访时间应从术后开始，\n至术后5 年以上，根据乳房再造方式不同，定期进\n行随访。观察指标：包括乳腺癌的肿瘤学随访、乳\n房外形与对称性、切口瘢痕、供区功能、假体完整\n性、包膜挛缩、其他并发症。必要时还应包括心理\n变化、生活质量变化等。检查项目：肿瘤学检查、\n乳房体表测量值、照相、供区运动功能测定、乳房\n假体包膜挛缩分级，必要时行超声、磁共振等特殊\n检查。建议指导：乳房再造术后，应给患者进行详\n细的术后指导，包括日常注意事项、运动、肿瘤学\n检查、复查时间等。\n（三）放射治疗\n1. 早期乳腺癌保乳术后放射治疗\n（1）适应症：原则上，所有接受保乳手术的\n患者均需接受放射治疗。对年龄>70 岁、乳腺肿\n瘤≤2cm、无淋巴结转移、ER 阳性、能接受规范内\n分泌治疗的女性患者，可以考虑省略保乳术后放疗。\n（2）照射范围。\nⅰ在有条件的单位，对经严格选择的低危患者，\n可以考虑行部分乳腺照射，具体的患者选择标准及\n治疗方式参见“（三）1.（5）部分乳腺照射”章节。\nⅱ腋窝淋巴结清扫或SLNB 未发现淋巴结转移\n的患者，照射范围为患侧乳腺。\nⅲ前哨淋巴结阳性且未行腋窝淋巴结清扫的患\n者，对于T1~2 期、1~2 个前哨淋巴结阳性的浸润\n性乳腺癌，可考虑予以全乳高位切线野放疗（即切\n线野上界位于肱骨头下2cm 以内），如采用调强放\n疗（intensity-modulated radiotherapy，IMRT）\n技术则需注意将低、中位腋窝与患侧全乳设为一体\n化靶区进行勾画与照射；但对于不符合该标准的保\n乳术后患者，照射范围建议包括患侧乳房，锁骨上\n及腋窝淋巴结引流区。\nⅳ接受腋窝淋巴结清扫，阳性淋巴结数为1~3\n个的患者，为了尽可能降低复发风险，原则上建议\n行淋巴引流区照射，可选择复发风险低危患者予以\n免除淋巴引流区照射。照射范围包括患侧锁骨上、\n下区，内乳照射应根据个体情况决定。年轻、激素\n受体（Hormone Receptor，HR）阴性、广泛脉管\n癌栓、原发灶位于内侧/中央象限、组织学分级高级\n"}, {"page": 15, "text": "15\n第19 卷\n2022 年第10 期\n标准与讨论\n别等危险因素的重叠可能会增加淋巴引流区照射的\n重要性。\nⅴ接受腋窝淋巴结清扫且淋巴结转移≥4 个的\n患者，照射靶区需包括患侧乳腺、锁骨上/下及内乳\n淋巴引流区（保证心肺安全前提下）。\nⅵ内乳照射目前存在争议，推荐具备下列条件\n患者考虑行内乳照射：①腋窝淋巴结清扫术后淋巴\n结转移≥4 个；②原发肿瘤位于内象限或中央区且\n伴有腋窝淋巴结转移；③年龄<35 岁且伴有腋窝淋\n巴结转移；④初诊时影像学诊断内乳淋巴结转移或\n经病理证实内乳淋巴结转移但未行内乳淋巴结清扫。\n内乳照射建议应用现代精准放疗技术，以便准确评\n估心脏等正常组织照射剂量，同时把握全身治疗及\n放疗对心脏相关损伤与内乳预防照射的获益与风险，\n必要时多学科充分沟通，或鼓励患者参加临床试验。\nⅶ腋窝清扫彻底的患者，不需要预防照射。腋\n窝放疗可用于具有以下腋窝复发高危因素的患者，\n但需要权衡肿瘤复发风险和放疗增加淋巴水肿的风\n险。高危因素包括：①腋窝清扫不彻底，根据患者\n术前腋窝转移淋巴结负荷、术中淋巴结与周围血管\n粘连情况及手术清扫的彻底程度、放疗前腋窝查体\n及影像学综合评估判断淋巴结是否残留；②淋巴结\n包膜外侵犯；③腋窝淋巴结转移数目较多同时阳性\n百分比高；④腋窝淋巴结阳性，腋窝淋巴结清扫总\n数<10 个。但需要区分腋窝淋巴结总数少是因为手\n术清扫不足还是病理科取材不充分，必要时与外科\n医师和病理科医师进行沟通。\nⅷ对接受全乳放疗的患者，对符合以下标准的\n患者，建议瘤床补量：①浸润性乳腺癌：年龄≤50\n岁、任意级别，或51 岁至70 岁、高级别，或切缘\n阳性；②DCIS：年龄≤50 岁，或高级别，或切缘边\n距<2mm，或阳性切缘。对符合以下标准的复发风\n险较低的患者，可考虑不行瘤床补量：①浸润性乳\n腺癌：年龄>70 岁、激素受体阳性、低中级别并有\n足够的阴性切缘（边距≥2mm）；②DCIS：年龄>50\n岁、经筛查发现、肿瘤大小≤2.5cm、低中级别、并\n有足够的阴性切缘（边距≥3mm）。对于不符合上\n述标准的患者，医师可以根据患者情况权衡利弊（肿\n瘤控制和美容效果），做出个体化决策。\n（3）照射技术：保乳术后放疗可以通过三维适\n形放疗、固定野或旋转调强等照射技术进行。无论\n采取何种技术，推荐采用CT 定位并勾画靶区，将\nCT 图像导入三维计划治疗系统上进行计划评估，\n以准确评估靶区及危及器官的剂量分布。CT 定位\n时，应采用铅丝标记患侧乳腺外轮廓及乳腺原发灶\n手术瘢痕，以利于确定全乳腺及瘤床补量照射范围。\n呼吸控制技术，如深吸气屏气、俯卧定位等，可能\n进一步降低正常器官，主要是心肺的照射剂量，推\n荐在有条件的单位中开展。\n与二维放疗相比，三维适形及调强照射有助于\n改善靶区内的剂量均匀性，降低正常组织的受照剂\n量，更好地处理乳腺与区域淋巴结照射野的衔接，\n在乳腺体积大、需要进行区域淋巴结照射的情况下\n更有优势，但增加了计划设计的复杂程度。推荐根\n据患者的病情、照射范围及合并症情况等个体化地\n选择照射技术。\n乳腺瘤床补量可采用术中放疗、组织间插植、\n电子线或X 线外照射等方式实现。推荐外科医师在\n肿瘤切缘放置钛夹，为瘤床补量提供参照。\n（4）照射剂量及分割模式：推荐全乳± 区\n域淋巴结的照射剂量为50Gy/2Gy/25f。外照射\n瘤床补量可序贯于全乳放疗后，序贯照射剂量为\n10~16Gy/2Gy/5~8f；在有经验的单位，可以考虑瘤床\n同步加量照射，如瘤床同步照射剂量60Gy/2.4Gy/25f。\n对仅行全乳照射的患者，推荐可给予大分割放疗\n40Gy/15f 或42.5Gy/16f；在有经验的单位，也可\n采用43.5Gy/15f/3w 的分割模式。外照射瘤床补\n量序贯于全乳大分割放疗后，可采用常规分割模式\n10~16Gy/2Gy/5~8f 或大分割模式10~12.5Gy/4~5f；\n在有经验的单位，也可采用大分割序贯补量模式\n8.7Gy/3f。推荐开展针对瘤床同步大分割加量模式的临\n床研究，如瘤床同步照射剂量49.5Gy/15f。\n"}, {"page": 16, "text": "16\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n在有经验的单位，对于行全乳+ 区域淋巴结照\n射的患者，可考虑采用大分割照射模式，照射剂量\n与全乳大分割照射相同。\n（5）部分乳腺照射：数项研究提示，在低危乳\n腺癌保乳术后患者中，部分乳腺照射可能获得与全\n乳照射相同的疗效。目前鼓励患者参加部分乳腺照\n射相关的临床试验；除临床试验外，接受部分乳\n腺照射的患者需要严格选择，在有经验的医疗中\n心结合自身的技术条件和患者意愿有序开展，推\n荐适应症如下：①年龄≥50 岁；②浸润性癌肿瘤\n大小≤3cm（T1、小T2），阴性切缘≥2mm；③单\n纯低- 中级别DCIS、筛查发现、肿瘤大小≤2.5cm、\n阴性切缘≥3mm；④SLNB 或腋窝淋巴结清扫证实为\nN0；⑤单中心病灶；⑥无淋巴血管侵犯；⑦无广泛导\n管内癌成分；⑧未接受新辅助化疗；⑨最好是ER 阳\n性且排除浸润性小叶癌（非必须条件）。\n部分乳腺照射可以通过术中放疗、近距离插植\n或外照射进行。照射范围为乳腺瘤床。推荐的照射\n剂量包括：术中放疗20Gy，单次完成；近距离插植\n34Gy/3.4Gy/10f，每天2 次，间隔至少6 小时，总\n治疗时间5 天，或者其他等效生物分割剂量模式；\n外照射38.5Gy/10f，每天2 次，5 天完成。RAPID\n研究的随访结果提示，外照射这种分割方式进行部\n分乳腺放疗的晚期美容效果相对较差，考虑到国内\n加速器相对不足的实际情况，也可采用38.5Gy/10f\n每天1 次或40Gy/10f 每天1 次的照射模式。\n2. 改良根治术后放射治疗\n（1）适应症：符合以下任一条件的改良根治术\n后患者，应考虑给予术后辅助放疗：①原发肿瘤最\n大直径>5cm，或肿瘤侵及乳腺皮肤、胸壁。②腋\n窝淋巴结转移≥4 个，或存在锁骨上或内乳淋巴结\n转移。③原发肿瘤分期T1~2 且腋窝淋巴结转移\n1~3 个的患者，推荐在改良根治术后接受放射治疗。\n但对其中的无明显高危复发因素，即年龄≥50 岁、\n肿瘤分级Ⅰ~Ⅱ级、无脉管瘤栓、腋窝淋巴结转移数1\n个、激素受体阳性的患者，可考虑省略放疗。④对\n改良根治术前接受新辅助化疗的患者，术后放疗指\n证参见“三、1. 新辅助化疗后术后放射治疗”章节。\n（2）照射范围。\nⅰ需要接受改良根治术后放疗的患者，照射范\n围应包括胸壁及锁骨上下区。\nⅱ内乳照射目前存在争议，推荐具备下列条件\n患者考虑行内乳照射：①腋窝淋巴结清扫术后淋巴\n结转移≥4 个；②原发肿瘤位于内象限或中央区且\n伴有腋窝淋巴结转移；③年龄<35 岁且伴有腋窝淋\n巴结转移；④初诊时影像学诊断内乳淋巴结转移或\n经病理证实内乳淋巴结转移但未行内乳淋巴结清扫。\n内乳照射建议应用现代精准放疗技术，以便准确评\n估心脏等正常组织照射剂量，同时把握全身治疗及\n放疗对心脏相关损伤与内乳预防照射的获益与风险，\n必要时多学科充分沟通，或鼓励患者参加临床试验。\nⅲ对腋窝淋巴结清扫彻底的患者，放疗靶区不\n推荐包括患侧腋窝；对SLNB 后发现淋巴结转移，\n但未行腋窝清扫或腋窝清扫不彻底的患者，放疗靶\n区应考虑包括腋窝。\n（3）照射技术：改良根治术后放疗可以通过二\n维照射、三维适形放疗、固定野或旋转调强等照射\n技术进行。无论采取何种技术，均推荐采用CT 定\n位并勾画靶区及危及器官，将CT 图像导入三维计\n划治疗系统上进行个体化计划评估，以准确评估\n靶区及危及器官的剂量分布。同时，无论采取何\n种照射技术，应注意在胸壁表面增加组织补偿物\n（40%~60% 照射剂量），以确保足够的皮肤剂量。\n可参照传统二维照射方式设计照射野，如：锁\n骨上照射可采用单前野或前后对穿野照射，内乳淋\n巴引流区可采用电子线野照射，但要求锁骨上、内\n乳区90% 的靶体积应达到90% 的照射剂量。胸壁\n可采用切线野或电子线野照射，采用电子线照射时，\n照射范围可参照传统二维布野方式，包全手术疤痕\n和游离皮瓣范围。\n与二维放疗相比，三维适形及调强放疗有助于\n保证靶区达到处方剂量、改善靶区内的剂量均匀性，\n"}, {"page": 17, "text": "17\n第19 卷\n2022 年第10 期\n标准与讨论\n降低正常组织的受照剂量，更好地处理胸壁与区域\n淋巴结照射野的衔接，个体化地治疗患者，但增加\n了计划设计的复杂程度。推荐根据患者的病情、照\n射范围及合并症情况等个体化地选择照射技术。采\n用适形调强放疗时，应准确勾画靶区，确保心肺安\n全，不显著增加其他正常器官，如甲状腺、健侧乳腺、\n患侧肩关节等的受照剂量。\n（4）照射剂量及分割模式：推荐的改良根治术\n后的照射剂量为50Gy/2Gy/25f。在有经验的单位，\n可考虑给予大分割放疗40~43.5Gy/15f/3w。\n（5）放射治疗与全身治疗的时序安排：对于有\n辅助化疗指征的患者，术后放射治疗应该在完成辅\n助化疗后开展；如果无辅助化疗指征，在切口愈合\n良好的前提下，术后8 周内开始放射治疗。辅助赫\n塞汀治疗可以和术后放射治疗同期开展。放射治疗\n开始前，要确认左心室射血分数（left ventricular \nejection fraction，LVEF）大于50%，同时尽可能\n降低心脏的照射剂量，尤其是患侧为左侧。辅助内\n分泌治疗可以与术后放射治疗同期开展。\n3. 特殊情况下的放射治疗\n（1）新辅助化疗后术后放射治疗。\nⅰ新辅助化疗后保乳术后放疗：对于接受新辅\n助化疗降期后行保乳手术的患者，无论治疗反应如\n何，均应行术后全乳+ 瘤床补量放疗。瘤床靶区一\n般根据新辅助化疗后保乳手术的实际切除范围来确\n定，必要时也应参考化疗前临床分期及术后病理分\n期确定（关键是手术前对原发肿瘤退缩情况和方式\n的准确评估，以及阴性切缘的保障）。新辅助化疗术\n后病理淋巴结阳性的所有患者或新辅助化疗前初始\n临床分期为Ⅲ期的患者，术后常规行全乳联合淋巴\n引流区照射。对于初始分期Ⅱ期区域淋巴结阳性的\ncN 1 期患者，在新辅助化疗后达ypN 0 期者，原\n则上仍需行术后全乳联合淋巴引流区照射；临床实\n践中也可以选取一些低危患者予以谨慎地个体化免\n除淋巴引流区照射，如原发灶和腋窝淋巴结新辅助\n化疗后均达pCR，年龄>40 岁，不合并相关病理\n危险因素（如组织学3 级、脉管癌栓、激素受体阴\n性等）。\n新辅助化疗后保乳术后的预防放疗剂量，参照\n前述无新辅助化疗情况。\nⅱ新辅助化疗后改良根治术后放疗：新辅助化\n疗后的辅助放疗决策尚无Ⅲ期随机对照临床试验结\n果可以参考，目前推荐为结合患者新辅助治疗前的\n临床分期和新辅助化疗后的病理分期，结合患者、\n肿瘤特征，进行放疗决策。放疗指征如下：①新辅\n助化疗前初始分期为Ⅲ期及新辅助后腋窝淋巴结阳\n性的患者，推荐术后放疗；②初始临床分期为Ⅱ期\n（cN 1 期），新辅助化疗后术后病理腋窝淋巴结阴\n性，是否行术后放疗存在争议，鼓励患者参加临床\n研究。临床上可选择有高危因素患者行术后放疗：\n年龄≤40 岁、ypT>2cm、脉管瘤栓阳性、预后不\n良的分子亚型（激素受体阴性、HER2 阳性且未行\n靶向治疗）等。\n新辅助化疗后放疗的照射范围、剂量及分割\n模式和未接受新辅助治疗的改良根治术后放疗基\n本相同。初诊局部晚期乳腺癌（locally advanced \nbreast cancer，LABC）新辅助化疗后术后放疗\n时需要注意，明显皮肤受侵或诊断为炎性乳癌的\nLABC，可以考虑在全胸壁照射50Gy 分25 次后，\n对游离皮瓣范围的胸壁给予补量照射10~16Gy；放\n疗时可增加皮肤表面填充物的使用次数，保证皮肤\n剂量充分。初诊时有锁骨上或内乳淋巴结转移的患\n者，在局部区域预防照射后应对原锁骨上或内乳淋\n巴结转移部位加量照射。如果化疗后锁骨上或内乳\n淋巴结达到完全缓解，加量10Gy 分5 次；如果化\n疗后锁骨上或内乳淋巴结仍有残存，加量16~20Gy\n分8~10 次。要求患者初诊基线评估时行CT 检查\n明确最初的淋巴结转移部位，并穿刺明确病理学诊\n断，为后续放疗确定补量照射范围提供参考。\n（2）乳腺重建术后放射治疗：全乳切除术后乳\n房重建患者的放疗指征与相同分期、未做重建的患\n者一样，但在决策时需要额外权衡重建植入物的放\n"}, {"page": 18, "text": "18\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n疗并发症风险以及重建对放疗技术的挑战。自体重\n建组织可以很好地耐受放疗，放疗未增加自体重建\n患者的并发症风险。由于放疗后可能会导致自体植\n入物组织萎缩，可以在手术时将重建乳房体积设计\n略大于对侧乳腺。假体重建的使用逐年上升，放疗\n增加假体包膜挛缩风险，降低美容效果。分阶段重\n建时，放疗介入时机可以在永久假体植入之前或之\n后。在永久假体植入之前放疗，直接照射组织扩张\n器，对后续的假体包膜挛缩影响小，但重建失败率\n增高。在永久假体植入之后放疗，重建失败率低，\n但包膜挛缩并发症增加。此外，放疗介入时机的选\n择还需要考量因植入永久假体手术而导致的放疗延\n迟对肿瘤疗效影响，对复发高危患者最好不要过长\n延迟放疗。在永久假体植入之前放疗的患者，为提\n高重建成功率，放疗定位前需要完成扩张器注水程\n序保证充分的组织扩张，直到放疗结束都不允许往\n扩张器内注入或者抽出盐水，以保证靶区的体积和\n位置始终一致。放疗需要照射同侧胸壁+ 区域淋巴\n引流区，淋巴引流区照射原则同未做重建的患者。\n放疗剂量采用常规分割50Gy 分25 次，5 周完成。\n传统的根治术将会有5%~10% 的腺体残留，皮下组\n织内丰富的淋巴管网是肿瘤转移至腋窝或内乳淋巴\n结的重要途径，这些均是重建术后胸壁放疗的重要\n靶区。因为位置表浅，部分靶区位于剂量建成区，\n放疗计划设计时特别注意，在有摆位误差的情况下，\n照射野包全靶区。根据所使用放疗技术的建成区范\n围，推荐在胸壁皮肤表面垫组织填充物照射10~15\n次，以保证靶区剂量充分。\n（3）局部区域复发后的放射治疗：胸壁和锁骨\n上淋巴引流区是乳腺癌根治术或改良根治术后复发\n最常见的部位。胸壁单个复发原则上手术切除肿瘤\n后进行放射治疗；若手术无法切除，应先进行放射\n治疗。既往未做过放射治疗的患者，放射治疗范围\n应包括全部胸壁和锁骨上/下区域。锁骨上复发的患\n者如既往未进行术后放射治疗，照射靶区需包括患\n侧全胸壁及锁骨上淋巴引流区。如腋窝或内乳淋巴\n结无复发，无需预防性照射腋窝和内乳区。预防部\n位的放射治疗剂量为DT 45~50Gy/25f/5w，复发部\n位缩野补量至DT 60~66Gy/30~33f/6~6.5w。既往\n做过放射治疗的复发患者，需要参考肿瘤复发间隔\n时间、首程放疗的剂量范围和不良反应程度，以及\n再程放疗的可能疗效和不良反应，来决定是否进行\n再程放疗。再程放疗时，仅照射复发肿瘤部位，不\n推荐大范围预防照射。\n局部区域复发患者在治疗前需取得复发灶的细\n胞学或组织学诊断。\n（四）化疗\n1. 乳腺癌辅助化疗\n对患者基本情况（年龄、月经状况、血常规、\n重要器官功能、有无其他疾病等）、肿瘤特点（病理\n类型、分化程度、淋巴结状态、HER2 及激素受体\n状况、有无脉管瘤栓等）、治疗手段（如化疗、内分\n泌治疗、靶向药物治疗等）进行综合分析，医师根\n据治疗的耐受性、术后复发风险、肿瘤分子分型和\n治疗敏感性选择相应治疗，并权衡治疗给患者带来\n的风险- 受益，若接受化疗的患者受益有可能大于\n风险，可进行术后辅助化疗。乳腺癌术后复发风险\n的分层见附件8；乳腺癌分子分型的判定见附件9。\n（1）适应症：①腋窝淋巴结阳性。②对淋巴结\n转移数目较少（1~3 个）的绝经后患者，如果具有\n受体阳性、HER2 阴性、肿瘤较小、肿瘤分级Ⅰ级\n等其他多项预后较好的因素，或者患者无法耐受或\n不适合化疗，也可考虑单用内分泌治疗。③对淋巴\n结阴性乳腺癌，术后辅助化疗只适用于那些具有高\n危复发风险因素的患者（患者年龄<35 岁、肿瘤\n直径>2cm、肿瘤分级Ⅱ~Ⅲ级、脉管瘤栓、HER2\n阳性、ER/PR 阴性等）。\n（2）相对禁忌症：①妊娠期：妊娠早期患者通\n常禁用化疗，妊娠中期患者应慎重选择化疗。②明\n显衰竭或恶病质。③患者拒绝术后辅助化疗。④有\n严重感染、高热、水电解质及酸碱平衡失调的患者。\n⑤胃肠道梗阻或穿孔者。⑥骨髓储备功能低下，治\n"}, {"page": 19, "text": "19\n第19 卷\n2022 年第10 期\n标准与讨论\n疗前白细胞≤3.5×10\n9/L，血小板≤80×10\n9/L 者。\n⑦心血管、肝肾功能损害者。\n（3）辅助化疗方案的选择：常用的辅助化疗方\n案见附件10。\nⅰ常用方案：①以蒽环类为主的方案，如AC\n（多柔比星/环磷酰胺），EC（表柔比星/环磷酰胺）。\n虽然吡柔比星（THP）循证医学证据有限，但在我\n国临床实践中，用吡柔比星代替多柔比星也是可行\n的，THP 推荐剂量为40~50mg/m\n2。②蒽环类与\n紫杉类联合方案，例如TAC（T：多西他赛）。③蒽\n环类与紫杉类序贯方案，例如AC →紫杉醇（每周\n1 次），AC →多西他赛（每3 周1 次），剂量密集\n型AC 续贯紫杉醇（每2 周1 次），剂量密集型AC\n续贯紫杉醇（每周1 次）。④不含蒽环类的联合化疗\n方案：TC 方案（多西他赛/环磷酰胺4 或6 个疗\n程），适用于有一定复发风险的患者。⑤卡培他\n滨的强化（联合或序贯）可考虑在三阴性乳腺癌中\n使用。\nⅱHER2 阳性乳腺癌：常用方案参见乳腺癌术\n后辅助抗HER2 靶向治疗部分中的相应内容。\n（4）注意事项：①早期乳腺癌辅助化疗的目的\n是争取治愈，所以强调标准、规范的化疗。②化疗\n时应注意化疗药物的给药顺序、输注时间和剂量强\n度，严格按照药品说明和配伍禁忌使用。③根据\n患者的复发风险、耐受程度、患者意愿及循证医学\n证据选择化疗方案，并制定预防呕吐、骨髓抑制的\n支持方案。④不同化疗方案的周期数不同，一般为\n4~8 个周期。若无特殊情况，不建议减少周期数和\n剂量。70 岁以上患者需个体化考虑辅助化疗。⑤\n辅助化疗一般不与内分泌治疗或放疗同时进行，化\n疗结束后再开始内分泌治疗，放疗与内分泌治疗可\n先后或同时进行。⑥一般推荐首次给药剂量应按推\n荐剂量使用，若有特殊情况需调整时，通常不低于\n推荐剂量的85%，后续给药剂量应根据患者的具\n体情况和初始治疗后的不良反应，可以1 次下调\n20%~25%。每个辅助化疗方案一般仅允许剂量下调\n2 次。⑦激素受体阴性的绝经前患者，在辅助化疗\n期间可考虑使用卵巢功能抑制药物保护患者的卵巢\n功能。推荐化疗前1~2 周给药，化疗结束后2 周给\n予最后一剂药物。⑧蒽环类药物有心脏毒性，使用\n时须评估LVEF，一般每3 个月1 次。⑨所有化疗\n患者均需要先行签署化疗知情同意书。\n2. 新辅助化疗\n新辅助化疗是指为降低肿瘤临床分期，提高切\n除率和保乳率，在手术或手术加局部放射治疗前，\n首先进行全身化疗。\n（1）适应症：①不可手术降期为可手术，临床\n分期为ⅢA（不含T3、N1、M0）、ⅢB、ⅢC。②\n期望降期保乳患者，临床分期为ⅡA、ⅡB、ⅢA（仅\nT3、N1、M0）期，除了肿瘤大小以外，符合保乳\n手术的其他适应症。对希望缩小肿块、降期保乳的\n患者，也可考虑新辅助治疗。③对不可手术的隐匿\n性乳腺癌行新辅助治疗是可行的（其中隐匿性乳腺\n癌定义为腋窝淋巴结转移为首发症状，而乳房内未\n能找到原发灶的乳腺癌）。\n（2）禁忌症：①未经组织病理学确诊的乳腺\n癌：推荐进行组织病理学诊断，并获得ER、PR、\nHER2 及Ki-67 等免疫组化指标，不推荐将细胞学\n作为病理诊断标准。②妊娠早期女性为绝对禁忌：\n而妊娠中、晚期女性患者应慎重选择新辅助化疗，\n为相对禁忌，国外有成功应用的个案报道。③心血\n管、肝肾功能显著损害者。④原发肿瘤为广泛原位\n癌成分，未能明确浸润癌存在者需谨慎使用。⑤肿\n瘤临床无法触及或无法评估。⑥患者拒绝术前新辅\n助治疗。⑦有严重感染、高热、水电解质及酸碱平\n衡紊乱的患者。⑧骨髓储备不足，治疗前中性粒细\n胞≤1.5×10\n9/L，血小板≤75×10\n9/L 者。\n（3）新辅助化疗方案的选择。\nⅰ对于HR 阳性/HER2 阴性的乳腺癌患者，有\n降期或保乳等需求的，优先推荐辅助化疗提前到新\n辅助阶段。\nⅱ对于HER2 阳性和三阴性乳腺癌患者，可适\n"}, {"page": 20, "text": "20\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n当放宽新辅助治疗适应症，通过新辅助治疗早期评\n价治疗疗效，并通过术后是否病理完全缓解制定升/\n降阶梯辅助治疗。\nⅲ对于HER2 阳性的乳腺癌患者，符合新辅助\n适应症的，应采用含蒽环联合紫杉方案或非蒽环方\n案联合曲妥珠单抗± 帕妥珠单抗进行新辅助治疗。\n加用帕妥珠单抗会进一步提高pCR 率，在HR 阴性、\n淋巴结阳性的患者获益更多。\nⅳ对于三阴性乳腺癌患者，新辅助推荐含蒽环\n类和紫杉类的常规方案。铂类可作为三阴性患者新\n辅助治疗方案的一部分，以增加肿瘤退缩的概率和\npCR 的可能性，但决策加铂类应该权衡潜在的获益\n与伤害，因为未必转化为DFS 的远期获益。单纯\nBRCA1/2 致病或疑似致病性突变，不足以成为选\n择含铂治疗的理由。对于有心脏基础疾患的患者，\n可以考虑单纯紫杉类+ 铂类的新辅助治疗。PD-1/\nPD-L1 抗体在国内尚未获得相关适应症，远期毒性\n和获益未明，不常规推荐在该类患者新辅助治疗中\n添加免疫检查点抑制剂。\n（4）注意事项：①化疗前必须对乳腺原发灶行\n空芯针活检明确组织学诊断及免疫组化检查，区域\n淋巴结转移可以采用细胞学诊断。②明确病理组织\n学诊断后实施新辅助化疗。③不建议Ⅰ期患者选\n择新辅助化疗。④在治疗有反应或疾病稳定的患者\n中，推荐手术前用完所有的既定周期数。⑤应从体\n检和影像学2 个方面评价乳腺原发灶和腋窝淋巴结\n转移灶疗效，按照实体肿瘤疗效评估标准RECIST\n或WHO 标准评价疗效。⑥无效时暂停该化疗方案，\n改用手术、放射治疗或者其他全身治疗措施（更换\n化疗方案或改行新辅助内分泌治疗）。⑦新辅助化疗\n后，即便临床上肿瘤完全消失，也必须接受既定的\n后续手术治疗，根据个体情况选择乳腺癌根治术、\n乳腺癌改良根治术或保留乳房手术。⑧术后辅助化\n疗应根据术前新辅助化疗的周期、疗效及术后病理\n检查结果确定治疗方案。⑨推荐根据化疗前的肿瘤\n临床分期来决定是否需要辅助放疗及放疗范围。\n（5）全身处理：对于新辅助化疗未达到pCR 的\n患者（已完成足疗程的新辅助治疗），尤其是三阴性\n乳腺癌患者，可考虑术后追加6~8 个疗程卡培他滨\n治疗；HER2 阳性患者，优先考虑采用T-DM1 强化\n辅助治疗的方式，也可采用继续完成曲妥珠单抗联\n合帕妥珠单抗共1 年的方式。无论是否达到pCR，\n部分研究显示特定人群奈拉替尼延长治疗1 年可进\n一步降低复发风险。对于HR 阳性的患者，需要给\n予内分泌治疗，内分泌治疗是否需要强化，以及强\n化的方式可主要依据患者新辅助前的状态进行评估。\n3. 晚期乳腺癌化疗\n晚期乳腺癌的主要治疗目的不是治愈患者，而\n是提高患者生活质量、延长患者生存时间。治疗手\n段以化疗和内分泌治疗为主，必要时考虑手术或放\n射治疗等其他治疗方式。根据原发肿瘤特点、既往\n治疗、无病生存期、转移部位、进展速度、患者状\n态等多方面因素，因时制宜、因人制宜，选择合适\n的综合治疗手段，个体化用药。\n有转移或复发表现的乳腺癌患者的分期评估检\n查包括病史、体格检查、实验室检查、胸部X 线或\nCT、腹部超声、骨显像等。对疼痛或骨显像异常患\n者行骨的放射学检查，还可考虑腹部诊断性CT 或\nMRI、头颅CT 或MRI。通常不建议使用PET-CT\n对患者进行评估，在其他检查结果不确定或可疑时\nPET-CT 是可选择的。肿瘤转移灶或第一复发灶的\n活检应作为晚期乳腺癌患者病情评估的一部分，同\n时检测ER、PR、HER2、Ki-67 等分子标志物，以\n制订针对性治疗方案。\n（1）符合下列某一条件的患者可考虑化疗：\n①ER/PR 阴性或低表达。②内脏危象或有症状的内\n脏转移。③ER/PR 阳性内分泌治疗耐药者（特别是\n原发性耐药）。\n（2）化疗药物与方案：晚期乳腺癌常用化疗方\n案见附件11。\n晚期乳腺癌常用的化疗药物包括蒽环类、紫杉\n类、长春瑞滨、卡培他滨、吉西他滨、铂类等。应\n"}, {"page": 21, "text": "21\n第19 卷\n2022 年第10 期\n标准与讨论\n根据疾病的范围、肿瘤的分子特征、既往治疗及患\n者的特点来制订个体化的化疗方案。制订方案时应\n充分考虑患者的意愿，疾病的不可治愈性，平衡生\n活质量和生存期。在疾病发展的不同阶段合理选择\n单药或联合化疗。\nⅰ单药化疗：对肿瘤发展相对较慢，肿瘤负荷\n不大，无明显症状，特别是老年耐受性较差的患者\n优选单药化疗。\n蒽环类（紫杉类）治疗失败的常用定义为使\n用蒽环类（紫杉类）解救化疗过程中发生疾病进展，\n或辅助治疗结束后12 个月内发生复发转移。对于\n既往蒽环类治疗失败的患者，通常首选以紫杉类\n（如紫杉醇、多西他赛及白蛋白结合型紫杉醇）为\n基础的单药或联合方案；对于既往蒽环类和紫杉类\n治疗均失败的患者，目前尚无标准化疗方案，可考\n虑其他单药或联合方案。\n常用的单药包括：蒽环类，如多柔比星、表柔\n比星、吡柔比星及聚乙二醇化脂质体多柔比星；紫\n杉类，如紫杉醇、多西他赛、白蛋白结合型紫杉醇；\n抗代谢药如卡培他滨、吉西他滨等；非紫杉类微管\n形成抑制剂，如长春瑞滨、艾立布林、优替德隆等；\n依托泊苷胶囊、环磷酰胺片等口服方便，可以作为\n后线治疗的选择。\nⅱ联合化疗：适合病情进展较快，肿瘤负荷较大\n或症状明显的患者。联合化疗方案的选择多种多样，\n主要基于既往循证医学的证据、联合药物之间的相互\n作用、联合药物的毒性谱、患者的个体状态来综合制\n定，不推荐联合三种或三种以上的化疗药物。\n①对于三阴性乳腺癌，可选择GP 方案（吉西\n他滨联合顺铂）、GC 方案（吉西他滨联合卡铂）、\nAP 方案（白蛋白紫杉醇联合顺铂/卡铂）、PC 方案\n（其他紫杉类药物联合卡铂/顺铂）。②单药或联合化\n疗均可在循证证据支持下联合靶向治疗。③联合化\n疗时，是采用持续方式还是4~8 个疗程后停药或维\n持治疗需权衡疗效、药物不良反应和患者生活质量。\n④对多程化疗失败的患者无标准治疗，鼓励患者参\n加新药临床试验或对症支持治疗。对于三阴性乳腺\n癌，sacituzumab govitecan 是一种重要的靶向治\n疗选择，已获得美国FDA 批准，但尚在中国开展\n临床研究。⑤对HER2 阳性患者，化疗同时应联合\n抗HER2 靶向药物。\nⅲ维持化疗：对完成了4~6 周期化疗，治疗有\n效、耐受性较好的患者，可以持续治疗至病情进展\n或出现不能耐受的毒性。联合化疗有效但不能耐受\n或无意愿继续联合化疗者可考虑维持治疗，可选择\n原先联合方案中的一个单药化疗维持，激素受体阳\n性者还可考虑内分泌± 靶向治疗维持。维持治疗中\n应该加强患者管理，定期评估疗效和不良反应。\n（五）内分泌治疗\n1. 辅助内分泌治疗\n（1）适应症。\nⅰ激素受体ER 和/或PR 阳性的浸润性乳腺\n癌患者，皆应接受术后辅助内分泌治疗。依据最新\nASCO/CAP 指南，尽管ER 免疫组织化学染色为\n1%~100% 的肿瘤皆被视为ER 阳性，但ER 免疫\n组织化学染色为1%~10% 为ER 低表达。ER 低表\n达的生物学行为通常与ER 阴性乳腺癌相似，在术\n后辅助内分泌中的获益较少，在做治疗决策时也应\n当考虑到这一点。\nⅱ原位癌患者如出现以下情况可考虑行5 年内\n分泌治疗：①保乳手术后需要放疗患者，特别是其\n中激素受体阳性的DCIS；②仅行局部切除DCIS 患\n者；③行乳腺全切患者，用于预防对侧乳腺癌发生。\n（2）禁忌症：①使用内分泌药物有禁忌的患者：\n有深部静脉血栓或肺栓塞史者。②严重肝肾功能损\n伤者慎用。③孕妇及既往应用内分泌治疗药物过\n敏者。\n（3）药物选择：①绝经前患者辅助内分泌治疗\n首选他莫昔芬。②对于中高复发风险的绝经前患者\n（具体需综合考量年龄、肿块大小、淋巴结状态、组\n织学分级、Ki-67 增殖指数等，具体可参见《中国\n早期乳腺癌卵巢功能抑制临床应用专家共识（2018\n"}, {"page": 22, "text": "22\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n年版）》）推荐在辅助内分泌治疗中应用卵巢抑制剂。\n对于年轻的（<35 岁）的乳腺癌患者，更推荐卵巢\n功能抑制加芳香化酶抑制剂。他莫昔芬或芳香化酶\n抑制剂加卵巢切除或卵巢抑制治疗5 年。③他莫昔\n芬治疗期间，如果患者已经绝经，可以换用芳香化\n酶抑制剂。④绝经后患者优先选择第三代芳香化酶\n抑制剂，建议起始使用。⑤不能耐受芳香化酶抑制\n剂的绝经后患者，仍可选择他莫昔芬。\n（4）注意事项。\nⅰ患者应在化疗之前进行激素水平的测定，判\n断月经状态，绝经定义见附件12。\nⅱ术后辅助内分泌治疗的治疗期限为5 年，延\n长内分泌治疗需要根据患者的具体情况个体化处理，\n需要结合肿瘤复发的高危因素和患者的意愿综合决\n策；对于高危绝经前患者，若在他莫昔芬治疗满5\n年后患者仍未绝经，可以根据情况增加至10 年，\n如果患者在治疗过程中绝经，可考虑延长芳香化酶\n抑制剂治疗，直至完成10 年的内分泌治疗。\nⅲ辅助内分泌治疗（促黄体素释放激素激动剂\n除外）不建议与辅助化疗同时使用，一般在化疗之\n后使用，可以和放疗及曲妥珠单抗治疗同时使用。\nⅳER 和PR 阴性的患者，不推荐进行辅助内\n分泌治疗。\nⅴ内分泌治疗中常见不良反应的监测和管理：\n①在应用他莫昔芬过程中应注意避孕，需要对子宫\n内膜进行超声监测，每6~12 个月进行1 次妇科检\n查。②对于应用芳香化酶抑制剂患者应监测骨密度\n和补充钙剂及维生素D。对于严重骨质疏松患者可\n进行正规抗骨质疏松治疗。③患者在接受芳香化酶\n抑制剂治疗期间应监测血脂，必要时应给予血脂异\n常患者相应的治疗。对于在内分泌治疗中严重的不\n良反应需要考虑停药或者更换治疗方案。\n2. 晚期乳腺癌的内分泌治疗\n（1）首选内分泌治疗的适应症：①患者年龄>35\n岁。②无病生存期>2 年（联合部分靶向药物时可适\n当突破该界限）。③仅有骨和软组织转移。④无症状\n的内脏转移。⑤ER 和/或PR 阳性。⑥受体不明或\n受体为阴性的患者，如临床病程发展缓慢，也可以试\n用内分泌治疗。\n（2）药物选择。\nⅰ绝经后患者的内分泌治疗推荐：芳香化酶抑\n制剂包括非甾体类（阿那曲唑和来曲唑）、甾体类\n（依西美坦）、ER 调变剂（他莫昔芬和托瑞米芬）、\nER 下调剂（氟维司群）、孕酮类药物（甲地孕酮）、\n雄激素（氟甲睾酮）及大剂量雌激素（乙炔基雌\n二醇）。\nⅱ绝经前患者内分泌治疗推荐：在卵巢功能抑\n制基础上（主要是使用促黄体素释放激素激动剂和\n手术去势），可参照绝经后乳腺癌处理。未行卵巢功\n能抑制的，可考虑ER 调变剂（他莫昔芬和托瑞米\n芬）、孕酮类药物（甲地孕酮）、雄激素（氟甲睾酮）\n及大剂量雌激素（乙炔基雌二醇）。\nⅲ绝经前和绝经后患者均可考虑在内分泌治疗\n的基础上联合靶向治疗（CDK4/6 抑制剂、HDAC\n抑制剂等）。\n（3）晚期乳腺癌一线内分泌治疗的选择。\nⅰ芳香化酶抑制剂联合CDK4/6 抑制剂（哌柏\n西利、阿贝西利）是HR 阳性/HER2 阴性绝经后（自\n然绝经或手术去势）或绝经前但经药物去势后乳腺\n癌患者一线内分泌治疗的优先选择。\nⅱ当CDK4/6 抑制剂不可及时，单药内分\n泌治疗也是可行的；绝经后（自然绝经或手术\n去势）患者可使用氟维司群、芳香化酶抑制剂\n（Aromatase Inhibitor，AI）、雌激素受体（Estrogen \nReceptor，ER）调变剂（他莫昔芬和托瑞米芬）；绝\n经前患者可使用卵巢功能抑制（Ovarian Function \nSuppression，OFS）联合氟维司群、OFS 联合\nAI、OFS 联合ER 调变剂、单纯ER 调变剂。\nⅲ绝经前患者在使用卵巢功能抑制剂后，可按\n照绝经后模式处理。\n（4）晚期乳腺癌二线内分泌治疗的选择：一线\n内分泌治疗失败后，非内脏危象的患者仍然可以选\n"}, {"page": 23, "text": "23\n第19 卷\n2022 年第10 期\n标准与讨论\n择二线内分泌治疗± 靶向治疗。不推荐重复使用辅\n助治疗或一线治疗已被证明耐药的内分泌药物。\nⅰ对于尚未使用过CDK4/6 抑制剂的患者：①\n氟维司群联合CDK4/6 抑制剂（哌柏西利、阿贝\n西利）是HR 阳性/HER2 阴性绝经后（自然绝经\n或手术去势）或绝经前但经药物去势后乳腺癌患\n者二线内分泌治疗的优先选择。②甾体/非甾体芳\n香化酶抑制剂（±OFS）或他莫昔芬（±OFS）联\n合CDK4/6 抑制剂亦可选用。对于已经使用过\nCDK4/6 抑制剂的患者，目前并无充分证据支持\nCDK4/6 抑制剂的跨线治疗。\nⅱ当以上联合的小分子靶向药物不可及时，单\n药内分泌治疗也是可行的；绝经后（自然绝经或手\n术去势）患者可使用氟维司群、AI、ER 调变剂（他\n莫昔芬和托瑞米芬）；绝经前患者可使用OFS 联合\n氟维司群、OFS 联合AI、OFS 联合ER 调变剂、\n单纯ER 调变剂。\n（3）注意事项：①连续两线内分泌治疗后肿瘤\n进展，通常提示内分泌治疗耐药，应该换用细胞毒\n药物治疗或进入临床试验研究。②在内分泌治疗期\n间，应每2~3 个月评估1 次疗效，对达到治疗有效\n或疾病稳定患者应继续给予原内分泌药物维持治疗，\n如肿瘤出现进展，应根据病情决定更换其他机制的\n内分泌治疗药物或改用化疗等其他治疗手段。\n（六）靶向治疗\n目前，针对HER2 阳性的乳腺癌患者可进行靶\n向治疗，国内主要药物是曲妥珠单抗、帕妥珠单抗、\n吡咯替尼、T-DM1、拉帕替尼等。\n1.HER2 阳性的定义\n（1）HER2 基因扩增：免疫组化染色3+、FISH\n阳性或者色素原位杂交法（CISH）阳性。\n（2）HER2 免疫组化染色（2+）的患者，需进\n一步行FISH 或CISH 检测HER2 基因是否扩增。\n⒉注意事项\n（1）治疗前必须获得HER2 阳性的病理学证据。\n（2）曲妥珠单克隆抗体6mg/kg（首剂8mg/kg）\n每3 周方案，或2mg/kg（首剂4mg/kg）每周方案。\n（3）首次治疗后观察4~8 个小时。\n（4）一般不与阿霉素化疗同期使用，但可以序\n贯使用。\n（5）与非蒽环类化疗、内分泌治疗及放射治疗\n可同期应用。\n（6）曲妥珠单克隆抗体开始治疗前应检测\nLVEF，使用期间每3 个月监测1 次LVEF。治疗\n中若出现LVEF<45% 或低于治疗前16% 以上，应\n暂停治疗，并跟踪监测LVEF 动态变化，直至恢复\n到45% 以上方可继续用药。若不恢复，或继续恶化\n或出现心力衰竭症状则应当终止曲妥珠单抗治疗。\n3. 术后辅助靶向治疗\n（1）适应症：①原发浸润灶>1cm（T1c 及以上）\n的HER2 阳性乳腺癌患者推荐使用曲妥珠单抗。②\n原发浸润灶在0.6~1cm 的HER2 阳性淋巴结阴性\n乳腺癌患者（T1bN0）及肿瘤更小、但腋窝淋巴结\n有微转移的患者（pN1mi）可推荐使用曲妥珠单抗。\n③原发浸润灶<0.5cm（T1a）的HER2 阳性淋巴\n结阴性乳腺癌患者一般不推荐使用曲妥珠单抗，但\n伴有高危因素的患者，例如激素受体阴性、分级较\n高、Ki-67 高等可以考虑使用。\n（2）相对禁忌症：①治疗前LVEF<40%。②患\n者拒绝术后辅助靶向治疗。\n（3）治疗方案选择：常用治疗方案见附件13。\n①可选择TCH（P）、AC-TH（P）方案，对于心\n脏安全要求较高的患者可选择TCH、TC4H（此\n处C 为CTX）和wPH 治疗方案；对于高危复发风\n险患者（如淋巴结阳性）的患者，推荐曲妥珠单抗\n与帕妥珠单抗双靶向治疗联合辅助化疗，其中帕妥\n珠单抗，3 周1 次，剂量为420mg（首次剂量为\n840mg），共1 年；如ER+，亦可考虑在曲妥珠单\n抗治疗结束后，给予1 年的奈拉替尼强化。②小肿\n瘤患者（肿瘤直径≤1cm）可以选择紫杉醇周疗加\n曲妥珠单抗（wPH）方案治疗。\n（4）注意事项：①与蒽环类药物同期应用必须\n"}, {"page": 24, "text": "24\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n慎重，但可以在前、后阶段序贯应用。与非蒽环类\n药物化疗、内分泌治疗或放疗都可同期应用。②目\n前曲妥珠单克隆抗体辅助治疗期限仍为1 年。\n4. 术前新辅助靶向治疗\nHER2 阳性乳腺癌对抗HER2 靶向治疗敏感\n性高，在这部分患者的新辅助治疗方案中应包含抗\nHER2 靶向治疗。\n（1）新辅助靶向治疗药物的选择与原则：①曲\n妥珠单抗、帕妥珠单抗双靶向是目前新辅助靶向治\n疗的首选治疗策略。②对于HER2 阳性的乳腺癌患\n者，符合新辅助适应症的，应采用含蒽环联合紫杉\n方案或非蒽环方案联合曲妥珠单抗± 帕妥珠单抗进\n行新辅助治疗。③在新辅助靶向治疗中加入帕妥珠\n单抗可以进一步提高病理完全缓解率，在HR 阴性、\n淋巴结阳性的患者获益更多。④有蒽环类药物使用\n禁忌、高龄或其他心脏疾病隐患的患者可以使用不\n含蒽环方案如TCH（P）方案。\n（2）注意事项：①新辅助治疗期间应严密监测\n疗效，按照RECIST 或WHO 标准评价原发灶和/\n或淋巴结的疗效，应用曲妥珠单抗治疗期间进展的\n患者在后续新辅助治疗中可考虑保留曲妥珠单抗。\n②接受新辅助靶向治疗的患者辅助阶段应补足辅助\n曲妥珠单抗± 帕妥珠单抗治疗至1 年。③对未达\n到pCR 的HER2 阳性患者，优先考虑采用T-DM1\n强化辅助治疗的方式，也可采用继续完成曲妥珠单\n抗联合帕妥珠单抗共1 年的方式。无论是否达到\npCR，部分研究显示特定人群奈拉替尼延长治疗1\n年可进一步降低复发风险。④单独新辅助靶向治疗\n或与内分泌治疗联用尚缺乏足够的证据，应用应限\n制于临床研究。\n5. 晚期HER2 阳性乳腺癌的靶向治疗选择\n持续的抗HER2 治疗是HER2 阳性晚期乳腺\n癌重要的治疗原则，常用治疗方案见附件14。\n（1）HER2 阳性晚期肿瘤的一线治疗选择。\nⅰ首选曲妥珠单抗、帕妥珠单抗双靶向治疗联\n合紫杉类药物。其他可选方案包括曲妥珠单抗单靶\n联合紫杉类药物，曲妥珠单抗也可联合长春瑞滨、\n卡培他滨等其他化疗药物。\nⅱ对于未使用过曲妥珠单抗或符合曲妥珠单抗\n再使用条件（曲妥珠单抗辅助治疗结束后超过1 年\n以上复发转移的）的患者，应首选以曲妥珠单抗±\n帕妥珠单抗为基础的一线治疗。而停用曲妥珠单抗\n至复发间隔时间≤6~12 个月患者则建议选用二线抗\nHER2 方案治疗。\nⅲ对于HER2 阳性/HR 阳性的患者，如不适合\n化疗或病情进展缓慢者可以考虑抗HER2 治疗联合\n内分泌药物作为一线治疗选择。\n（2）经曲妥珠单抗± 帕妥珠单抗治疗后疾病\n进展的治疗选择。\nⅰ曲妥珠单抗治疗病情进展后，仍应持续使用\n抗HER2 靶向治疗。\nⅱ当一线治疗后病情进展时可选择以下治疗策\n略：①对于曲妥珠单抗± 帕妥珠单抗治疗失败患者，\n单药恩美曲妥珠单抗（trastuzumab emtansine，\nT-DM1）可延长无进展生存时间和总生存时间。②\n吡咯替尼联合卡培他滨较拉帕替尼联合卡培他滨可\n延长无进展生存时间。③其他抗HER2 靶向药物：\n伊尼妥单抗联合长春瑞滨等化疗也可作为曲妥珠单\n抗非耐药患者的抗HER2 治疗选择之一。单纯两种\n靶向药物的联合（如拉帕替尼联合曲妥珠单抗）也\n有证据改善OS。④曲妥珠单抗允许进行跨线治疗。\n⑤多线抗HER2 治疗失败，无法获得进一步治疗\n的，建议参加临床研究。\n（3）注意事项。①曲妥珠单抗、帕妥珠单抗：治\n疗前LVEF<50%。应用前应进行心功能基线评估，\n对于心血管事件高危人群应尽量避免使用。②同时\n进行蒽环类药物化疗。应尽量避免同时使用蒽环类\n等具有协同损害效应的药物。③治疗过程中应定期\n进行心功能评估，若LVEF 较基线下降≥15% 或\n低于正常范围且下降≥10%，应暂停抗HER2 治疗，\n于3~4 周内复查LVEF，再次评估是否能继续抗\nHER2 治疗。④T-DM1：基线及用药期间应行血\n"}, {"page": 25, "text": "25\n第19 卷\n2022 年第10 期\n标准与讨论\n小板规范监测，若出现血小板减少应及时减量或停\n药。出现2 级及以上血小板减少时应警惕发展为持\n续性血小板减少症的可能，若常规升血小板治疗效\n果不佳，应及时请专科医师会诊并处理。⑤吡咯替\n尼：用药前应针对腹泻等不良反应及管理方案进行\n患者教育，用药期间应对腹泻进行监测和管理。\n（七）中医治疗\n中医药有助于减轻放疗、化疗、内分泌治疗的\n副作用和不良反应，调节患者免疫功能和体质状况，\n改善癌症相关症状和生活质量，可能延长生存期，\n可以作为乳腺癌治疗的重要辅助手段。\n内伤情志、痰瘀互结、正气亏虚是乳腺癌的主\n要病因、病机，疏肝解郁、化痰散瘀、调补气血、\n滋补肝肾是相应主要治法。在辨证论治法则基础上，\n采用中药汤剂治疗是中医治疗的主要方式。此外，\n秉承中医外科治疗思想，以“阴证”“阳证”论治乳\n腺癌是临床常用方法。小金丸和西黄丸是治疗乳腺\n癌“阴证”“阳证”的代表性中成药，临床中得到广\n泛应用。在中医师指导下正确使用中成药，患者的\n安全性和耐受性均较好。\n六、诊疗流程\n（一）诊断流程\n定期随访\n手术切除或随访\n切除或穿刺活检\n（如诊断恶性）\n随访\n乳腺增生\n手术切除或随访\n治疗\n切除或穿刺活检\n（如诊断恶性）\n治疗\n良性病变\n不能确定\n恶性病灶\n未见阳性征象\n良性病灶征象\n可疑或具有恶性\n征象\n钙化灶\n手术活检\n乳头溢液\n乳腺X 线摄影\n转有条件医院\n进行\n有条件医院可根据B1-RADS 分类\n处理或转上级医院进一步确诊\n乳头溢液细胞学涂片（查找癌细胞）\n乳管内镜检查（明确诊断，决定治疗方案）\n诊断\n流程\n乳腺\n门诊\n或筛\n查发\n现异\n常\n乳腺彩超\n"}, {"page": 26, "text": "26\n中国合理用药探索\nCHINESE JOURNAL OF RATIONAL DRUG USE\n标准与讨论\n（二）治疗流程\n七、随访\n（一）临床体检：最初2 年每4~6 个月1 次，\n其后3 年每6 个月1 次，5 年后每年1 次。\n（二）乳腺超声：每6 个月1 次。\n（三）乳腺X 线摄影：每年1 次。\n（四）X 线胸片或胸部CT：每年1 次。\n（五）腹部超声：每6 个月1 次，3 年后改为每\n年1 次。\n（六）存在腋窝淋巴结转移4 个以上等高危因\n素的患者，行基线骨显像检查，全身骨显像每年1\n次，5 年后可改为每2 年1 次。\n（七）血常规、血液生化、乳腺癌标志物的检测\n每6 个月1 次，3 年后每年1 次。\n（八）应用他莫昔芬的患者每年进行1 次盆腔\n检查。\n附件：\n1. 乳腺影像学诊断报告基本指南\n2. 乳腺癌的组织学分型\n3. 乳腺浸润性癌组织学分级\n4. 乳腺癌的pTNM 分期（AJCC 第8 版）\n5. 乳腺癌病理报告内容及基本格式\n6. 乳腺癌HER2/neu FISH 检测报告基本格式\n7. 保留乳房手术后美容效果评价标准\n8. 乳腺癌术后复发风险的评估\n9. 乳腺癌分子分型\n10. 常用的辅助化疗方案\n11. 晚期乳腺癌常用化疗方案\n12. 绝经的定义\n13. 术后辅助靶向治疗常用治疗方案\n14. 晚期HER2 阳性乳腺癌的靶向治疗常用治\n疗方案\n15. 乳腺癌诊疗指南（2022 年版）编写审定专\n家组\n浸润性癌\n三苯氧胺（5 年）+ 定期随诊，或行\n乳房切除（降低风险）± 乳房重建\n原位癌\n分叶状肿瘤\n晚期乳腺癌\n（Ⅳ期）\n局部晚期乳腺癌\n（Ⅲ期）\n新辅助治疗\n全乳房切除± 前哨淋巴结活检± 乳\n房重建\n肿瘤扩大切除+ 放疗\n改良根治术± 化疗± 内分泌治疗±\n靶向治疗\n保乳手术+ 放疗± 化疗± 内分泌治\n疗± 靶向治疗\n手术+ 放疗± 化疗± 内分泌治疗\n± 靶向治疗\n化疗或内分泌为主的综合治疗\n广泛切除、定期随访（不行腋窝淋巴\n结清扫）\n治疗\n流程\n可手术乳腺癌\n（Ⅰ、Ⅱ期）\n导管原位癌\n小叶原位癌\n附件请扫描二维码\n"}]}