{"doc_id": "pdf:91cb183d1a6c6c62", "source": "zh", "lang": "zh", "pdf_path": "data/raw/zh/pdf/中国胰腺癌诊治指南（2021）_杨尹默.pdf", "meta": {"doc_id": "pdf:91cb183d1a6c6c62", "source": "local_pdf", "title": "中国实用外科杂志2021年7 月第41 卷第7 期", "title_from": "pdf_meta|first_page|filename", "language": "zh", "sha256": "91cb183d1a6c6c6223facecf0fad4e3ef231e3b1870e88d785b121cab9e63b3b", "file_name": "中国胰腺癌诊治指南（2021）_杨尹默.pdf", "page_count": 14, "pdf_metadata": {"format": "PDF 1.6", "title": "", "author": "CNKI", "subject": "", "keywords": "", "creator": "ReaderEx_DIS 2.3.0 Build 4002", "producer": "TTKN", "creationDate": "D:20221203220755-08'00'", "modDate": "", "trapped": "", "encryption": null}, "created_at": "2026-02-18T05:22:54.921997+00:00", "status": "ok"}, "pages": [{"page": 1, "text": "中国实用外科杂志2021年7 月第41 卷第7 期\n通信作者：赵玉沛，E-mail：zhao8028@263.net\n指南与共识\nDOI:10.19538/j.cjps.issn1005-2208.2021.07.02\n中国胰腺癌诊治指南（2021）\n中华医学会外科学分会胰腺外科学组\nGuidelines for the diagnosis and treatment of pancreatic\ncancer in China（2021）\nChinese\nPancreatic Surgery\nAssociation，Chinese Society of Surgery, Chinese Medical\nAssociation\nCorresponding author：ZHAO Yu-pei，E-mail：zhao8028@263.\nnet\nKeywords\npancreatic\nneoplasms；diagnosis；treatment；\nmultidisciplinary team；guideline\n【关键词】胰腺肿瘤；诊断；治疗；多学科综合治疗协作\n组；指南\n中图分类号：R6\n文献标志码：A\n胰腺癌的发病率在世界范围内呈持续上升态势。\n2021 年统计数据显示，在美国所有恶性肿瘤中，胰腺癌新\n发病例男性居第10 位，女性居第9 位，占恶性肿瘤相关病\n死率的第4 位\n［1］。中国国家癌症中心2017 年统计数据显\n示，胰腺癌位列我国男性恶性肿瘤发病率的第7位，女性第\n11 位，占恶性肿瘤相关病死率的第6 位\n［2］。作为预后极差\n的消化道肿瘤，胰腺癌具有早期诊断困难、手术切除率低、\n术后易复发转移等临床特点，临床诊治极具挑战性。为规\n范我国胰腺癌的临床诊疗行为，提高多学科协作特别是外\n科诊治水平，体现近年来胰腺癌诊治理念的更新，促进学\n科发展，中华医学会外科学分会胰腺外科学组对《胰腺癌\n诊治指南（2014）》进行修订，以循证为基础，以问题为导\n向，通过对近年文献的复习总结并结合临床经验，对胰腺\n癌临床诊治的若干热点问题逐一评述并提出推荐意见，以\n更好地为临床诊治策略及路径选择提供参考和指导。\n本指南依据GRADE 分级系统进行证据质量评估及推\n荐强度分级，证据等级分为高、中、低三级，推荐强度分为\n强烈推荐和一般性推荐\n［3］。本指南仅适用于胰腺导管上皮\n来源的恶性肿瘤，即胰腺癌。\n建议在较大规模的中心并由多学科综合治疗协作组\n（multidisciplinary team，MDT）进行胰腺癌的诊治，由外科、\n影像科、内镜科、病理科、肿瘤内科、介入科、放疗科等专业\n的医师参与，并贯穿病人诊治的全部过程。根据病人的基\n础健康状况、临床症状、肿瘤分期及病理学类型，共同制定\n个体化诊疗计划，使病人获得最佳的治疗效果。\n1\n胰腺癌的诊断\n1.1\n临床表现及高危因素\n根据肿瘤部位、大小、受累器\n官及其严重程度，胰腺癌病人的临床表现包括上腹或背部\n疼痛、恶心、腹胀、黄疸、新发糖尿病、体重减轻及大便性状\n改变等，偶见以急性胰腺炎为主要表现的病人。上述症状\n均无特异性，部分病人亦可无任何临床症状，体检时偶然\n发现胰腺占位性病变。\n与胰腺癌发生相关的危险因素有肥胖、2 型糖尿病及\n吸烟等。5%～10%的胰腺癌病人具有遗传易感基因（表\n1）\n［4］。\n据中国胰腺疾病大数据中心（China Pancreas Data\nCenter，CPDC）的统计，近5 年来在国内较大规模的胰腺疾\n病诊治中心接受手术切除的10 000 余例胰腺癌病人中，华\n东地区占比最高。男性占近60%，60～74 岁病人占53%，\n具吸烟史者占27%，具酗酒史者占17%。其中有家族史者\n仅占1%，低于国外文献报告。\n推荐意见1：胰腺癌无特异性临床表现，对于合并遗传\n易感基因的病人，应定期进行胰腺癌筛查。（证据等级：高；\n推荐强度：强烈推荐）\n1.2\n血清肿瘤标记物在胰腺癌诊断及疗效评估中的意义\n血清CA19-9 是目前最常用的胰腺癌诊断标记物，其诊\n断胰腺癌的敏感度为79%～81%，特异度为82%～90%。\n由于CA19-9 在胆道梗阻及感染状态下亦可异常升高，故\n应在黄疸缓解、炎症控制后再对其进行基线检测。血清\nCA19-9 水平可在一定程度上反映肿瘤负荷或提示有微转\n移灶的可能\n［5］。除诊断意义外，CA19-9 还有助于评估预后\n及疗效\n［6］。胰腺癌病人术后血清CA19-9 水平升高虽可提\n示复发或转移，但仍应结合影像学证据等进行综合判断。\n约10%的胰腺癌病人为Lewis抗原阴性血型结构，此类\n病人不表达CA19-9，须结合其他肿瘤标记物协助诊断。癌\n胚抗原诊断胰腺癌的特异度与CA19-9 类似，但敏感度仅\n为44.2%。CA125 升高与胰腺癌术后早期远处转移相关，\n一定程度上反映出肿瘤转移潜能及其相关负荷，特别对\nCA19-9表达阴性的胰腺癌病人，CA125具有一定的预后评\n估价值\n［7- 8］。其他临床常用的肿瘤标记物还有CA50、\nCA242、CA724 等，联合应用有助于提高诊断敏感度和特异\n度，但仍需高级别证据支持。\n除血清肿瘤标记物外，基于其他生物靶点的液体活检\n技术在胰腺癌的诊断及疗效评估中显现出潜在应用前景，\n包括循环肿瘤DNA、循环肿瘤细胞及外泌体检测等。液体\n·\n·725\n"}, {"page": 2, "text": "中国实用外科杂志2021 年7 月第41 卷第7 期\n活检技术有望成为胰腺癌早期诊断、预后评估、术后复发\n转移监测及疗效评价的重要生物学标记物，但其普及应用\n仍需高质量的临床研究予以验证。\n推荐意见2：动态监测CA19-9 等血清肿瘤学标记物，\n有助于胰腺癌诊断、预后评估、术后复发转移监测及疗效\n评价等。（证据等级：高；推荐强度：强烈推荐）\n1.3\n影像学技术在胰腺癌诊治中的应用\n影像学检查是\n临床诊断胰腺癌的最重要依据，其在胰腺癌术前分期和可\n切除性评估、新辅助治疗或转化治疗后效果评价、治疗后\n监测及随访等方面均具有重要价值。对于拟行胆管支架\n置入减黄的病人，建议在支架置入前完成影像学检查，以\n免支架对病灶及其周围解剖结构的影像产生干扰。\n常用的影像学检查方法有多期增强CT 和动态增强\nMRI。多期增强CT是目前诊断胰腺癌的首选检查方法，CT\n薄层重建能清晰显示胰腺肿瘤大小、位置、密度及血供情\n况，并依此判断肿瘤与周围血管及器官的毗邻关系，评估\n肿瘤的可切除性及新辅助治疗的效果。MRI除可显示胰腺\n肿瘤解剖学特征外，结合肝细胞特异性对比剂和扩散加权\n成像（diffusion weighted imaging，DWI）对诊断肝脏转移病灶\n更具优势；对于病灶与正常胰腺实质密度相近、胰腺高密\n度囊性病变、肿瘤继发胰腺炎或肿块型胰腺炎等影像学表\n现不典型的病人，MRI多序列多参数成像有助于鉴别诊断，\n可作为CT 检查的重要补充\n［9］。联合应用磁共振胰胆管造\n影与MRI 薄层动态增强检查，有助于鉴别胰腺囊实性病\n变，并进一步明确胰胆管的扩张及受累情况。\nPET-CT 和PET-MRI 可显示肿瘤的代谢活性及其负\n荷，可作为胰腺CT或MRI检查的补充，在发现胰腺外转移、\n评价全身肿瘤负荷方面具有优势。对于存在胰腺外转移\n高危因素（如病灶交界可切除、CA19-9水平明显升高、原发\n肿瘤增大、区域淋巴结体积较大）或需要鉴别肿瘤性质的\n病人，建议术前行PET-CT检查以评价全身情况。\n推荐意见3：首选多期增强薄层CT（≤1 mm）用于胰腺\n癌的术前诊断及分期。对于部分诊断存疑特别是怀疑肝\n脏转移的病人，建议通过动态增强MRI 进一步评估。（证据\n等级：高；推荐强度：强烈推荐）\n推荐意见4：对于拟行胆管支架置入减黄的病人，建议\n在支架置入术前完成影像学检查。（证据等级：中；推荐强\n度：强烈推荐）\n推荐意见5：作为CT 或MRI 检查的补充，PET-CT 检\n查适于存在胰腺外转移高危因素或需要鉴别肿瘤性质的\n病人。（证据等级：中；推荐强度：一般性推荐）\n1.4\n内镜超声（endoscopic ultrasonography，EUS）在胰腺癌\n术前诊断中的应用\nEUS及其引导下的细针穿刺活检不仅\n有助于判断肿瘤T 分期及胰周淋巴结转移，还可获取组织\n学标本明确病理学诊断。EUS 诊断T1～T2 期胰腺癌的敏\n感度和特异度分别达到72%和90%；而诊断T3～T4期的敏\n感度和特异度分别为90%和72%，在对肠系膜上静脉和门\n静脉是否受累以及浸润范围的判断上优于CT 及MRI 检\n查\n［10］。近年来，基于EUS 弹力成像的肿瘤弹性应变率检测\n可辅助判断胰腺癌间质含量，指导临床药物的选择\n［11］。\nEUS 为有创操作，其准确性受操作者技术水平及经验\n的影响较大，临床更多是以其引导下穿刺获取组织标本为\n目的，对于诊断及手术指征明确的病人，术前无需常规行\nEUS。\n推荐意见6：EUS 在判断肿瘤T 分期方面有一定优势，\n其准确性受操作者技术及经验水平的影响较大，临床更多\n是以其引导下穿刺获取组织标本为目的，不建议将其作为\n胰腺癌分期诊断的常规方法。（证据等级：中；推荐强度：一\n般性推荐）\n1.5\n三维可视化技术在胰腺癌诊治中的应用\n三维可视\n化是用于显示胰腺癌及其周围管道三维解剖和形态特征\n的一种工具，利用计算机图像处理技术，通过对CT 或MRI\n的图像数据进行分析、融合、计算、分割及渲染，对胰腺、肿\n瘤、血管、胆道等目标的形态和空间分布进行描述，可直\n观、准确、快捷地将目标从视觉上分离出来，为术前准确诊\n断、个体化规划手术方案和选择手术入路等提供参考。三\n维可视化模型可清晰显示胰腺肿瘤的部位、形态及侵及范\n围，对其周围重要血管的走行、变异及其与肿瘤的立体空\n间关系等亦可准确显示，有助于评估术前可切除性和制定\n手术方案\n［12］。\n推荐意见7：对合并胰周血管受累的胰腺癌病人，三维\n可视化技术有助于术前可切除性评估，指导手术入路及术\n综合征\nPeutz-Jeghers综合征\n家族性胰腺炎\n黑色素瘤-胰腺癌综合征\n林奇综合征\n遗传性乳腺癌-卵巢癌综合征\n基因\nSTK11\nPRSS1、SPINK1、CFTR\nCDKN2A\nMLH1、MSH2（MSH6）\nBRCA1、BRCA2\n胰腺癌评估风险（%）\n11～36（至65～70岁）\n40～53（至70～75岁）\n14～17（至70岁）\n4（至70岁）\n1.4～1.5（女性，至70岁）\n2.1～4.1（男性，至70岁）\n与普通人群患病风险比较（倍）\n132\n26～87\n20～47\n9～11\n2.4～6.0\n表1\n胰腺癌的遗传易感基因\n注：STK11，丝氨酸/苏氨酸激酶基因11；PRSS1，阳离子胰蛋白酶原基因；SPINK1，丝氨酸转肽酶抑制剂Kazal 1 型基因；CFTR，囊性纤\n维化跨膜转导调节基因；CDKN2A，细胞周期依赖性激酶抑制基因；MLH1，MutL同源基因1；BRCA1，乳腺癌易感基因1；BRCA2，乳腺癌易感\n基因2\n·\n·726\n"}, {"page": 3, "text": "中国实用外科杂志2021年7 月第41 卷第7 期\n式选择。（证据等级：中；推荐强度：一般性推荐）\n2\n胰腺癌分期与可切除性评估\n胰腺癌分期见表2。\n基于影像学检查结果提示的肿瘤与其周围重要血管\n的关系及远处转移情况，评估肿瘤可切除性并将其分为可\n切除、交界可切除和不可切除3种类型（表3）。\n胰腺癌的可切除性评估标准是基于CT、MRI 等影像学\n检查结果，仅从局部解剖学层面评估胰腺癌的可切除性，\n还应结合其他生物学标准如肿瘤标记物、PET-CT 检查结\n果及病人一般情况等综合判断。\n推荐意见8：推荐在MDT 模式下进行胰腺癌分期及可\n切除性评估。解剖学层面主要通过肿瘤周围主要血管是\n否受累、是否合并远处转移及能否达到R0 切除来评估其\n可切除性。（证据等级：高；推荐强度：强烈推荐）\n3\n新辅助治疗在胰腺癌治疗中的应用\n3.1\n新辅助治疗在可切除胰腺癌中的应用\n可切除胰腺\n癌病人是否应行新辅助治疗仍然存在较大争议，虽有研究\n结果发现新辅助治疗有望提高可切除胰腺癌病人R0 切除\n率及降低淋巴结阳性率，但普遍样本量有限，证据等级不\n高，各研究之间存在明显异质性\n［13-15］。文献报道，约20%的\n可切除胰腺癌病人因新辅助治疗失败而出现疾病进展或\n体能状态下降，错失手术机会；术前穿刺明确病理学诊断\n及置管减黄为有创性操作，存在发生出血、胆管炎、胰瘘及\n肿瘤播散等潜在风险，因而对可切除胰腺癌病人常规开展\n新辅助治疗应持审慎态度\n［16］。\n目前，国内外指南多提倡针对病理学诊断明确且合并\n高危因素的可切除胰腺癌病人开展新辅助治疗。已知高\n危因素包括CA19-9 水平显著增高、瘤体较大、区域淋巴结\n肿大疑似转移、体重显著降低和伴有明显疼痛等。针对合\n并上述高危因素的可切除胰腺癌病人，经MDT 讨论并综合\n评估病人意愿、体能状态及实际情况后可开展新辅助治\n疗。目前针对可切除胰腺癌的上述高危因素，尚缺乏一致\n的量化标准，建议开展相关临床研究\n［17］。\n可切除胰腺癌新辅助治疗尚无标准化方案，对于体能\n状态好（美国东部肿瘤协作组评分0～1 分）的病人推荐行\n改良FOLFIRINOX 或白蛋白紫杉醇联合吉西他滨等多药联\n合方案，术前治疗2～4个周期后评估治疗效果。日本一项\n随机对照临床试验（Prep-02/JSAP-05）研究结果显示，术前\n吉西他滨联合替吉奥方案可提高可切除胰腺癌病人的总\n体生存期，亦可作为备选方案\n［15］。治疗期间密切监测肿瘤\n指标变化趋势及影像学评估结果，注意控制严重不良反应\n并予营养支持治疗。对于新辅助治疗效果不佳的病人可\n及时进行手术干预。如若病人因疾病进展无法手术切除，\n应遵循不可切除胰腺癌的治疗原则。放疗在可切除胰腺\n癌新辅助治疗中的意义尚缺乏高质量研究佐证，可依据具\n体情况开展并评估。\n推荐意见9：不建议对所有可切除胰腺癌病人常规开\n展新辅助治疗。（证据等级：中；推荐强度：强烈推荐）\n推荐意见10：对合并高危因素的可切除胰腺癌病人行\n新辅助治疗并提倡开展相关临床研究。（证据等级：中；推\n荐强度：强烈推荐）\n3.2\n新辅助治疗在交界可切除胰腺癌中的应用\n直接对\n交界可切除胰腺癌病人进行手术治疗导致切缘阳性（R1）\n或局部有病灶残留（R2）的可能性较大，改善预后的作用有\n限，建议开展新辅助治疗。有研究结果显示，新辅助治疗\n有助于提高交界可切除胰腺癌病人的R0切除率，改善无瘤\n生存及总生存\n［14,18］。此外，新辅助治疗有助于评估肿瘤的\n生物学行为，若在新辅助治疗期间病情进展，则预示肿瘤\n原发肿瘤（T）\nTX\nT0\nTis\nT1\nT1a\nT1b\nT1c\nT2\nT3\nT4\n区域淋巴结（N）\nNX\nN0\nN1\nN2\n原发肿瘤无法评估\n无原发肿瘤的证据\n原位癌（包括高级别胰腺上皮内瘤变）\n肿瘤局限于胰腺内，最大径≤2.0 cm\n肿瘤局限于胰腺内，最大径≤0.5 cm\n肿瘤局限于胰腺内，0.5 cm＜最大径≤1.0 cm\n肿瘤局限于胰腺内，1.0 cm＜最大径≤2.0 cm\n肿瘤局限于胰腺内，2.0 cm＜最大径≤4.0 cm\n肿瘤最大径＞4.0 cm\n肿瘤不论大小，侵犯腹腔干、肠系膜上动脉和（或）肝总动脉\n区域淋巴结无法评估\n无区域淋巴结转移\n有1～3枚区域淋巴结转移\n有>3枚区域淋巴结转移\n远处转移（M）\nM0\nM1\n分期\n0期\nⅠA期\nⅠB期\nⅡA期\nⅡB期\nⅢ期\nⅣ期\n无远处转移\n有远处转移\nTis N0 M0\nT1 N0 M0\nT2 N0 M0\nT3 N0 M0\nT1~T3 N1 M0\nT4 任何N M0\n任何T N2 M0\n任何T 任何N M1\n表2\n美国癌症联合委员会（AJCC）胰腺癌分期标准\n·\n·727\n"}, {"page": 4, "text": "中国实用外科杂志2021 年7 月第41 卷第7 期\n的生物学行为较差，难以从手术中获益。因此，针对体能\n状态较好的交界可切除胰腺癌病人，推荐先给予新辅助治\n疗。目前尚无明确的最佳新辅助治疗方案，可选择的方案\n包括FOLFIRINOX 及其改良方案或联合序贯放化疗、白蛋\n白紫杉醇联合吉西他滨方案或联合序贯放化疗等。对于\n存在BRCA1/2 或PALB2 突变的病人，建议采用含铂类的化\n疗方案或联合序贯放化疗，也可选择吉西他滨联合顺铂方\n案（2～6 个周期）或联合序贯放化疗。有文献报道，FOL⁃\nFIRINOX 及其改良方案可提高交界可切除胰腺癌病人的\nR0 切除率，延长中位无进展生存期及总生存期，但不良反\n应较大，病人耐受性差；白蛋白紫杉醇联合吉西他滨方案\n在提高R0 切除率及延长总生存期方面与FOLFIRINOX 方\n案相比差异无统计学意义\n［19-20］。吉西他滨联合替吉奥方案\n的毒性较小，可用于交界可切除胰腺癌的新辅助治疗，Ⅱ\n期临床研究结果显示，该方案可有效提高病人的R0切除率\n并延长其总生存期\n［21］。目前尚无高质量的临床研究比较\n各新辅助治疗方案的效果，建议通过MDT 个体化制定新辅\n助治疗方案。对于体能状态较好的病人，建议采用前述联\n合方案，以达到较高的客观有效率；对于体能状态较差的\n病人，可以考虑行吉西他滨或氟尿嘧啶类单药为基础的放\n化疗方案。目前，对新辅助治疗的周期也无明确标准，一\n般推荐2～4 个周期的新辅助治疗，根据治疗前后肿瘤大\n小、肿瘤标记物、临床表现及体能状态的变化等，由MDT 进\n行疗效评估。新辅助治疗后病情无进展的病人，即使影像\n学检查未发现肿瘤降期，也应进行手术探查。首选腹腔镜\n探查，在排除远处转移后应争取根治性切除。\n放疗不单独作为新辅助治疗的手段，其在联合新辅助\n化疗中的作用还需进一步前瞻性研究证实。\n推荐意见11：新辅助治疗有助于提高交界可切除胰腺\n癌病人的R0 切除率，改善病人预后，建议对所有体能状态\n良好的交界可切除胰腺癌病人行新辅助治疗。（证据等级：\n高；推荐强度：强烈推荐）\n3.3\n胰腺癌新辅助治疗效果评价\n目前仍缺乏理想的评\n估胰腺癌病人新辅助治疗效果的手段。基于影像学检查\n结果的传统评价标准即实体肿瘤反应评估标准（response\nevaluation criteria in solid tumors，RECIST），根据治疗前后\nCT 或MRI 检查所示靶病灶大小的变化评估疗效，具有直\n观、标准化及可操作性强等优势，但难以体现肿瘤异质性、\n细胞活性、血供、免疫细胞浸润等生物学属性。由于胰腺\n癌富含间质，新辅助治疗后肿瘤周围组织也会产生炎性反\n应及纤维化，即使新辅助治疗有效，肿瘤大小及重要血管\n的受累范围亦常无显著变化，RECIST往往难以对胰腺癌新\n辅助治疗的效果及肿瘤可切除性进行准确评估。近年有\n研究指出，PET-CT 检查对新辅助治疗效果评估的准确性\n优于CT检查，新辅助治疗前后其摄取值的改变与病人预后\n相关\n［22］。可见，胰腺癌新辅助治疗效果的准确评估仍为目\n前亟待解决的难点。近年来，定量及功能影像学技术，如\n基于双能量CT 碘含量测定、CT 或MRI 灌注扫描、MRI DWI\n及PET-MRI检查等，可作为传统形态学评估的重要补充。\n血清CA19-9 是新辅助治疗后病人预后的独立预测因\n素，新辅助治疗后CA19-9水平下降>50%的病人预后更好，\n恢复至正常水平的病人术后生存获益显著\n［20,23］。对于交界\n可切除状态\n可切除胰腺癌\n交界可切除胰腺癌\n不可切除胰腺癌\n局部进展期\n合并远处转移\n动脉\n肿瘤未触及腹腔干、肠系膜上动脉或肝总动脉\n胰头和胰颈部肿瘤：肿瘤触及肝总动脉，但未累及腹腔干\n或左右肝动脉起始部，可以被完全切除并重建；肿瘤触及\n肠系膜上动脉，但没有＞180°；若合并动脉解剖变异如副\n肝右动脉、替代肝右动脉、替代肝总动脉等，应注意明确是\n否受累及受累范围，可能影响手术决策\n胰体/尾部肿瘤：肿瘤触及腹腔干未＞180°；肿瘤触及腹腔\n干＞180°，但未触及腹主动脉，且胃十二指肠动脉未受累\n（有学者认为这种情况属于局部进展期范畴）\n胰头和胰颈部肿瘤：肿瘤触及肠系膜上动脉＞180°；肿瘤\n触及腹腔干＞180°\n胰体或尾部肿瘤：肿瘤触及肠系膜上动脉或腹腔干＞\n180°；腹腔干及腹主动脉受累\n远处转移（包括切除范围以外淋巴结转移）\n静脉\n肿瘤未触及肠系膜上静脉或门静脉，或有触及\n但未＞180°，且静脉轮廓规则\n胰头和胰颈部肿瘤：肿瘤触及肠系膜上静脉或\n门静脉＞180°或触及范围虽未＞180°，但静脉轮\n廓不规则或存在静脉血栓，切除后可行静脉重\n建；肿瘤触及下腔静脉\n胰体或尾部肿瘤：肿瘤触及脾静脉门静脉汇入\n处，或门静脉左侧有触及但未＞180°，静脉轮廓\n不规则；受累血管可完整切除，其远近端可行安\n全重建；肿瘤触及下腔静脉\n胰头和胰颈部肿瘤：肿瘤侵犯或栓塞（瘤栓或血\n栓）导致肠系膜上静脉或门静脉不可切除重建；\n肿瘤大范围触及肠系膜上静脉远侧空肠引流支\n胰体/尾部肿瘤：肿瘤侵犯或栓塞（瘤栓或血栓）\n导致肠系膜上静脉或门静脉无法切除重建\n远处转移（包括切除范围以外淋巴结转移）\n表3\n胰腺癌可切除性的影像学评估\n·\n·728\n"}, {"page": 5, "text": "中国实用外科杂志2021年7 月第41 卷第7 期\n可切除胰腺癌病人行新辅助治疗，若CA19-9 水平稳定或\n降低且影像学检查示肿瘤无进展，应积极行手术探查。\n推荐意见12：影像学检查是评估胰腺癌病人新辅助治\n疗效果的主要方式，同时应结合PET-CT、肿瘤标记物及病\n人全身情况等综合评价。（证据等级：低；推荐强度：一般性\n推荐）\n3.4\n胰腺癌新辅助治疗后的病理学评估\n对胰腺癌新辅\n助治疗后手术切除标本的病理学检查结果可评估疗效及\n预后，指导后续治疗。有研究结果表明，病理学评估为完\n全反应或接近完全反应病人的预后好于肿瘤广泛残存\n者。目前，多根据新辅助治疗后胰腺切除标本中残存肿瘤\n的范围进行退缩评分，以美国病理学会根据Ryan结直肠癌\n评价方案改良的四级评分系统最常用（表4）\n［24］。鉴于胰腺\n癌富含间质及新辅助治疗后的促纤维化作用，新辅助治疗\n后根据肿瘤大小的变化不足以准确反映治疗效果，应结合\n镜下残留肿瘤细胞数目综合评价。\n建议通过大切片全景评估新辅助治疗后的切除标本，\n以客观评价治疗效果；同时，须充分取材，准确评估残余肿\n瘤细胞数量。\n推荐意见13：胰腺癌新辅助治疗后通过评估胰腺切除\n标本残存肿瘤的范围进行退缩评分，通常采用四级评分系\n统。（证据等级：中；推荐强度：强烈推荐）\n4\n胰腺癌的外科治疗\n4.1\n胰腺癌病人术前营养评估与营养支持\n有研究结果\n显示，胰腺癌病人合并营养风险及营养不良发生率高达\n91.1%，高于其他消化系统肿瘤及非胰腺肿瘤病人\n［25］。我\n国的多中心回顾性队列研究结果显示，胰十二指肠切除术\n前营养支持可降低营养风险筛查2002（nutritional risk\nscreening 2002，NRS2002）评分≥5 分病人的术后胰瘘发生\n率\n［26］。NRS2002是国内外广泛应用的成年住院病人的营养\n筛查工具，建议至少在术前10 d 完成营养筛查，及时发现\n营养问题以开展必要的营养治疗。NRS2002 评分≥3 分者\n即有制定营养诊疗计划的指征，需要进行基本营养评定，\n包括营养相关病史、膳食调查、体检、实验室检查，在此基\n础上进行营养干预，包括营养咨询、膳食指导、口服营养补\n充、肠内营养（管饲）和肠外营养等。\n术前营养支持指征：\n（1）6 个月内体重下降＞15%。\n（2）\nBMI＜18.5。（3）主观全面评定法评定为C 级。（4）NRS2002\n评分＞5 分。\n（5）白蛋白＜30 g/L 同时肝肾功能正常。其中\n指征（1）（2）最常用\n［27］。对于合并营养风险的多数胰腺癌\n病人，术前通过膳食指导及口服营养补充（ONS）多可满足\n营养需求。对存在高营养风险或营养不良的病人，如经口\n进食不能满足目标量，可进行肠内营养（管饲）、补充性肠\n外营养或全肠外营养。术前营养支持的时间＞7 d，强调蛋\n白质补给量应＞1.2 g/（kg·d），热量达到生理需求量的70%\n即可\n［26-27］。\n推荐意见14：胰腺癌病人术前常规应用NRS2002 进\n行营养风险筛查并制定营养诊疗计划。（证据等级：高；推\n荐强度：强烈推荐）\n推荐意见15：术前营养支持可根据营养状态选择膳食\n指导、口服营养补充、肠内营养（管饲）和肠外营养等，应用\n时间至少为7 d。（证据等级：中；推荐强度：强烈推荐）\n4.2\n术前胆道引流\n采用术前胆道引流（preoperative bili⁃\nary drainage，PBD）缓解梗阻性黄疸的有效性及必要性存在\n争议，不建议常规行PBD 减黄，因其并不能降低病人围手\n术期病死率，且可能增加术后并发症发生率\n［28］。对于胆道\n梗阻时间较长，肝肾功能明显异常，合并发热及胆管炎等\n感染表现者，建议行PBD，以控制感染，改善肝肾功能，提高\n围手术期安全性。如拟行新辅助治疗，治疗前亦应行\nPBD。是否将黄疸严重程度作为实施PBD 的指征，尚无明\n确结论，多以血清总胆红素≥250 μmol/L（15 mg/dL）作为严\n重黄疸的定义标准，严重黄疸者术前是否需行PBD，存在争\n议，建议根据病人实际情况综合判断。提倡内引流减黄，\n有助于改善病人术前消化及营养状态。内镜下PBD 可选\n择塑料支架或自膨式金属支架（self- expandable met⁃\nal stents，SEMS）。有研究认为，SEM 易与周围组织发生炎\n症和粘连，增加了后续手术的难度，塑料支架经济有效且\n易于取出，但引流期间支架梗阻及移位的发生率明显高于\nSEMS，较长时间留置时往往需要更换\n［29］。与塑料支架和未\n覆膜的SEMS 比较，全覆膜SEMS（fully covered SEMS，FC⁃\nSEMS）通畅时间长，易于移除，更适于新辅助治疗的胰腺癌\n病人。因此，对于切除可能性大、预计支架留置时间较短\n的病人可选择塑料支架；对于留置时间可能较长或拟行术\n前新辅助治疗的病人，可选择FCSEMS。如果无法完成内\n镜下胆道支架置入，也可选择EUS 引导的胆道引流（EUS-\nBD）。对于不具备内引流条件如合并上消化道梗阻、狭窄、\n曾行上消化道重建手术、胆道支架置入失败的病人，可行\n经皮经肝穿刺胆道引流（percutaneous transhepatic cholan⁃\ngial drainage，PTCD），其对术区影响小，引流效果确切，但胆\n汁流失不利于病人术前消化及营养状态的改善。\nPTCD 或内镜支架置入均可能导致相关并发症发生，\n前者可致出血、胆瘘、感染或腹膜转移等，后者可致急性胰\n腺炎或胆道感染，建议在较大规模的中心完成上述诊疗行\n为。\n描述\n无癌细胞残留（完全反应）\n单个或小簇状癌细胞残留（接近完全反应）\n残余癌细胞伴显著肿瘤退缩，但多于单个或\n小簇状癌细胞（部分反应）\n广泛癌细胞残存，肿瘤无明显退缩（反应差或\n无反应）\n肿瘤退缩评分\n（分）\n0\n1\n2\n3\n表4\n改良Ryan肿瘤退缩评分方案\n·\n·729\n"}, {"page": 6, "text": "中国实用外科杂志2021 年7 月第41 卷第7 期\n推荐意见16：胰腺癌致胆道梗阻合并胆管炎、计划行\n新辅助治疗、其他原因导致手术延期等情况时，建议行\nPBD，且首选内镜下支架置入术。（证据等级：中；推荐强\n度：一般性推荐）\n4.3\n术前腹腔镜探查在胰腺癌诊治中的应用\n胰腺癌姑\n息性切除无助于改善预后，还可导致全身系统治疗推迟，\n不利于病人远期生存。此外，胰腺癌术后早期常见肿瘤复\n发，尤以肝脏、腹膜常见，部分原因是术前即已存在影像学\n检查难以发现的腹腔或肝脏微小转移。因此，有必要对拟\n行切除手术且合并高危因素的胰腺癌病人进行全面、仔细\n的腹腔镜探查，以发现术前影像学检查未检出的微小转移\n灶，避免姑息性切除手术。对于无高危因素的可切除胰腺\n癌病人术前是否常规行腹腔镜探查，仍有争议，基于腹腔\n镜探查风险较小而可潜在获益的考虑，可在综合评价后选\n择性应用。总体评价，胰腺癌局部分期越晚，腹腔镜探查\n发现远处微转移灶的阳性率越高。\n腹腔镜探查应包括腹膜（含小肠及乙状结肠系膜）、肝\n脏微小转移灶及脱落细胞学检查等。腹腔镜探查证实胰\n腺癌腹腔微小转移灶的阳性率为11%～56%\n［30］。研究结果\n显示，胰腺癌腹腔脱落细胞学检查阳性率约为10%，尽管脱\n落细胞学检查阳性是否等同于远处转移仍有争议，但阳性\n病人预后更差\n［31］。\n推荐意见17：对于新辅助治疗后的局部进展期及交界\n可切除胰腺癌病人以及合并高危因素的可切除病人，建议\n切除手术前行腹腔镜探查。（证据等级：中；推荐强度：强烈\n推荐）\n4.4\n腹腔镜及机器人手术在胰腺癌外科治疗中的应用\n目前，腹腔镜及机器人辅助下的各类型胰腺手术均有开\n展，手术安全性明显提高，技术方面趋于成熟。然而，腹腔\n镜或机器人辅助手术应用于胰腺癌外科治疗仍然存在较\n大争议，主要体现在治疗效果的肿瘤学评价及手术安全性\n等方面。我国学者进行的前瞻性多中心随机对照研究评\n价腹腔镜胰十二指肠切除术（laparoscopic pancreatocoduo⁃\ndenectomy，LPD）的安全性，结果显示，对于完成学习曲线、\n技术成熟的术者，LPD 组病人住院时间显著短于开放手术\n组，两组病人围手术期严重并发症发生率、术后90 d 内病\n死率等差异并无统计学意义\n［32］。肿瘤学评价方面，有研究\n显示，LPD 淋巴结清扫数目和R0切除率与开放手术比较差\n异亦无统计学意义，而LPD 病人术后住院时间更短，有利\n于术后早期进行辅助化疗\n［33- 35］。有Meta 分析结果显示，\nLPD 术后病人总生存期与开放手术差异无统计学意义，术\n后肿瘤无复发生存期长于开放手术，故认为微创技术可能\n为胰腺癌病人带来生存获益\n［36］。然而，应特别注意学习曲\n线、术者经验及手术质量对胰腺癌病人围手术期并发症特\n别是远期预后的影响，微创手术技术应用于胰腺癌的外科\n治疗，其肿瘤学评价仍有待于高质量的临床研究验证。\n推荐意见18：腹腔镜或机器人胰腺癌根治术应由经验\n丰富的外科医师有选择性地开展，其肿瘤学评价仍有待于\n高质量的临床研究验证。（证据等级：低；推荐强度：一般性\n推荐）\n4.5\n根治性顺行模块化胰脾切除术在胰体尾癌治疗中的\n应用\n胰体尾脾切除术是治疗胰体尾癌的标准术式，标准\n的淋巴结清扫范围须包括脾动脉周围、胰腺下缘及脾门淋\n巴结，扩大淋巴结清扫范围者还应包括肝总动脉、腹腔干\n和部分肠系膜上动脉左侧淋巴结。2003 年，Strasberg 等\n［37］\n将根治性顺行模块化胰脾切除术（radical antegrade modu⁃\nlar pancreatosplenectomy，RAMPS）应用于胰体尾癌病人，根\n据是否联合左肾上腺切除分为前RAMPS 及后RAMPS，其\n内涵是对腹膜后切除平面的扩展，强调腹膜后切缘阴性\n（R0 切除）及清扫血管根部淋巴结（图1）。尽管RAMPS 对\n胰腺癌远期预后的改善作用仍存在争议，但因其理论上的\n合理性及围手术期的安全性，有助于提高胰体尾癌R0切除\n率，近年来应用日益广泛\n［38-39］。\n推荐意见19：RAMPS 有助于提高胰体尾癌R0 切除\n率，对远期预后的改善作用有待评估。（证据等级：中；推荐\n强度：一般性推荐）\n4.6\n胰腺癌根治术淋巴结清扫范围\n对于胰腺癌相关的\n淋巴结分组，目前国内外文献及指南多参照日本胰腺协会\n的命名标准（图2）。\n4.6.1\n胰头癌行胰十二指肠切除术标准的淋巴结清扫范\n围\n标准的淋巴结清扫范围包括：幽门上及下淋巴结\n（No.5、No.6），肝总动脉前方淋巴结（No.8a），肝十二指肠韧\n带淋巴结（肝总管、胆总管及胆囊管淋巴结，No.12b），胰十\n二指肠背侧上缘及下缘淋巴结（No.13a、No.13b），肠系膜上\n动脉右侧淋巴结（部分No.14），胰十二指肠腹侧上缘及下\n缘淋巴结（No.17a、No.17b）。完整切除钩突，肠系膜上动脉\n右侧180°骨骼化。上述淋巴结与标本整块切除。见图3。\n不建议常规清扫肝动脉后方（No.8p）及腹主动脉旁\n（No.16b1）淋巴结，不建议清扫腹腔干（No.9）、胃左动脉\n（No.7）及脾动脉周围（No.11）淋巴结，不建议全周清扫肠系\n膜上动脉周围淋巴结（No.14p、No.14d）。\n4.6.2\n胰头癌行胰十二指肠切除术扩大的淋巴结清扫范\n图1\n根治性顺行模块化胰脾切除术（RAMPS）示意图\n后RAMPS手术平面\n前RAMPS手术平面\n·\n·730\n"}, {"page": 7, "text": "中国实用外科杂志2021年7 月第41 卷第7 期\n围\n在标准淋巴结清扫范围基础上，清扫肝动脉后方淋巴\n结（No.8p）、腹腔干周围淋巴结（No.9）、肝固有动脉周围淋\n巴结（No.12a）、门静脉后方淋巴结（No.12p）、肠系膜上动脉\n周围淋巴结（No.14p、No.14d）、腹主动脉旁淋巴结\n（No.16a2、No.16b1）。清扫范围上至肝门，下至肠系膜下动\n脉起始部，右至右肾门，左至腹主动脉左侧缘，清扫该区域\n内淋巴结及神经、结缔组织等。\n4.6.3\n胰体尾癌切除术标准的淋巴结清扫范围\n脾门淋\n巴结（No.10）、脾动脉周围淋巴结（No.11）及胰腺下缘淋巴\n结（No.18）与标本整块切除。对于病灶位于胰体部者，可清\n扫腹腔干周围淋巴结（No.9）。见图4。对于诊断明确的胰\n体尾癌病人，应行不保留脾脏的胰体尾切除术。\n4.6.4\n胰体尾癌切除术扩大的淋巴结清扫范围\n在标准\n淋巴结清扫范围基础上，清扫肝总动脉周围淋巴结（No.8）、\n腹腔干周围淋巴结（No.9）、肠系膜上动脉周围淋巴结\n（No.14p、No.14d）、腹主动脉旁淋巴结（No.16a2、No.16b1）。\nStaerkle 等\n［40］进行的Meta 分析中纳入了既往关于淋巴\n结清扫范围的7 项随机对照试验共843 例胰腺癌及壶腹周\n围癌病人的临床资料，结果显示，与标准淋巴结清扫组比\n较，扩大淋巴结清扫组病人手术时间延长，术中出血量增\n多，但两组病人围手术期病死率及总生存期差异无统计学\n意义。Hackert等\n［41］基于回顾性单臂研究发现，在全身系统\n治疗模式下，术中清扫以腹腔干、肠系膜上动脉及门静脉\n为边缘的三角形范围内的神经结缔组织有助于改善局部\n进展期病人预后，但仍有待高级别证据验证。除临床研究\n外，目前仍建议行标准淋巴结清扫。\n淋巴结清扫数目、阳性淋巴结和总淋巴结数比值与预\n后的相关性存在争议，但送检标本内一定数量的淋巴结有\n助于获得准确的N 分期，并指导后续辅助治疗。在强调术\n中淋巴结清扫范围的基础上，提倡外科与病理科联合标准\n化处理手术标本，应获取15枚以上的淋巴结。\n推荐意见20：除临床研究外，胰腺癌术中建议行标准\n淋巴结清扫，应获取15 枚以上淋巴结，以获得准确的淋巴\n结分期。（证据等级：中；推荐强度：强烈推荐）\n4.7\n联合血管切除的胰腺癌根治术\n胰腺癌常累及肠系\n膜上静脉-门静脉和腹腔干-肝动脉系统，为提高切除率及\n根治性，常需联合切除受累血管并重建。对于仅肠系膜上\n静脉-门静脉受累且可切除重建的交界可切除胰腺癌，在\n全身系统治疗的基础上提倡行联合肠系膜上静脉和（或）\n门静脉切除的胰十二指肠切除术，如能达到R0 切除，病人\n预后与标准手术组无显著差异，明显优于仅行姑息手术的\n病人。Meta 分析结果显示，联合静脉切除组病人术中出血\n量、手术时间、术后住院时间、围手术期并发症发生率及术\n后30 d 内病死率均有显著增加，术后胆瘘、胃排空障碍\n（DGE）、再手术率和腹腔出血发生率等均高于标准手术\n组\n［42］。主要原因在于联合血管切除组病人的肿瘤体积大\n于对照组，同时合并神经侵犯的比例也明显增加，提示此\n类病人可能具有更差的生物学行为。\n目前，尚无高级别证据支持胰腺癌根治术中联合动脉\n切除重建。如可行安全的动脉切除重建，且有望获得R0切\n除，经MDT 讨论评估后，可选择手术切除。对于胰体尾癌\n累及腹腔干者，在全身系统治疗基础上联合腹腔干切除可\n能改善预后。有回顾性研究结果显示，新辅助化疗后联合\n动脉切除的病人中位生存期可达23个月，优于直接手术组\n病人（13.7 个月）\n［43］。拟行联合动脉切除时，应评估肿瘤侵\n犯的部位、范围、动脉走行及变异情况，可行数字减影血管\nNo.5，幽门上淋巴结；No.6，幽门下淋巴结；No.7，胃左动脉旁淋巴结；No.8a，肝总动脉上前淋巴结；No.8p，肝总动脉后方淋巴结；No.9，腹\n腔干周围淋巴结；No.10，脾门淋巴结；No.11p，脾动脉近侧旁淋巴结；No.11d，脾动脉远侧旁淋巴结；No.12a，肝动脉旁淋巴结；No.12p，门\n静脉旁淋巴结；No.12b，胆总管旁淋巴结；No.13a，胰头背侧上缘淋巴结；No.13b，胰头背侧下缘淋巴结；No.14p，肠系膜上动脉近侧淋巴\n结（肠系膜上动脉起始部至胰十二指肠下动脉起始部之间）；No.14d，肠系膜上动脉远侧淋巴结（胰十二指肠下动脉起始部至结肠中动\n脉起始部之间）；No.15，结肠中动脉旁淋巴结；No.16，腹主动脉周围淋巴结；No.17a，胰头腹侧上缘淋巴结；No.17b，胰头腹侧下缘淋巴\n结；No.18，胰腺下缘淋巴结\n图2 胰周淋巴结分组示意图\n图3 胰十二指肠切除术标准的淋巴结清扫范围示意图\n图4 胰体尾癌切除术标准的淋\n巴结清扫范围示意图\n·\n·731\n"}, {"page": 8, "text": "中国实用外科杂志2021 年7 月第41 卷第7 期\n造影（DSA）或CT 血管成像，结合三维可视化技术，做好术\n前规划。\n由于联合动脉切除的胰腺癌手术的并发症及围手术\n期病死率均高于未联合动脉切除组，且根治性有限，在手\n术指征的选择方面应较联合静脉切除持更为审慎的态\n度。不建议联合肠系膜上动脉切除重建。\n推荐意见21：对于有R0切除可能者，提倡行联合肠系\n膜上静脉和（或）门静脉切除重建的胰腺癌根治术。（证据\n等级：中；推荐强度：强烈推荐）\n推荐意见22：对于动脉受累的胰腺癌病人，应据R0切\n除可能性、受累部位及是否需要重建等审慎评估手术指\n征，不建议行联合肠系膜上动脉切除重建。（证据等级：低；\n推荐强度：一般性推荐）\n4.8\n不可切除胰腺癌的姑息性外科治疗\n胰头癌合并消\n化道梗阻的治疗方式并未达成共识，开放或腹腔镜下胃空\n肠吻合术以及内镜下消化道支架置入等均为可行之选。\n内镜下消化道支架置入术具有创伤小、耐受性好、术后恢\n复快、并发症发生率低、住院时间短等优势，但支架长期留\n置有移位、闭塞等风险，再干预率较高\n［44］。外科手术的围\n手术期并发症发生率高于内镜治疗，但消化道功能恢复更\n可靠，再干预率较低。对于合并消化道梗阻的晚期胰腺癌\n病人，预计病人生存期较长（>6 个月）且一般情况良好时，\n建议行胃空肠吻合术，术中可留置肠内营养管路以备术后\n营养支持；预计生存期较短（＜3 个月）或一般情况较差无\n法耐受手术的病人，可行内镜下支架置入。对于尚无消化\n道梗阻，但在外科手术探查中发现肿瘤无法根治性切除的\n胰腺癌病人，目前并无证据表明预防性胃空肠吻合术使病\n人获益，且可能增加围手术期并发症而推迟全身系统治疗\n时间，故不建议行预防性胃空肠吻合术。\n对于合并梗阻性黄疸的不可切除的胰腺癌病人，首选\n内镜胆道支架置入术。对于支架留置失败或因其他原因\n无法行内镜治疗的病人，可选择PTCD。姑息性胆肠吻合\n术仅适于因技术困难或存在禁忌无法通过内镜或PTCD 减\n黄的病人。对于在外科探查术中发现肿瘤无法根治性切\n除或因消化道梗阻行胃空肠吻合术的病人，若病人已合并\n胆道梗阻，可行姑息性胆肠吻合术或双旁路手术（胆肠吻\n合+胃空肠吻合术）。建议切除胆囊，行胆总管-空肠Roux-\nen-Y吻合。\n推荐意见23：对于合并消化道梗阻的晚期胰腺癌病\n人，根据病人一般状况可选择胃空肠吻合术或内镜下支架\n置入术。（证据等级：中；推荐强度：强烈推荐）\n推荐意见24：对于合并胆道梗阻的不可切除胰腺癌病\n人，首选内镜支架置入或PTCD。（证据等级：中；推荐强度：\n强烈推荐）\n5\n局部进展期胰腺癌的转化治疗策略\n局部进展期胰腺癌指肿瘤局部浸润广泛，合并周围重\n要血管受累而无远处转移的胰腺癌，与合并远处转移的胰\n腺癌一并被列为晚期范畴，属于不可切除。近年的研究发\n现，20%～60%的局部进展期胰腺癌病人通过转化治疗有\n望获得手术机会，预后明显好于未手术者\n［45-46］。尽管目前\n还缺少随机对照研究，但仍推荐全身状况良好的局部进展\n期病人尝试转化治疗。转化治疗前应获取细胞学或病理\n学诊断，对EUS、超声或CT 引导下反复穿刺活检仍无法明\n确病理诊断的病人，可行腹腔镜探查活检以明确病理诊\n断。目前尚无最佳转化治疗方案，其中FOLFIRINOX 及其\n改良方案、白蛋白紫杉醇联合吉西他滨等应用较多。对于\nBRCA1/2或PALB2突变的病人建议采用含铂类的化疗方案\n（可联合序贯化放疗）。对于体能状态较差的病人可行吉\n西他滨或氟尿嘧啶类单药为基础的放化疗方案。推荐对\n转化治疗后肿瘤无进展、有联合血管切除及重建可能、体\n力状况良好的病人进行腹腔镜手术探查，争取手术切除。\n转化治疗后手术时机的选择仍无定论，多选择在新辅助治\n疗后4~8周进行手术。\n推荐意见25：部分局部进展期胰腺癌病人通过转化治\n疗可获得手术机会以改善预后，体能状态良好的病人建议\n联合治疗方案，体能状态较差者建议采用吉西他滨或氟尿\n嘧啶类单药为基础放化疗方案，治疗前应明确细胞学或病\n理学诊断。（证据等级：低；推荐强度：强烈推荐）\n6\n胰腺癌合并寡转移的治疗策略\n寡转移指转移性病灶局限于一个器官（如肝脏），且负\n荷极低，可与原发灶同时完全切除。近年来，有回顾性研\n究结果显示，部分经高度选择的胰腺癌合并寡转移病人可\n能从手术中获益，其中先行系统化疗再行手术治疗的病人\n的预后好于直接手术者\n［47］。术前全身系统治疗除具有直\n接治疗作用外，尚有助于评估肿瘤生物学行为以筛选潜在\n获益的病人。经系统化疗后，如病人体能状态良好、CA19-9\n显著降低、影像学评估转移灶稳定或缩小且无新发转移灶\n的病人，可尝试行手术治疗，争取根治性切除原发灶及转\n移灶。有研究结果显示，低分化癌、未达到R0切除、未行术\n前系统化疗、未行术后化疗是影响胰腺癌合并寡转移病人\n预后的独立危险因素\n［48］。另有研究结果显示，仅合并肺转\n移的胰腺癌病人的生存期优于合并其他器官远处转移的\n病人，且胰腺癌合并肺寡转移的病人可从手术治疗中生存\n获益\n［49］。\n目前对于胰腺癌根治术后发生异时性寡转移的治疗\n策略尚无共识，部分回顾性研究结果显示，根治性手术后\n出现单一肺或肝脏寡转移的胰腺癌病人，仍可能从手术治\n疗中获益，且转移灶切除与胰腺手术间隔越长，病人预后\n越好\n［50-51］。Mitsuka 等\n［51］发现，胰腺癌根治术后仅有肝转移\n且病灶数≤3 个、观察3 个月无新发转移灶的病人，行肝转\n移灶切除后平均无病生存期达21个月，长于非切除组（3个\n月）。因此，对胰腺癌根治术后出现寡转移的病人，可通过\n全身系统治疗选择部分病人尝试进行手术治疗。\n在全身系统治疗的基础上，提倡开展高质量临床研\n·\n·732\n"}, {"page": 9, "text": "中国实用外科杂志2021年7 月第41 卷第7 期\n究，提出筛选优势人群的量化标准，客观评价联合同时及\n异时性寡转移病灶切除的临床意义。\n推荐意见26：对于胰腺癌合并单器官如肝、肺寡转移\n的病人，首选全身系统治疗。对于治疗后病人体能状态良\n好、CA19-9水平显著降低、影像学评估转移灶稳定或缩小\n且无新发转移病灶、有望根治性切除的病人，可尝试手术\n治疗。（证据等级：低；推荐强度：一般性推荐）\n7\n胰腺癌病人术后管理的若干热点问题\n7.1\n胰腺癌术中营养管路放置及术后营养支持策略\n术\n中营养管路包括空肠造口、鼻空肠管和鼻胃管等类型，在\n加速康复外科理念指导下，不推荐术中常规留置肠内营养\n管路，仅在术后有需要时留置。术中留置营养管路的适应\n证包括：\n（1）术前有营养不良。\n（2）预计有较高的术后并发\n症发生风险。\n（3）病人为二次手术。胰腺术后营养支持尚\n无统一方案，由于胰腺癌病人术前营养风险及营养不良发\n生率高，术后营养支持应较非肿瘤病人更为积极，目标能\n量可设定为25 kcal/（kg·d）（1 kcal=4.184 kJ），蛋白质为\n1.5 g/（kg·d）。术前营养状态良好的病人，术后3 d 内不强\n调营养达标，术后4～7 d 逐步恢复至接近需求量。如果术\n后7 d经口途径仍无法达到需求量的50%，可考虑予以肠内\n或肠外营养\n［52］。对于术中留置营养管路的高营养风险病\n人，术后应尽早启动肠内营养，至术后4 d 根据营养达标情\n况选择是否开始肠外营养。\n病人术后发生胰瘘时，建议采取个体化的营养支持策\n略，对于病情稳定的生化漏病人，可继续经口进食；对于症\n状轻微的B、C 级胰瘘病人，经口进食与肠内、肠外营养比\n较，并未延长胰瘘愈合时间，且可以缩短住院时间，降低住\n院费用\n［53］。对于C 级及部分B 级胰瘘病人，由于经口进食\n的耐受差，需予人工营养，首选肠内或联合肠外营养。胰\n腺术后发生DGE 是启动营养支持的最主要指征，A 级DGE\n在术后2 周内即可恢复经口进食，而B、C 级DGE 病程常在\n2 周以上，往往需要人工营养支持。建议先行肠外营养支\n持，7 d后病情不好转则经鼻空肠管行肠内营养支持。由于\nDGE 病程普遍较长，应按照营养支持的原则保证病人的营\n养需求，必要时行肠外营养补充\n［52］。\n推荐意见27：对于术前合并营养不良、预计有较高术\n后并发症风险及二次手术的病人，术中可留置营养管路。\n（证据等级：中；推荐强度：强烈推荐）\n推荐意见28：术后发生胰瘘等并发症时，建议制定个\n体化的营养支持方案，首选经消化道途径，必要时行肠外\n营养补充。（证据等级：中；推荐强度：强烈推荐）\n7.2\n胰腺癌术后生长抑素及其类似物的应用\n胰腺手术\n后应用生长抑素及其类似物能否降低胰瘘发生率仍存争\n议。一般认为，生长抑素及其类似物不能降低胰十二指肠\n切除术后胰瘘的总体发生率，但对于合并胰腺质地软、胰\n管直径<3 mm、BMI≥25、糖尿病等胰瘘高危因素的病人，术\n后应用生长抑素及其类似物可能降低术后临床相关胰瘘\n的发生风险\n［54］。目前广泛应用的预测术后胰瘘风险的模\n型主要有胰瘘危险评分（fistula risk score，FRS）及其改良\nFRS（a-FRS），前者包含胰腺质地、术中出血、胰管直径和病\n理学类型4 个预测因素，后者包括胰腺质地、BMI 和胰管直\n径3 个预测因素。此外，术者经验及吻合质量亦是影响术\n后胰瘘风险的重要因素。应对所有胰腺手术病人进行胰\n瘘风险评估，针对高风险病人，术后可预防性应用生长抑\n素及其类似物，建议用至术后2～3 d 病人开始经口进食\n时。\n推荐意见29：经胰瘘风险评估，对合并胰瘘高危因素\n的病人可预防性应用生长抑素及其类似物。（证据等级：\n中；推荐强度：强烈推荐）\n7.3\n胰腺癌术后腹腔引流管的管理\n近年来，随着加速康\n复理念的推广应用，胰腺癌术后腹腔引流管的管理问题受\n到较大关注。一方面是术后是否应常规留置腹腔引流管，\n其次是引流管的拔除时机。围绕前者开展的随机对照研\n究，结论虽多有矛盾之处，但仍建议胰腺癌术后应常规留\n置腹腔引流管。有研究根据RFS 对病人进行胰瘘风险评\n估，认为FRS 0～2分的低或无风险病人无需留置腹腔引流\n管，而FRS 3～10分的中高风险病人可根据术后第1天引流\n液淀粉酶浓度预测胰瘘风险，术后第1 天淀粉酶<5000 U/L\n的病人在术后第3天拔除引流管可显著降低临床相关胰瘘\n的发生率\n［55］。近年来，临床上尝试术后早期拔除腹腔引流\n管，但不同研究间拔管的指征差异较大。国内单中心随机\n对照研究结果证实，胰腺癌术后第1 天和第3 天引流液淀\n粉酶＜5000 U/L、同时术后3 d 内引流液量＜300 mL/d 者，\n在术后第3天拔除引流管可降低胰十二指肠切除术后Ⅱ～\nⅣ级并发症的发生率\n［56］。随后进行的多中心随机对照研\n究中，再次证实满足上述指征的胰十二指肠切除术后病人\n在第3 天拔除腹腔引流管安全可行，术后并发症发生率与\n延迟拔管组相当，但术后住院时间显著缩短。\n推荐意见30：胰腺癌术后常规留置腹腔引流管。（证据\n等级：中；推荐强度：强烈推荐）\n推荐意见31：对胰瘘风险低、吻合满意的胰腺癌病人，\n评估腹腔引流液淀粉酶浓度及引流量后，可早期拔除引流\n管。（证据等级：中；推荐强度：一般性推荐）\n8\n胰腺癌术后辅助治疗\n胰腺癌术后辅助化疗在防止或延缓肿瘤复发方面效\n果确切，根治术后病人如无禁忌证均应行辅助化疗。既往\n推荐以氟尿嘧啶类药物或吉西他滨为主的联合化疗方案，\n对于体能状态较差的病人，亦可予以单药化疗方案。近年\n来，有Ⅲ期临床研究结果证实，与传统的吉西他滨单药方\n案相比，替吉奥单药、吉西他滨联合卡培他滨、mFOLFIRI⁃\nNOX 等方案均延长了可切除胰腺癌病人的术后无病生存\n期和总生存期\n［57-59］。APACT 研究（国际性多中心Ⅲ期随机\n对照临床试验）结果显示，白蛋白紫杉醇联合吉西他滨方\n案可延长胰腺癌根治术后病人总生存期，亚组分析结果显\n·\n·733\n"}, {"page": 10, "text": "中国实用外科杂志2021 年7 月第41 卷第7 期\n示，T3 期合并淋巴结转移病人获益更明显，可作为其辅助\n化疗的备选方案\n［60］。术后可据病人体能状况选择辅助化\n疗方案，体能状态好者首选联合方案。目前，尚无分子靶\n向治疗、免疫治疗、细胞治疗等应用于胰腺癌术后辅助治\n疗并为病人带来生存获益的高级别证据，提倡开展相关临\n床研究。\n辅助化疗宜尽早开始，对于术后体能状态恢复较好的\n病人，辅助化疗起始时间尽可能控制在术后8周内；对于体\n能状态较差的病人，起始时间也不宜超过术后12 周，一般\n建议化疗6～8 个周期，总疗程24 周。由于部分病人术后\n早期即发生转移，辅助化疗开始前应行包括影像学检查在\n内的全面基线评估。\n新辅助化疗后序贯根治性手术的胰腺癌病人，建议经\nMDT 讨论评估后继续开展辅助化疗，治疗方案参考新辅助\n化疗的效果或临床研究结论。\n术后辅助放疗对延缓复发、改善预后的作用尚存争\n议，缺乏高级别证据支持。对于术后有肿瘤残存（R1 或R2\n切除）、区域淋巴结转移、血管或神经侵犯者可予术后辅助\n放疗，建议开展并参与相关临床研究。\n推荐意见32：胰腺癌术后均应行辅助化疗，尽量在术\n后8周内开始，根据病人体能状况，首选联合化疗方案。（证\n据等级：中；推荐强度：强烈推荐）\n9\n胰腺癌手术标本的标准化检测及切缘状态评估\n在保障标本完整性的前提下，提倡由外科及病理科医\n师合作完成胰十二指肠切除标本的标准化检测，对标本的\n下述切缘分别进行标记及描述，以客观准确地反映切缘状\n态：胰腺前侧（腹侧）、胰腺后侧（背侧）、胰腺肠系膜上静脉\n沟槽、胰腺肠系膜上动脉切缘、胰腺断端、胆管、胃、空肠等\n切缘。如联合肠系膜上静脉和（或）门静脉切除，应对静脉\n受累状况分别取材报告，并根据浸润深度做下述分类：静\n脉壁外膜受累；累及静脉壁，但内膜未受累；累及静脉壁全\n层。\n既往文献将切缘表面有无肿瘤细胞作为判断R0 或R1\n切除的标准，以此标准，R0与R1切除病人预后差异无统计\n学意义，R0切除病人仍有较高的局部复发率。建议以距切\n缘1 mm 内有无肿瘤浸润作为判断R0 或R1 切除的标准，\n即：距切缘1 mm 组织内如有肿瘤细胞浸润，为R1 切除；如\n无肿瘤细胞浸润，为R0切除。以“1 mm”为判断原则，R0与\nR1 切除病人预后差异存在统计学意义\n［61］。由于胰腺癌的\n解剖部位及其与周围血管的毗邻关系，多数胰腺癌病人为\nR1切除。如肉眼判断切缘即为阳性，为R2切除。\n外科手术的目的是达到R0切除，但由于胰腺的解剖特\n点及肿瘤的生物学行为，难以避免以R1 切除为手术结果，\n但仍可改善病人预后。姑息性切除特指R2切除，其对改善\n预后的作用尚待评估。文献报道，与仅行姑息性短路手术\n的病人比较，R2 切除并未改善病人预后和生活质量，应予\n避免。\n推荐意见33：提倡由外科及病理科医师合作完成胰十\n二指肠切除标本的标准化检测，对标本切缘分别进行标记\n及描述，以客观准确地反映切缘状态。（证据等级：中；推荐\n强度：强烈推荐）\n推荐意见34：将“1 mm”原则作为R0 或R1 切缘状态\n的判断标准。（证据等级：中；推荐强度：一般性推荐）\n10\n不可切除胰腺癌的化疗、靶向治疗与免疫治疗\n对于局部进展期或转移性胰腺癌的综合治疗，方案多\n有不确定性，提倡开展并参与相关临床研究。\n积极化疗有助于缓解症状、改善生活质量并延长生存\n期。根据病人体能状态，首选联合治疗方案，如FOLFIRI⁃\nNOX、吉西他滨联合白蛋白紫杉醇或吉西他滨联合替吉奥\n等，体能状态差者可选择吉西他滨或替吉奥单药方案。吉\n西他滨联合分子靶向药物治疗亦为可行之选。一线化疗\n后进展的胰腺癌病人，应根据病人体能状态、合并症、一线\n化疗方案及不良反应等选择二线化疗。二线化疗比支持\n治疗更有效。对体能状态好者，推荐使用纳米脂质体伊立\n替康联合氟尿嘧啶，或奥沙利铂联合氟尿嘧啶\n［62-64］；体能状\n态较差者可选择吉西他滨或替吉奥单药治疗\n［65］。\n建议对所有局部进展期或转移性胰腺癌病人进行基\n因检测，包括但不限于BRCA1/2、NTRK1/2/3、PALB2、ATM/\nATR 和RAS 等，有助于指导最佳药物治疗方案并参与新药\n的临床研究。对于存在NTRK 融合基因的胰腺癌病人，首\n选拉罗替尼（Larotrectinib）或恩曲替尼（Entrectinib）进行治\n疗\n［66-67］。存在致病性胚系BRCA1/2 基因突变的病人，一线\n化疗首选含铂方案，如FOLFIRINOX 或吉西他滨联合顺铂\n方案，如铂类药物治疗后无进展生存期≥16周，建议以奥拉\n帕尼（Olaparib）维持治疗\n［68］。对于体系BRCA1/2 基因突变\n或其他同源重组修复通路异常的病人，可参考胚系突变同\n等处理。尼妥珠单抗联合吉西他滨可延长KRAS 基因野生\n型，尤其合并表皮生长因子受体（EGFR）基因扩增的局部进\n展期或转移性胰腺癌病人的总生存期\n［69］。厄洛替尼联合\n吉西他滨可应用于EGFR 基因突变的病人。目前抗血管生\n成靶向药物用于晚期胰腺癌治疗仍缺乏证据支持。\n晚期胰腺癌病人均应进行MSI/MMR/TMB 检测。建议\n将免疫检查点抑制剂如程序性死亡受体1（PD-1）单克隆抗\n体用于具有高度微卫星不稳定性（microsatellite instability-\nhigh，MSI-H）或错配修复缺陷（different mismatch repair，\ndMMR）分子特征的转移性胰腺癌病人。目前，尚无证据表\n明使用免疫检查点抑制剂CTLA-4/PD-1/PD-L1 抗体可使\n无上述分子特征的胰腺癌病人获益。\n其他治疗包括射频消融、冷冻、高能聚焦超声、伽马\n刀、放射性粒子植入等，目前尚无明确证据显示其能够延\n长病人生存期。\n推荐意见35：对于不可切除的晚期胰腺癌病人，应据\n体能状况积极进行系统治疗，首选联合治疗方案。（证据等\n级：高；推荐强度：强烈推荐）\n推荐意见36：建议所有不可切除的晚期胰腺癌病人参\n与相关临床研究，并进行基因检测以确定最佳药物治疗。\n·\n·734\n"}, {"page": 11, "text": "中国实用外科杂志2021年7 月第41 卷第7 期\n（证据等级：低；推荐强度：强烈推荐）\n11\n基因学检测在胰腺癌诊治中的应用及其临床意义\n近年来，以二代测序为代表的高通量测序技术使检测\n通量提高至全外显子和全基因组水平，在胰腺癌发病机\n制，分子分型和药效研究中发挥了重要作用。然而，由于\n胰腺癌分子分型的复杂性及肿瘤的异质性，绝大多数变异\n信息的生物学特别是临床意义仍不够明确；针对胰腺癌常\n见的驱动基因如KRAS、TP53、CDKN2A 和SMAD4 等尚无有\n效的靶向药物，上述因素限制了基因学检测在胰腺癌临床\n诊治中的应用。\n近年来，基于生物标记物的靶向和免疫治疗在胰腺癌\n中的临床应用中初现曙光。有研究结果显示，对于EGFR\n扩增并KRAS 基因野生型的局部进展或合并远处转移的胰\n腺癌病人，尼妥珠单抗联合吉西他滨治疗可延长病人的总\n体生存时间，但临床符合该条件的病人较少\n［69］。POLO 研\n究（Ⅲ期临床试验）结果证实，携带胚系BRCA1/2 基因突变\n的晚期胰腺癌病人可从铂类药物化疗有效后的聚腺苷二\n磷酸核糖聚合酶（PARP）抑制剂奥拉帕利维持治疗中获\n益\n［68］。泛肿瘤的药物研究证实，对于存在NTRK 基因融合\n的局部进展期或远处转移的胰腺癌病人可使用拉罗替尼\n或恩曲替尼治疗\n［70］；对于具有MSI-H 或dMMR 分子特征的\n转移性胰腺癌病人，免疫检查点抑制剂PD-1 单克隆抗体\n显示出良好的治疗效果\n［71］。此外，一些基因状态可指导胰\n腺癌化疗方案的选择，如合并BRCA1/2 和PALB2 基因突变\n的胰腺癌病人，对含铂类药物的化疗方案较为敏感。\n除上述在胰腺癌中具有一定临床指导意义的基因检\n测外，还可对在其他肿瘤中已经证实的可干预的基因变异\n进行检测，以发现更多潜在的治疗机会，这些变异包括但\n不限于：同源重组修复通路基因（除BRCA1/2、PALB2 外）、\n同源重组修复缺陷（基于基因组瘢痕评分）、HER2 扩增、\nALK融合、ROS1融合等。\n推荐意见37：建议所有确诊的胰腺癌病人进行胚系胰\n腺癌易感基因检测；对于致病性或可能致病性胚系变异基\n因的携带者，在专业机构进行遗传咨询或在高流量的胰腺\n中心进行筛查。（证据等级：低；推荐强度：强烈推荐）\n推荐意见38：胰腺癌病人均应进行BRCA1/2、PALB2、\nMSI-H/dMMR、TMB 检测。（证据等级：高；推荐强度：强烈\n推荐）\n推荐意见39：优先使用肿瘤组织进行基因学检测，如\n肿瘤组织检测不可行，可考虑行细胞游离DNA检测。（证据\n等级：中；推荐强度：一般性推荐）\n12\n胰腺癌术后病人随访\n基于胰腺癌恶性度极高的生物学行为，病人术后仍合\n并较高的肿瘤复发风险，部分病人术后早期即出现局部复\n发或远处转移。Groot等\n［5］回顾性分析了957例胰腺癌术后\n病人的临床资料，随访期间肿瘤复发率为88.7%，其中\n51.5%的病人是在术后1 年内出现局部复发或远处转移。\n中国胰腺疾病大数据中心纳入了2016－2019 年共3279 例\n胰腺癌术后病人数据，术后9 个月内复发率为45.87%。可\n见，术后定期复查、密切随访极为重要。术后2 年内，建议\n每3 个月复查血清肿瘤标记物，每6 个月行CT 或MRI 等影\n像学检查；术后2 年后延长至每6 个月复查血清肿瘤标记\n物，每12个月行影像学复查。其间如有血清肿瘤标记物升\n高、淋巴结肿大等复发可疑征象，应及时进一步排查明\n确。随访期间除监测肿瘤复发外，还应特别关注其他手术\n相关并发症如胰腺内外分泌功能、营养状态等，并联合\nMDT 及时干预并调整治疗方案。从社会心理肿瘤学\n（psychosocio-oncology）的角度，对终末期病人除对症治疗\n外，应重视心理、精神层面的疏导干预，最大限度改善病人\n的生活质量。\n推荐意见40：胰腺癌术后病人存在高复发风险，应密\n切随访复查。（证据等级：高；推荐强度：强烈推荐）\n本指南旨在为胰腺癌临床规范化诊治提供原则性指\n导，指南内容不可能涵盖所有临床现象，鉴于胰腺癌生物\n学行为的复杂性、病人的异质性、已有临床研究的局限性、\n治疗方案与治疗效果之间的不确定性等，临床实践中应据\n病人的具体情况，在本指南推荐意见指导下个体化选择具\n体治疗方案，最大限度改善病人预后。\n参与本指南撰写及审阅的专家名单（按姓氏汉语拼音排\n序）：\n白雪莉（浙江大学医学院附属第一医院）\n边大鹏（北京大学第一医院）\n蔡守旺（中国人民解放军总医院第一医学中心）\n曹\n锋（首都医科大学宣武医院）\n陈汝福（广东省人民医院）\n戴梦华（中国医学科学院北京协和医学院北京协和医院）\n方驰华（南方医科大学珠江医院）\n傅德良（复旦大学附属华山医院）\n葛春林（中国医科大学附属第一医院）\n郭小超（北京大学第一医院）\n郝纯毅（北京大学肿瘤医院）\n郝继辉（天津医科大学肿瘤医院）\n黄鹤光（福建医科大学附属协和医院）\n简志祥（广东省人民医院）\n金\n钢（海军军医大学附属长海医院）\n李\n非（首都医科大学宣武医院）\n李海民（第四军医大学第一附属医院）\n李升平（中山大学附属肿瘤医院）\n李维勤（东部战区总医院）\n李宜雄（中南大学湘雅医院）\n李洪振（北京大学第一医院）\n梁廷波（浙江大学医学院附属第一医院）\n刘续宝（四川大学华西医院）\n楼文晖（复旦大学附属中山医院）\n·\n·735\n"}, {"page": 12, "text": "中国实用外科杂志2021 年7 月第41 卷第7 期\n苗\n毅（南京医科大学第一附属医院）\n牟一平（浙江省人民医院）\n彭承宏（上海交通大学医学院附属瑞金医院）\n秦仁义（华中科技大学同济医学院附属同济医院）\n邵成浩（海军军医大学附属长征医院）\n孙\n备（哈尔滨医科大学附属第一医院）\n谭\n广（大连医科大学附属第一医院）\n田孝东（北京大学第一医院）\n王槐志（中国科学院大学重庆医院）\n王\n磊（山东大学齐鲁医院）\n王\n巍（复旦大学附属肿瘤医院）\n王伟林（浙江大学医学院附属第二医院）\n韦军民（北京医院）\n吴河水（华中科技大学同济医学院附属协和医院）\n吴文铭（中国医学科学院北京协和医学院北京协和医院）\n仵\n正（西安交通大学第一附属医院）\n许静涌（北京医院）\n闫长青（河北医科大学第二医院）\n杨尹默（北京大学第一医院）\n殷晓煜（中山大学附属第一医院）\n虞先濬（复旦大学附属肿瘤医院）\n原春辉（北京大学第三医院）\n赵玉沛（中国医学科学院北京协和医学院北京协和医院）\n张太平（中国医学科学院北京协和医学院北京协和医院）\n张继新（北京大学第一医院）\n周\n军（北京大学肿瘤医院）\n执笔统筹：杨尹默，田孝东\n利益冲突\n所有作者均声明不存在利益冲突\n志谢\n北京大学第一医院外科侯宇婷医师为本指南绘图\n参考文献\n［1］Siegel RL，Miller KD，Fuchs HE，et al. Cancer Statistics，2021\n［J］. CA Cancer J Clin，2021，71（1）：7-33.\n［2］Chen X，Yi B，Liu Z，et al. Global，regional and national burden\nof pancreatic cancer，1990 to 2017: Results from the Global Bur-\nden of Disease Study 2017［J］. Pancreatology，2020，20（3）：\n462-469.\n［3］\nAndrews JC，Schünemann HJ，Oxman AD，et al. GRADE\nguidelines: 15. Going from evidence to recommendation-deter-\nminants of a recommendation's direction and strength［J］. J Clin\nEpidemiol，2013，66（7）：726-735.\n［4］Hu C，Hart SN，Polley EC，et al. Association between inherited\ngermline mutations in cancer predisposition genes and risk of\npancreatic cancer［J］. JAMA，2018，319（23）：2401-2409.\n［5］Groot VP，Gemenetzis G，Blair AB，et al. Defining and predict-\ning early recurrence in 957 patients with resected pancreatic\nductal adenocarcinoma［J］. Ann Surg，2019，269（6）：1154-\n1162.\n［6］Liu L，Xu H，Wang W，et al. A preoperative serum signature of\nCEA+/CA125+/CA19-9 ≥1000 U/mL indicates poor outcome to\npancreatectomy for pancreatic cancer［J］. Int J Cancer，2015，\n136（9）：2216-2227.\n［7］Liu L，Xu HX，Wang WQ，et al. Serum CA125 is a novel predic-\ntive marker for pancreatic cancer metastasis and correlates with\nthe metastasis-associated burden［J］. Oncotarget，2016，7（5）：\n5943-5956.\n［8］Luo G，Liu C，Guo M，et al. Potential biomarkers in lewis nega-\ntive patients with pancreatic cancer［J］. Ann Surg，2017，265\n（4）：800-805.\n［9］\nToft J，Hadden WJ，Laurence JM，et al. Imaging modalities in\nthe diagnosis of pancreatic adenocarcinoma: A systematic review\nand meta-analysis of sensitivity，specificity and diagnostic accu-\nracy［J］. Eur J Radiol，2017，92：17-23.\n［10］\nKrishna SG，Rao BB，Ugbarugba E，et al. Diagnostic perfor-\nmance of endoscopic ultrasound for detection of pancreatic ma-\nlignancy following an indeterminate multidetector CT scan: a\nsystemic review and meta-analysis［J］. Surg Endosc，2017，31\n（11）：4558-4567.\n［11］Shi S，Liang C，Xu J，et al. The strain ratio as obtained by endo-\nscopic ultrasonography elastography correlates with the stroma\nproportion and the prognosis of local pancreatic cancer［J］.\nAnn Surg，2020，271（3）：559-565.\n［12］\nFang C，An J，Bruno A，et al. Consensus recommendations of\nthree-dimensional visualization for diagnosis and management\nof liver diseases［J］. Hepatol Int，2020，14（4）：437-453.\n［13］Ye M，Zhang Q，Chen Y，et al. Neoadjuvant chemotherapy for\nprimary resectable pancreatic cancer: a systematic review and\nmeta-analysis［J］. HPB (Oxford)，2020，22（6）：821-832.\n［14］Versteijne E，Suker M，Groothuis K，et al. Preoperative chemo-\nradiotherapy versus immediate surgery for resectable and bor-\nderline resectable pancreatic cancer: Results of the dutch ran-\ndomized phase ⅢPREOPANC trial［J］. J Clin Oncol，2020，38\n（16）：1763-1773.\n［15］Motoi F，Kosuge T，Ueno H，et al. Randomized phase Ⅱ/Ⅲtri-\nal of neoadjuvant chemotherapy with gemcitabine and S-1 ver-\nsus upfront surgery for resectable pancreatic cancer (Prep-02/\nJSAP05)［J］. Jpn J Clin Oncol，2019，49（2）：190-194.\n［16］\nSur YK，Kim YC，Kim JK，et al. Comparison of ultrasound-\nguided core needle biopsy and endoscopic ultrasound- guided\nfine-needle aspiration for solid pancreatic lesions［J］. J Ultra-\nsound Med，2015，34（12）：2163-2169.\n［17］\nKim N，Han IW，Ryu Y，et al. Predictive nomogram for early\nrecurrence after pancreatectomy in resectable pancreatic can-\ncer: Risk classification using preoperative clinicopathologic\nfactors［J］. Cancers (Basel)，2020，12(1)：137.\n［18］Jang JY，Han Y，Lee H，et al. Oncological benefits of neoadju-\nvant chemoradiation with gemcitabine versus upfront surgery in\npatients with borderline resectable pancreatic cancer: A pro-\nspective，randomized，open- label，multicenter phase 2/3 trial\n［J］. Ann Surg，2018，268（2）：215-222.\n［19］\nDhir M，Zenati MS，Hamad A，et al. FOLFIRINOX versus\nGemcitabine/Nab- Paclitaxel for neoadjuvant treatment of re-\n·\n·736\n"}, {"page": 13, "text": "中国实用外科杂志2021年7 月第41 卷第7 期\nsectable and borderline resectable pancreatic head adenocarci-\nnoma［J］. Ann Surg Oncol，2018，25（7）：1896-1903.\n［20］Macedo FI，Ryon E，Maithel SK，et al. Survival outcomes asso-\nciated with clinical and pathological response following neoad-\njuvant FOLFIRINOX or Gemcitabine/Nab- Paclitaxel chemo-\ntherapy in resected pancreatic cancer［J］. Ann Surg，2019，270\n（3）：400-413.\n［21］Motoi F，Satoi S，Honda G，et al. A single-arm，phase Ⅱtrial\nof neoadjuvant gemcitabine and S1 in patients with resectable\nand borderline resectable pancreatic adenocarcinoma: PREP-\n01 study［J］.J Gastroenterol，2019，54（2）：194-203.\n［22］Yokose T，Kitago M，Matsusaka Y，et al. Usefulness of\n18F-fluo-\nrodeoxyglucose positron emission tomography/computed tomog-\nraphy for predicting the prognosis and treatment response of\nneoadjuvant therapy for pancreatic ductal adenocarcinoma［J］.\nCancer Med，2020，9(12): 4059-4068.\n［23］Aoki S，Motoi F，Murakami Y，et al. Decreased serum carbohy-\ndrate antigen 19- 9 levels after neoadjuvant therapy predict a\nbetter prognosis for patients with pancreatic adenocarcinoma: a\nmulticenter case-control study of 240 patients［J］. BMC Can-\ncer，2019，19（1）：252.\n［24］\nRyan R，Gibbons D，Hyland JM，et al. Pathological response\nfollowing long- course neoadjuvant chemoradiotherapy for lo-\ncally advanced rectal cancer［J］. Histopathology，2005，47（2）：\n141-146.\n［25］许静涌，杨剑，陈伟，等. 老年肿瘤住院患者营养不良的横断\n面调查［J］. 中华老年医学杂志，2019，38（11）：1298-1303.\n［26］Xu JY，Zhang AR，Tian XD，et al. Preoperative nutrition sup-\nport based on NRS2002 may reduce the prevalence of postoper-\native pancreatic fistula (POPF)：a retrospective bicenter study\nof 522 consecutive cases who underwent open pancreatoduode-\nnectomy in China［J］. Pancreas，2019，48(10): 1550.\n［27］Lobo DN，Gianotti L，Adiamah A，et al. Perioperative nutrition:\nRecommendations from the ESPEN expert group［J］. Clin Nutr，\n2020，39（11）：3211-3227.\n［28］Gong L，Huang X，Wang L，et al. The effect of preoperative bil-\niary stents on outcomes after pancreaticoduodenectomy: A me-\nta-analysis［J］. Medicine (Baltimore)，2020，99（42）：e22714.\n［29］\nCrippa S，Cirocchi R，Partelli S，et al. Systematic review and\nmeta- analysis of metal versus plastic stents for preoperative\nbiliary drainage in resectable periampullary or pancreatic head\ntumors［J］. Eur J Surg Oncol，2016，42（9）：1278-1285.\n［30］Allen VB，Gurusamy KS，Takwoingi Y，et al. Diagnostic accu-\nracy of laparoscopy following computed tomography (CT) scan-\nning for assessing the resectability with curative intent in pan-\ncreatic and periampullary cancer［J］. Cochrane Database Syst\nRev，2016，7（7）：CD009323.\n［31］Cao F，Li J，Li A，et al. Prognostic significance of positive peri-\ntoneal cytology in resectable pancreatic cancer: a systemic re-\nview and meta-analysis［J］. Oncotarget，2017，8（9）：15004-\n15013.\n［32］Wang M，Li D，Chen R，et al. Laparoscopic versus open pancre-\natoduodenectomy for pancreatic or periampullary tumours：A\nmulticentre，open-label，randomised controlled trial［J］. Lancet\nGastroenterol Hepatol，2021，6(6)：438-447.\n［33］\nPalanivelu C，Senthilnathan P，Sabnis SC，et al. Randomized\nclinical trial of laparoscopic versus open pancreatoduodenecto-\nmy for periampullary tumours［J］. Br J Surg，2017，104（11）：\n1443-1450.\n［34］Poves I，Burdío F，MoratóO，et al. Comparison of perioperative\noutcomes between laparoscopic and open approach for pancre-\natoduodenectomy: The PADULAP randomized controlled trial\n［J］. Ann Surg，2018，268（5）：731-739.\n［35］van Hilst J，de Rooij T，Bosscha K，et al. Laparoscopic versus\nopen pancreatoduodenectomy for pancreatic or periampullary\ntumours (LEOPARD-2): A multicentre，patient-blinded，ran-\ndomised controlled phase 2/3 trial［J］. Lancet Gastroenterol\nHepatol，2019，4（3）：199-207.\n［36］Peng L，Zhou Z，Cao Z，et al. Long-term oncological outcomes\nin laparoscopic versus open pancreaticoduodenectomy for pan-\ncreatic cancer: A systematic review and Meta- analysis［J］. J\nLaparoendosc Adv Surg Tech A，2019，29（6）：759-769.\n［37］Strasberg SM，Drebin JA，Linehan D. Radical antegrade modu-\nlar pancreatosplenectomy［J］. Surgery，2003，133（5）：521-\n527.\n［38］Cao F，Li J，Li A，et al. Radical antegrade modular pancreato-\nsplenectomy versus standard procedure in the treatment of left-\nsided pancreatic cancer: A systemic review and meta-analysis\n［J］. BMC Surg，2017，17（1）：67.\n［39］陈凯，王琦，高红桥，等. 根治性顺行模块化胰脾切除术治疗\n胰体尾癌安全性与有效性的Meta 分析［J］. 腹腔镜外科杂\n志，2019，24（9）：665-671.\n［40］Staerkle RF，Vuille-Dit-Bille RN，Soll C，et al.Extended lymph\nnode resection versus standard resection for pancreatic and\nperiampullary adenocarcinoma［J］. Cochrane Database Syst\nRev，2021，1：CD011490.\n［41］Hackert T，Strobel O，Michalski CW，et al. The TRIANGLE op-\neration - radical surgery after neoadjuvant treatment for ad-\nvanced pancreatic cancer: a single arm observational study［J］.\nHPB (Oxford)，2017，19（11）：1001-1007.\n［42］Peng C，Zhou D，Meng L，et al. The value of combined vein re-\nsection in pancreaticoduodenectomy for pancreatic head carci-\nnoma: a meta-analysis［J］. BMC Surg，2019，19（1）：84.\n［43］Bachellier P，Addeo P，Faitot F，et al. Pancreatectomy with ar-\nterial resection for pancreatic adenocarcinoma: How can it be\ndone safely and with which outcomes?A single institution's ex-\nperience with 118 patients［J］. Ann Surg，2020，271（5）：932-\n940.\n［44］Martin-Perez E，Domínguez-Muñoz JE，Botella-Romero F，et\nal. Multidisciplinary consensus statement on the clinical man-\nagement of patients with pancreatic cancer［J］. Clin Transl On-\ncol，2020，22（11）：1963-1975.\n［45］\nHackert T，Sachsenmaier M，Hinz U，et al. Locally advanced\npancreatic cancer: Neoadjuvant therapy with folfirinox results\n·\n·737\n"}, {"page": 14, "text": "中国实用外科杂志2021 年7 月第41 卷第7 期\nin resectability in 60% of the patients［J］. Ann Surg，2016，264\n（3）：457-463.\n［46］Gemenetzis G，Groot VP，Blair AB，et al. Survival in locally ad-\nvanced pancreatic cancer after neoadjuvant therapy and surgi-\ncal resection［J］. Ann Surg，2019，270（2）：340-347.\n［47］Crippa S，Cirocchi R，Weiss MJ，et al. A systematic review of\nsurgical resection of liver- only synchronous metastases from\npancreatic cancer in the era of multiagent chemotherapy［J］.\nUpdates Surg，2020，72（1）：39-45.\n［48］Andreou A，Knitter S，Klein F，et al. The role of hepatectomy\nfor synchronous liver metastases from pancreatic adenocarcino-\nma［J］. Surg Oncol，2018，27（4）：688-694.\n［49］Liu Q，Zhang R，Michalski CW，et al. Surgery for synchronous\nand metachronous single- organ metastasis of pancreatic can-\ncer: a SEER database analysis and systematic literature review\n［J］. Sci Rep，2020，10（1）：4444.\n［50］Ilmer M，Schiergens TS，Renz BW，et al. Oligometastatic pul-\nmonary metastasis in pancreatic cancer patients: Safety and\noutcome of resection［J］. Surg Oncol，2019，31：16-21.\n［51］Mitsuka Y，Yamazaki S，Yoshida N，et al. Time interval-based\nindication for liver resection of metastasis from pancreatic can-\ncer［J］. World J Surg Oncol，2020，18（1）：294.\n［52］Weimann A，Braga M，Carli F，et al. ESPEN guideline: Clinical\nnutrition in surgery［J］. Clin Nutr，2017，36（3）：623-650.\n［53］Wu JM，Kuo TC，Chen HA，et al. Randomized trial of oral ver-\nsus enteral feeding for patients with postoperative pancreatic\nfistula after pancreatoduodenectomy［J］. Br J Surg，2019，106\n（3）：190-198.\n［54］Adiamah A，Arif Z，Berti F，et al. The use of prophylactic soma-\ntostatin therapy following pancreaticoduodenectomy: A Meta-\nanalysis of randomised controlled trials［J］. World J Surg，\n2019，43（7）：1788-1801.\n［55］McMillan MT，Malleo G，Bassi C，et al. Multicenter，prospec-\ntive trial of selective drain management for pancreatoduodenec-\ntomy using risk stratification［J］. Ann Surg，2017，265（6）：\n1209-1218.\n［56］\nDai M，Liu Q，Xing C，et al. Early drain removal after major\npancreatectomy reduces postoperative complications: a single-\ncenter，randomized，controlled trial［J］. J Pancreat，2020，3(2):\n93-100.\n［57］Uesaka K，Boku N，Fukutomi A，et al. Adjuvant chemotherapy\nof S- 1 versus gemcitabine for resected pancreatic cancer: a\nphase 3，open-label，randomised，non-inferiority trial(JASPAC\n01)［J］. Lancet，2016，388（10041）：248-257.\n［58］\nNeoptolemos JP，Palmer DH，Ghaneh P，et al. Comparison of\nadjuvant gemcitabine and capecitabine with gemcitabine mono-\ntherapy in patients with resected pancreatic cancer (ESPAC-4):\na multicentre，open-label，randomised，phase 3 trial［J］. Lan-\ncet，2017，389（10073）：1011-1024.\n［59］Conroy T，Hammel P，Hebbar M，et al. FOLFIRINOX or gem-\ncitabine as adjuvant therapy for pancreatic cancer［J］. N Engl J\nMed，2018，379（25）：2395-2406.\n［60］Tempero MA，Reni M，Riess H，et al. APACT：phase Ⅲ，multi-\ncenter，international，open-label，randomized trial of adjuvant\nnab-paclitaxel plus gemcitabine (nab-P/G) vs gemcitabine (G)\nfor surgically resected pancreatic adenocarcinoma［J］. J Clin\nOncol，2019，37 (suppl 15): 4000.\n［61］Kim KS，Kwon J，Kim K，et al. Impact of resection margin dis-\ntance on survival of pancreatic cancer: A systematic review and\nMeta-analysis［J］. Cancer Res Treat，2017，49（3）：824-833.\n［62］Wang-Gillam A，Li CP，Bodoky G，et al. Nanoliposomal irino-\ntecan with fluorouracil and folinic acid in metastatic pancreatic\ncancer after previous gemcitabine-based therapy (NAPOLI-1):\na global，randomised，open- label，phase 3 trial［J］. Lancet，\n2016，387(10018)：545-557.\n［63］Bang YJ, Li CP, Lee KH, et al. Liposomal irinotecan in meta-\nstatic pancreatic adenocarcinoma in Asian patients: Subgroup\nanalysis of the NAPOLI- 1 study［J］. Cancer Sci, 2020, 111\n（2）：513-527.\n［64］Oettle H, Riess H, Stieler JM, et al. Second-line oxaliplatin, fo-\nlinic acid, and fluorouracil versus folinic acid and fluorouracil\nalone for gemcitabine- refractory pancreatic cancer: outcomes\nfrom the CONKO-003 trial［J］. J Clin Oncol, 2014, 32（23）：\n2423-2429.\n［65］\nda Rocha Lino A, Abrahão CM, Brandão RM, et al. Role of\ngemcitabine as second-line therapy after progression on FOL-\nFIRINOX in advanced pancreatic cancer: a retrospective analy-\nsis［J］. J Gastrointest Oncol, 2015, 6（5）：511-515.\n［66］Drilon A，Laetsch TW，Kummar S，et al. Efficacy of larotrec-\ntinib in TRK fusion-positive cancers in adults and children［J］.\nN Engl J Med，2018，378（8）：731-739.\n［67］Doebele RC，Drilon A，Paz- Ares L，et al. Entrectinib in pa-\ntients with advanced or metastatic NTRK fusion- positive solid\ntumours: integrated analysis of three phase 1-2 trials［J］. Lan-\ncet Oncol，2020，21（2）：271-282.\n［68］\nGolan T，Hammel P，Reni M，et al. Maintenance olaparib for\ngermline BRCA- mutated metastatic pancreatic cancer［J］. N\nEngl J Med，2019，381（4）：317-327.\n［69］\nSchultheis B，Reuter D，Ebert MP，et al. Gemcitabine com-\nbined with the monoclonal antibody nimotuzumab is an active\nfirst-line regimen in KRAS wildtype patients with locally ad-\nvanced or metastatic pancreatic cancer: a multicenter，random-\nized phase IIb study［J］. Ann Oncol，2017，28（10）：2429-\n2435.\n［70］Cocco E，Scaltriti M，Drilon A. NTRK fusion-positive cancers\nand TRK inhibitor therapy［J］. Nat Rev Clin Oncol，2018，15\n（12）：731-747.\n［71］Le DT，Durham JN，Smith KN，et al. Mismatch repair deficien-\ncy predicts response of solid tumors to PD-1 blockade［J］. Sci-\nence，2017，357（6349）：409-413.\n（2021-04-16收稿）\n·\n·738\n"}]}